////////////////////////////////////////////////////////////////////////////////
//
// Модуль для работы с цветом в 1С.
//
// Модуль использует HEX-представления цвета вида #RRGGBB
// где RR - красный, GG - зеленый, BB - синий в шестнадцатиричном представлении.
// Хранить элементы цвета с справочниках рекомендуем с типом Строка[7].
// Пример, красный цвет: #FF0000
//
// Модуль определяет работу с:
//  + HEX-представлением цвета (конвертация из HEX в цвет 1С и наоборот);
//  + HSV-представлением цвета;
//  + HSL-представлением цвета;
//  + CMYK-представлением цвета;
//  + Конвертациями из одной системы представления цвета в другую;
//  + Работа с каталогами RAL;
//  + Работа со случайными цветами;
//		+ Получение случайного цвета;
//		+ Получение случайного светлого цвета;
//		+ Получение случайного темного цвета;
//		+ Получение случайного цвета из каталога RAL Standart;
//		+ Получение случайного Web-цвета;
//  + Получение контрастных и инвертированных цветов для текста и фона;
//  + Извлечение компонент цвета (красный, зеленый, синий).
//  + Трансформация цветов:
//		+ осветление;
//		+ затемнение;
//		+ различные алголитмы градации серого;
//		+ смешивание двух цветов;
//	+ Работа с именованными CSS-цветами (black, green, white...)
//
// ToDo:
//  Добавить работу с палитрами цветов и генерацией массива гармоничных цветов.
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область HEX
	
// Функция - Цвет в шестнадцатиричный вид.
//
// Параметры:
//  Цвет - Цвет	 - исходный цвет.
// 
// Возвращаемое значение:
//  Строка - строка вида #RRGGBB - где RR - красный, GG - зеленый, BB - синий.
//
Функция ЦветВHex(Знач Цвет) Экспорт
		
	Результат = "";
	                                 
	Если Цвет.Вид = ВидЦвета.Абсолютный Тогда
		
		Результат = ДополнитьСтроку(Из_10_В_Любую(Цвет.Красный), 2)
			+ ДополнитьСтроку(Из_10_В_Любую(Цвет.Зеленый), 2)
			+ ДополнитьСтроку(Из_10_В_Любую(Цвет.Синий), 2);
			
	ИначеЕсли Цвет.Вид = ВидЦвета.WebЦвет Тогда
		
		НайденныйЦвет = КаталогWebЦветов().Получить(Цвет);               
		Если НайденныйЦвет <> Неопределено Тогда
			Возврат ЦветВHex(НайденныйЦвет); 
		Иначе
			Результат = "000000";
		КонецЕсли;                              
		
	ИначеЕсли Цвет.Вид = ВидЦвета.WindowsЦвет ИЛИ Цвет.Вид = ВидЦвета.ЭлементСтиля Тогда

        Результат = "000000";
		
		// Используем для старых версий платформы 8.3.8 и ниже		
		//#Если НЕ ВебКлиент Тогда
		//ТабДокумент = Новый ТабличныйДокумент;
		//ТабДокумент.Область(1, 1, 1, 1).ЦветФона = Цвет;
		//ВременныйФайл = ПолучитьИмяВременногоФайла("htm");
		//ТабДокумент.Записать(ВременныйФайл, ТипФайлаТабличногоДокумента.HTML);
		//ТекстовыйДокумент = Новый ТекстовыйДокумент;
		//ТекстовыйДокумент.Прочитать(ВременныйФайл);
		//Стр = ТекстовыйДокумент.ПолучитьТекст();
		//УдалитьФайлы(ВременныйФайл);
		//
		//СтрокаПоиска = "background-color:";          
		//Позиция = СтрНайти(Стр, СтрокаПоиска);
		//Если Позиция <> 0 Тогда
		//    Результат = ВРег(Сред(Стр, Позиция + СтрДлина(СтрокаПоиска) + 2, 6));
		//КонецЕсли;
		//#КонецЕсли
		
		// Для версий платформ 8.3.9 и выше.
		ПотокВПамяти = Новый ПотокВПамяти();

		ТабДокумент = Новый ТабличныйДокумент;
		ТабДокумент.Область(1, 1, 1, 1).ЦветФона = Цвет;
		ТабДокумент.Записать(ПотокВПамяти, ТипФайлаТабличногоДокумента.ODS);

		ПотокВПамяти.Перейти(0, ПозицияВПотоке.Начало);

		ТабДокумент.Прочитать(ПотокВПамяти,, ТипФайлаТабличногоДокумента.ODS);
		ЦветФона = ТабДокумент.Область(1, 1, 1, 1).ЦветФона;

		Результат = ДополнитьСтроку(Из_10_В_Любую(ЦветФона.Красный), 2)
		    + ДополнитьСтроку(Из_10_В_Любую(ЦветФона.Зеленый), 2)
		    + ДополнитьСтроку(Из_10_В_Любую(ЦветФона.Синий), 2);
		    
		ПотокВПамяти.Закрыть();
		
	Иначе
		
		Результат = "000000";
		
	КонецЕсли;
	
	Возврат "#" + Результат;
	
КонецФункции

// Возвращает из сторки в HEX-виде ее цвет.
//
// Параметры:
//	СтрокаHex - Строка - вида #RRGGBB - где RR - красный, GG - зеленый, BB - синий
//
// Возвращаемое значение:
//	Цвет - цвет.
//
Функция HexВЦвет(Знач СтрокаHex) Экспорт
    
    СтрокаHex = ВРег(СтрокаHex);
    
	Попытка
		Красный = HexToDecЧисло(Сред(СтрокаHex, 2, 2));
		Зеленый = HexToDecЧисло(Сред(СтрокаHex, 4, 2));
		Синий 	= HexToDecЧисло(Сред(СтрокаHex, 6, 2));
	Исключение
		Красный = 255;
		Зеленый = 255;
		Синий 	= 255;
	КонецПопытки;
	
	Возврат Новый Цвет(Красный, Зеленый, Синий);
	
КонецФункции

#КонецОбласти

#Область ТрансформацияЦветов

// Функция "осветляет" цвет.
//
// Параметры:
//  Цвет			 - Цвет	 - исходный цвет
//  ДельтаСветлоты	 - Число[0..100] - процент изменения светлоты цвета. Значение 0 цвет не изменен, 100 - белый.
// 
// Возвращаемое значение:
//  Цвет - осветленный цвет.
//
Функция ОсветлитьЦвет(Знач Цвет, Знач Процент) Экспорт
    
    Цвет = АбсолютныйЦвет(Цвет);    
    Дельта = Макс(Мин(Процент, 255), 0) / 100;
	
	R = Мин(Цвет.Красный + Дельта * (255 - Цвет.Красный), 255);
	G = Мин(Цвет.Зеленый + Дельта * (255 - Цвет.Зеленый), 255);
	B = Мин(Цвет.Синий   + Дельта * (255 - Цвет.Синий), 255);
	
	Возврат Новый Цвет(Окр(R), Окр(G), Окр(B));
	
КонецФункции

// Функция "затемняет" цвет.
//
// Параметры:
//  Цвет			 - Цвет	 - исходный цвет
//  ДельтаСветлоты	 - Число[0..100] - процент изменения затемнения цвета. Значение 0 цвет не изменен, 100 - черный.
// 
// Возвращаемое значение:
//  Цвет - затемненный цвет.
//
Функция ЗатемнитьЦвет(Знач Цвет, Знач Процент) Экспорт
    
    Цвет = АбсолютныйЦвет(Цвет);    
    Дельта = Макс(Мин(Процент, 255), 0) / 100;
	
	R = Макс(Цвет.Красный - Дельта * Цвет.Красный, 0);
	G = Макс(Цвет.Зеленый - Дельта * Цвет.Зеленый, 0);
	B = Макс(Цвет.Синий   - Дельта * Цвет.Синий, 0);
	
	Возврат Новый Цвет(Окр(R), Окр(G), Окр(B));    
    
КонецФункции

// Смешивание двух цветов с балансом.
//
// Параметры:
//	Цвет1 - Цвет, Строка - первый цвет.
//	Цвет2 - Цвет, Строка - второй цвет.
//  Баланс - Число[0..100] - баланс смешивания двух цветов.
//
// Возвращаемое значение:
//	Цвет - цвет получившийся при смешивании.
//      Примеры:
//          (#38c120, #3ab5ba, 50) = #39BB6D
//          (#38c120, #3ab5ba, 80) = #3AB79B
//
//  Онлайн пример: https://pinetools.com/blend-colors но там небольшая ошибка с округлениями.
//
Функция СмешатьДваЦвета(Знач Цвет1, Знач Цвет2, Знач Баланс = 50) Экспорт
    
    Если Баланс > 100 Тогда
        Баланс = 100;
    КонецЕсли;
    Если Баланс < 0 Тогда
        Баланс = 0;
    КонецЕсли;
    Баланс100 = Баланс / 100;
    
    Ц1 = АбсолютныйЦвет(Цвет1);
    Ц2 = АбсолютныйЦвет(Цвет2);
    
    Красный = Макс(Мин(Окр((Ц2.Красный - Ц1.Красный) * Баланс100 + Ц1.Красный), 255), 0);
    Зеленый = Макс(Мин(Окр((Ц2.Зеленый - Ц1.Зеленый) * Баланс100 + Ц1.Зеленый), 255), 0);
    Синий   = Макс(Мин(Окр((Ц2.Синий - Ц1.Синий) * Баланс100 + Ц1.Синий), 255), 0);
    
    Возврат Новый Цвет(Красный, Зеленый, Синий);
    
КонецФункции

// Конвертация цвета в градации серого по среднему методу.
//
// Параметры:
//	Цвет - Цвет, Строка - исходный цвет.
//
// Возвращаемое значение:
//	Цвет - цвет получившийся при градации при смешивании всех компонентов цвета и получении среднего.
//
//  Формула: (R + G + B) / 3
//  Подробнее на: https://www.johndcook.com/blog/2009/08/24/algorithms-convert-color-grayscale/
//
Функция ГрадацииСерогоAverage(Знач Цвет) Экспорт
    
    Цвет  = АбсолютныйЦвет(Цвет);
    Серый = (Цвет.Красный + Цвет.Зеленый + Цвет.Синий) / 3;
    
    Возврат Новый Цвет(Серый, Серый, Серый);
    
КонецФункции

// Конвертация цвета в градации серого по осветленному методу. Метод имеет тенденцию уменьшать контраст.
//
// Параметры:
//	Цвет - Цвет, Строка - исходный цвет.
//
// Возвращаемое значение:
//	Цвет - цвет получившийся при градации при осветлении.
//
//  Формула: (max (R, G, B) + min (R, G, B)) / 2
//  Подробнее на: https://www.johndcook.com/blog/2009/08/24/algorithms-convert-color-grayscale/
//
Функция ГрадацииСерогоLightness(Знач Цвет) Экспорт
    
    Цвет  = АбсолютныйЦвет(Цвет);
    Серый = (Макс(Цвет.Красный, Цвет.Зеленый, Цвет.Синий) + Мин(Цвет.Красный, Цвет.Зеленый, Цвет.Синий)) / 2;
    
    Возврат Новый Цвет(Серый, Серый, Серый);
    
КонецФункции

// Конвертация цвета в градации серого по методу светимости. Рекомендуется по умолчанию. Используется в редакторе GIMP.
//
// Параметры:
//	Цвет - Цвет, Строка - исходный цвет.
//
// Возвращаемое значение:
//	Цвет - цвет получившийся при градации при светимости.
//
//  Форумла: 0,21 * Red + 0,72 * Green + 0,07 * Blue
//  Этот метод работает лучше всего в целом и является методом по умолчанию, используемым в редакторе GIMP.
//  Подробнее на: https://www.johndcook.com/blog/2009/08/24/algorithms-convert-color-grayscale/
//
Функция ГрадацииСерогоLuminosity(Знач Цвет) Экспорт
    
    Цвет  = АбсолютныйЦвет(Цвет);
    Серый = 0.21 * Цвет.Красный + 0.72 * Цвет.Зеленый + 0.07 * Цвет.Синий;
    
    Возврат Новый Цвет(Серый, Серый, Серый);
    
КонецФункции

// Приводит цвет к абсолютному (ВидЦвета.Абсолютный)
//
// Параметры:
//	Цвет - Цвет, Строка - произвольный цвет, либо hex-цвет.
//
// Возвращаемое значение:
//	Цвет - цвет результат с видом ВидЦвета.Абсолютный.
//
Функция АбсолютныйЦвет(Знач Цвет) Экспорт
    
	Если ТипЗнч(Цвет) = Тип("Цвет") Тогда
		ИсходныйЦвет = Цвет;
	ИначеЕсли ТипЗнч(Цвет) = Тип("Строка") Тогда
		ИсходныйЦвет = HexВЦвет(Цвет);
	Иначе
		Возврат Новый Цвет(0, 0, 0);
	КонецЕсли;
	
	// Преобразования для не абсолютных ветов.
	Если ИсходныйЦвет.Вид <> ВидЦвета.Абсолютный Тогда
		ИсходныйЦвет = HexВЦвет(ЦветВHex(ИсходныйЦвет));
	КонецЕсли;
    
    Возврат ИсходныйЦвет;
    
КонецФункции

// Возвращает массив цветов, представляющих собой градиент - переход от начального цвета к конечному. 
// Возвращаемый массив начинается с начального и заканчивается конечным цветом.
// Автор: https://infostart.ru/public/978835/
//
//Параметры:
//		НачальныйЦвет - Цвет - начальный цвет градиента
//		КонечныйЦвет - Цвет - конечный цвет градиента
//		КоличествоГрадаций - Число - общее число цветов в возвращаемом массиве (включает начальный и конечный цвета), должно быть больше 2. По умолчанию 5.
//
//Возвращаемое значение:
//		Массив,Неопределено - массив с элементами типа Цвет или Неопределено (если градаций меньше 3 либо начальный и конечный цвета
//								заданы не абсолютными цветами
//
Функция ПолучитьГрадиент(Знач НачальныйЦвет, Знач КонечныйЦвет, Знач КоличествоГрадаций = 5) Экспорт
	
	мНачальныйЦвет = АбсолютныйЦвет(НачальныйЦвет);
	мКонечныйЦвет = АбсолютныйЦвет(КонечныйЦвет);
	
	МассивЦветов = Новый Массив;
	МассивЦветов.Добавить(НачальныйЦвет);
	
	Если КоличествоГрадаций > 2 Тогда
		ШагКрасного = (мКонечныйЦвет.Красный - мНачальныйЦвет.Красный) / КоличествоГрадаций;
		ШагЗеленого = (мКонечныйЦвет.Зеленый - мНачальныйЦвет.Зеленый) / КоличествоГрадаций;
		ШагСинего   = (мКонечныйЦвет.Синий - мНачальныйЦвет.Синий) / КоличествоГрадаций;
		
		ТекКрасный  = мНачальныйЦвет.Красный;
		ТекЗеленый  = мНачальныйЦвет.Зеленый;
		ТекСиний    = мНачальныйЦвет.Синий;
		
		Для Сч = 2 По КоличествоГрадаций Цикл
			ТекКрасный  = ТекКрасный + ШагКрасного;
			ТекЗеленый  = ТекЗеленый + ШагЗеленого;
			ТекСиний    = ТекСиний + ШагСинего;
			
			МассивЦветов.Добавить(Новый Цвет(Окр(ТекКрасный,0), Окр(ТекЗеленый,0), Окр(ТекСиний,0)));
		КонецЦикла;
		
		МассивЦветов[МассивЦветов.ВГраница()] = мКонечныйЦвет;
		
		Возврат МассивЦветов;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

// Возвращает из сторки в HEX-виде ее красную составляющую.
//
// Параметры:
//	СтрокаHex - Строка - вида #RRGGBB - где RR - красный, GG - зеленый, BB - синий
//
// Возвращаемое значение:
//	Число - составляющая.
//
Функция КрасныйИзHex(Знач СтрокаHex) Экспорт
	
	Цвет = HexВЦвет(СтрокаHex);
	Возврат Цвет.Красный;
	
КонецФункции

// Возвращает из сторки в HEX-виде ее зеленую составляющую.
//
// Параметры:
//	СтрокаHex - Строка - вида #RRGGBB - где RR - красный, GG - зеленый, BB - синий
//
// Возвращаемое значение:
//	Число - составляющая.
//
Функция ЗеленыйИзHex(Знач СтрокаHex) Экспорт
	
	Цвет = HexВЦвет(СтрокаHex);
	Возврат Цвет.Зеленый;
	
КонецФункции

// Возвращает из сторки в HEX-виде ее синюю составляющую.
//
// Параметры:
//	СтрокаHex - Строка - вида #RRGGBB - где RR - красный, GG - зеленый, BB - синий
//
// Возвращаемое значение:
//	Число - составляющая.
//
Функция СинийИзHex(Знач СтрокаHex) Экспорт
	
	Цвет = HexВЦвет(СтрокаHex);
	Возврат Цвет.Синий;
	
КонецФункции

// По переданному цвету возвращает контрастный белый или черный цвет.
// Позволяет получать для цвета фона цвет текста.
// Можно пользоваться в связке цвет фона получить из СлучайныйЦвет(),
// а цвет текста используя эту функцию.
//
// Параметры:
//	Цвет - Цвет - исходный цвет.
//
// Возвращаемое значение:
//	Цвет - цвет контраста.
// Пример: для цвета #FFFFFF вернет #000000
//
Функция КонтрастныйЦвет(Знач Цвет) Экспорт
	    
    ИсходныйЦвет = АбсолютныйЦвет(Цвет);
	
	Красный = ИсходныйЦвет.Красный;
	Зеленый = ИсходныйЦвет.Зеленый;
	Синий 	= ИсходныйЦвет.Синий;
	
 	Цветность 		= 1 - (0.299 * Красный + 0.587 * Зеленый + 0.114 * Синий) / 255;
	ЦветРезультата 	= ?(Цветность < 0.5, 0, 255);
  	
  	Возврат Новый Цвет(ЦветРезультата, ЦветРезультата, ЦветРезультата);
	
КонецФункции

// По переданному цвету возвращает инвертированный (противоположный) цвет.
// Позволяет получать для цвета фона цвет текста.
// Можно пользоваться в связке цвет фона получить из СлучайныйЦвет(),
// а цвет текста используя эту функцию.
//
// Параметры:
//	Цвет - Цвет - исходный цвет.
//
// Возвращаемое значение:
//	Цвет - цвет контраста.
// Пример: для цвета #5200A3 вернет #ADFF5C
//
Функция ИнвертированныйЦвет(Знач Цвет) Экспорт
    
    ИсходныйЦвет = АбсолютныйЦвет(Цвет);
	
	Красный = ИсходныйЦвет.Красный;
	Зеленый = ИсходныйЦвет.Зеленый;
	Синий 	= ИсходныйЦвет.Синий;
	  	
  	Возврат Новый Цвет(255 - Красный, 255 - Зеленый, 255 - Синий);
	
КонецФункции

// Выполняет Hue Shift. Свдиг компоненты Hue в цвете на нужное количество градусов.
//
// Параметры:
//	Цвет - Цвет - исходный цвет.
//  Оттенок - Число - градус сдвига. Имеет смысл -180 до 180, если не в диапазоне будет к нему приведен.
//
// Возвращаемое значение:
//	Цвет - цвет с Hue Shift.
//
Функция СдвигОттенкаЦвета(Знач Цвет, Знач Оттенок = 0) Экспорт
    
    hsv = ЦветВHSV(Цвет);
    hsv.h = hsv.h + Оттенок;
    Пока hsv.h >= 360 Цикл
        hsv.h = hsv.h - 360;
    КонецЦикла;
    Пока hsv.h < 0 Цикл 
        hsv.h = hsv.h + 360;
    КонецЦикла;
    
    Возврат HSVВЦвет(hsv);
        
КонецФункции

#КонецОбласти

#Область CSS

// Возвращает абсолютный цвет по CSS-цвету.
//
// Параметры:
//	ИмяЦвета - Строка - имя цвета как он пишется в CSS
//
// Возвращаемое значение:
//	Цвет - абсолютный цвет или Неопределено, если цвет не найдет.
// Пример:
//	ЦветПоИмениВCSS("black") вернет Новый Цвет(0, 0, 0)
//  ЦветПоИмениВCSS("aqua") вернет Новый Цвет(0, 255, 255)
//
Функция ЦветПоИмениВCSS(Знач ИмяЦвета) Экспорт
	
	Возврат КаталогCSSЦветов().Получить(НРег(ИмяЦвета));
	
КонецФункции

#КонецОбласти

#Область HSV

// Возвращает цвет из цветовой модели HSV.
//
// Параметры:
//	iH - Число от 0 до 360 - Hue.
//	iS - Число от 0 до 100 - Saturation.
//	iV - Число от 0 до 100 - Value/Brightness.
//
// Возвращаемое значение:
//	Цвет - цвет.
//
Функция HSVВЦветПоКомпонентам(Знач iH, Знач iS, Знач iV) Экспорт
	
	H = iH;
	S = iS / 100;
	V = iV / 100;
	
	C = S * V;
	
	fmod = (H / 60.0) % 2;
	
	X = C * (1 - ?(fmod - 1 >= 0, fmod - 1, 1 - fmod));
	m = V - C;

	Если H >= 0 И H < 60 Тогда
		Rs = C;
		Gs = X;
		Bs = 0;	
	ИначеЕсли H >= 60 И H < 120 Тогда
		Rs = X;
		Gs = C;
		Bs = 0;	
	ИначеЕсли H >= 120 И H < 180 Тогда
		Rs = 0;
		Gs = C;
		Bs = X;	
	ИначеЕсли H >= 180 И H < 240 Тогда
		Rs = 0;
		Gs = X;
		Bs = C;	
	ИначеЕсли H >= 240 И H < 300 Тогда
		Rs = X;
		Gs = 0;
		Bs = C;	
	Иначе
		Rs = C;
		Gs = 0;
		Bs = X;	
	КонецЕсли;
	
	Возврат Новый Цвет(
		Окр((Rs + m) * 255, 0, РежимОкругления.Окр15как20),
		Окр((Gs + m) * 255, 0, РежимОкругления.Окр15как20),
		Окр((Bs + m) * 255, 0, РежимОкругления.Окр15как20));
	
КонецФункции

// Возвращает цвет из цветовой модели HSV.
//
// Параметры:
//  СтруктураHSV - Cтруктура
//	    * h - Число от 0 до 360 - Hue.
//	    * s - Число от 0 до 100 - Saturation.
//	    * v - Число от 0 до 100 - Value/Brightness.
//
// Возвращаемое значение:
//	Цвет - цвет.
//
Функция HSVВЦвет(Знач СтруктураHSV) Экспорт
    
    Возврат HSVВЦветПоКомпонентам(СтруктураHSV.h, СтруктураHSV.s, СтруктураHSV.v);
    
КонецФункции

// Конвертирует цвет в HSV-структуру.
//
// Параметры:
//  Цвет - Цвет	 - исходный цвет.
//
// Возвращаемое значение:
//  Cтруктура
//	    * h - Число от 0 до 360 - Hue.
//	    * s - Число от 0 до 100 - Saturation.
//	    * v - Число от 0 до 100 - Value/Brightness.
//
Функция ЦветВHSV(Знач Цвет) Экспорт
    
    Цвет = АбсолютныйЦвет(Цвет);

    r = Цвет.Красный;
    g = Цвет.Зеленый;
    b = Цвет.Синий;
			
	min = Мин(r, g, b);
	max = Макс(r, g, b);
	delta = max - min;
	h = 0;
	s = 0;
	v = max;

	v = Окр(max / 255 * 100);
	Если max <> 0 И delta <> 0 Тогда
	    s = Окр(delta / max * 100);
	Иначе
	    // black
	    Возврат Новый Структура("h, s, v", 0, 0, 0);
	КонецЕсли;

	Если( r = max ) Тогда
	    h = ( g - b ) / delta;         // between yellow & magenta
	ИначеЕсли ( g = max ) Тогда
	    h = 2 + ( b - r ) / delta;     // between cyan & yellow
	Иначе
	    h = 4 + ( r - g ) / delta;     // between magenta & cyan
	КонецЕсли;

	h = Окр(h * 60);            		// degrees
	Если ( h < 0 ) Тогда 
	    h = h + 360; 
	КонецЕсли;

    Возврат Новый Структура("h, s, v", h, s, v);
    
КонецФункции

// Возвращает HEX-цвет вида #RRGGBB из цветовой модели HSV.
//
// Параметры:
//	iH - Число от 0 до 360 - Hue.
//	iS - Число от 0 до 100 - Saturation.
//	iV - Число от 0 до 100 - Value/Brightness.
//
// Возвращаемое значение:
//	Строка - строка в HEX-формате #RRGGBB (RR - красный, GG - зеленыый, BB - синий).
//
Функция HSVВВHex(Знач iH, Знач iS, Знач iV) Экспорт
	
	Возврат ЦветВHex(HSVВЦветПоКомпонентам(iH, iS, iV))
	
КонецФункции

// Из HEX-цвета вида #RRGGBB возвращает цвет в цветовой модели HSV.
//
// Параметры:
//	СтрокаHex - строка в HEX-формате #RRGGBB (RR - красный, GG - зеленыый, BB - синий).
//
// Возвращаемое значение:
//  Cтруктура
//	    * h - Число от 0 до 360 - Hue.
//	    * s - Число от 0 до 100 - Saturation.
//	    * v - Число от 0 до 100 - Value/Brightness.
//
Функция HexВHSV(Знач СтрокаHex) Экспорт
	
	Возврат ЦветВHSV(HexВЦвет(СтрокаHex));
	
КонецФункции

#КонецОбласти

#Область CMYK

// Возвращает цвет из цветовой модели CMYK.
//
// Параметры:
//	c - Число от 0 до 100 - Cyan
//	m - Число от 0 до 100 - Magenta
//	y - Число от 0 до 100 - Yellow
//	k - Число от 0 до 100 - Key или Black
//
// Возвращаемое значение:
//	Цвет - цвет.
//
Функция CMYKВЦвет(Знач c, Знач m, Знач y, Знач k) Экспорт
    
    c = c / 100;
    m = m / 100;
    y = y / 100;
    k = k / 100;

    r = 1 - Мин(1, c * ( 1 - k ) + k);
    g = 1 - Мин(1, m * ( 1 - k ) + k);
    b = 1 - Мин(1, y * ( 1 - k ) + k);

    r = Окр(r * 255);
    g = Окр(g * 255);
    b = Окр(b * 255);
    
    Возврат Новый Цвет(r, g, b);

КонецФункции

// Цвет в структуру CMYK вид.
//
// Параметры:
//  Цвет - Цвет	 - исходный цвет.
// 
// Возвращаемое значение:
//  Структура - структура с цветом в CMYK.
//	    * c - Число от 0 до 100 - Cyan.
//	    * m - Число от 0 до 100 - Magenta.
//	    * y - Число от 0 до 100 - Yellow.
//	    * k - Число от 0 до 100 - Key или Black.
//
Функция ЦветВCMYK(Знач Цвет) Экспорт
    
    АбсолютныйЦвет = ЦветВHex(Цвет);
    
    result = Новый Структура();
    result.Вставить("c", 0);
    result.Вставить("m", 0);
    result.Вставить("y", 0);
    result.Вставить("k", 0);

    r = КрасныйИзHex(АбсолютныйЦвет) / 255;
    g = ЗеленыйИзHex(АбсолютныйЦвет) / 255;
    b = СинийИзHex(АбсолютныйЦвет) / 255;

    result.k = Мин( 1 - r, 1 - g, 1 - b );
	
	Если result.k = 1 Тогда
	    result.c = 0;
	    result.m = 0;
	    result.y = 0;
	Иначе
	    result.c = ( 1 - r - result.k ) / ( 1 - result.k );
	    result.m = ( 1 - g - result.k ) / ( 1 - result.k );
	    result.y = ( 1 - b - result.k ) / ( 1 - result.k );
		
	    result.c = Окр( result.c * 100 );
	    result.m = Окр( result.m * 100 );
	    result.y = Окр( result.y * 100 );
	    result.k = Окр( result.k * 100 );
	КонецЕсли;

    return result;    
    
КонецФункции

// Возвращает HEX-цвет из цветовой модели CMYK.
//
// Параметры:
//	c - Число от 0 до 100 - Cyan
//	m - Число от 0 до 100 - Magenta
//	y - Число от 0 до 100 - Yellow
//	k - Число от 0 до 100 - Key или Black
//
// Возвращаемое значение:
//	Строка - строка в HEX-формате #RRGGBB (RR - красный, GG - зеленыый, BB - синий).
//
Функция CMYKВHex(Знач c, Знач m, Знач y, Знач k) Экспорт

    Возврат ЦветВHex(CMYKВЦвет(c, m, y, k))
    
КонецФункции

// Из HEX-цвета вида #RRGGBB возвращает цвет в цветовой модели CMYK.
//
// Параметры:
//	СтрокаHex - строка в HEX-формате #RRGGBB (RR - красный, GG - зеленыый, BB - синий).
//
// Возвращаемое значение:
//  Структура - структура с цветом в CMYK.
//	    * c - Число от 0 до 100 - Cyan.
//	    * m - Число от 0 до 100 - Magenta.
//	    * y - Число от 0 до 100 - Yellow.
//	    * k - Число от 0 до 100 - Key или Black.
//
Функция HexВCMYK(Знач СтрокаHex) Экспорт
	
	Возврат ЦветВCMYK(HexВЦвет(СтрокаHex));
	
КонецФункции

#КонецОбласти

#Область HSL

// Конвертирует цвет в HSL-структуру.
//
// Параметры:
//  Цвет - Цвет	 - исходный цвет.
//
// Возвращаемое значение:
//  Cтруктура
//	    * h - Число от 0 до 360 - Hue.
//	    * s - Число от 0 до 100 - Saturation.
//	    * l - Число от 0 до 100 - lightness.
//
Функция ЦветВHSL(Знач Цвет) Экспорт
    
    Цвет = АбсолютныйЦвет(Цвет);

    r = Цвет.Красный / 255;
    g = Цвет.Зеленый / 255;
    b = Цвет.Синий / 255;
    
    МаксЗначение = Макс(r, g, b);
    МинЗначение = Мин(r, g, b);
    h = 0;
    s = 0;
    l = (МаксЗначение + МинЗначение) / 2;

    Если (МаксЗначение = МинЗначение) Тогда
        h = 0;
        s = 0; // achromatic
    Иначе
        d = МаксЗначение - МинЗначение;
        s = ?(l > 0.5, d / (2 - МаксЗначение - МинЗначение), d / (МаксЗначение + МинЗначение));
        Если (МаксЗначение = r) Тогда
            h = (g - b) / d + ?(g < b, 6, 0);
        ИначеЕсли МаксЗначение = g Тогда
            h = (b - r) / d + 2;
        Иначе
            h = (r - g) / d + 4;
        КонецЕсли;
        
        h = h / 6;
    КонецЕсли;

    Возврат Новый Структура("h, s, l", 
        Окр(h * 360), 
        Окр(s * 100),
        Окр(l * 100));
    
КонецФункции

// Конвертирует HSL-структура в абсолютный цвет.
//
// Параметры:
//  СтруктураHSL - исходная структура с представлением цвета.
//	    * h - Число от 0 до 360 - Hue.
//	    * s - Число от 0 до 100 - Saturation.
//	    * l - Число от 0 до 100 - Lightness.
//
// Возвращаемое значение:
//	Цвет - абсолютный цвет.
//
Функция HSLВЦвет(Знач СтруктураHSL) Экспорт
    
    h = СтруктураHSL.h;
    s = СтруктураHSL.s;
    l = СтруктураHSL.l;
    
    r = 0;
    g = 0;
    b = 0;
    
    Если s = 0 Тогда
        r = l;
        g = l;
        b = l; // achromatic
    Иначе
        
        q = ?(l < 0.5, l * (1 + s), l + s - l * s);
        p = 2 * l - q;
        
        r = HUE2RGB(p, q, h + 1/3);
        g = HUE2RGB(p, q, h);
        b = HUE2RGB(p, q, h - 1/3);
        
    КонецЕсли;
    
    Возврат Новый Цвет(r * 255, g * 255, b * 255);
    
КонецФункции

// Конвертирует HSL-структура в цвет.
//
// Параметры:
//  СтруктураHSL - исходная структура с представлением цвета.
//	    * h - Число от 0 до 360 - Hue.
//	    * s - Число от 0 до 100 - Saturation.
//	    * l - Число от 0 до 100 - Lightness.
//
// Возвращаемое значение:
//	Строка - цвет в формате HEX-строки.
//
Функция HSLВHex(Знач СтруктураHSL) Экспорт
    
    Возврат ЦветВHex(HSLВЦвет(СтруктураHSL));
    
КонецФункции

// Конвертирует цвет в HEX-формате в HSL-структуру.
//
// Параметры:
//  Hex - Строка	 - исходный цвет в HEX-формате.
//
// Возвращаемое значение:
//  Cтруктура
//	    * h - Число от 0 до 360 - Hue.
//	    * s - Число от 0 до 100 - Saturation.
//	    * l - Число от 0 до 100 - lightness.
//
Функция HexВHSL(Знач Hex) Экспорт
    
    Возврат ЦветВHSL(Hex);
    
КонецФункции

#КонецОбласти

#Область КаталогиЦветов

// Возвращает таблицу Web-цветов с абсолютными цветами.
//
// Возвращаемое значение:
//	Соответствие - Соответствие с цветами.
//
Функция КаталогWebЦветов() Экспорт
	
	Соответствие = Новый Соответствие;
    	
	Соответствие.Вставить(WebЦвета.Аквамарин,					Новый Цвет(127, 255, 212));
	Соответствие.Вставить(WebЦвета.АкварельноСиний,				Новый Цвет(240, 248, 255));
	Соответствие.Вставить(WebЦвета.АнтикБелый,					Новый Цвет(250, 235, 215));
	Соответствие.Вставить(WebЦвета.Бежевый,						Новый Цвет(245, 245, 220));
	Соответствие.Вставить(WebЦвета.Белоснежный,					Новый Цвет(255, 250, 250));
	Соответствие.Вставить(WebЦвета.Белый,						Новый Цвет(255, 255, 255));
	Соответствие.Вставить(WebЦвета.Бирюзовый,					Новый Цвет(064, 224, 208));
	Соответствие.Вставить(WebЦвета.БледноБирюзовый,				Новый Цвет(175, 238, 238));
	Соответствие.Вставить(WebЦвета.БледноЗеленый,				Новый Цвет(152, 251, 152));
	Соответствие.Вставить(WebЦвета.БледноЗолотистый,			Новый Цвет(238, 232, 170));
	Соответствие.Вставить(WebЦвета.БледноКрасноФиолетовый,		Новый Цвет(219, 112, 147));
	Соответствие.Вставить(WebЦвета.БледноЛиловый,				Новый Цвет(230, 230, 250));
	Соответствие.Вставить(WebЦвета.БледноМиндальный,			Новый Цвет(255, 235, 205));
	Соответствие.Вставить(WebЦвета.БледноСиреневый,				Новый Цвет(216, 191, 216));
	Соответствие.Вставить(WebЦвета.Васильковый,					Новый Цвет(100, 149, 237));
	Соответствие.Вставить(WebЦвета.ВесеннеЗеленый,				Новый Цвет(000, 255, 127));
	Соответствие.Вставить(WebЦвета.Голубой,						Новый Цвет(166, 202, 240));
	Соответствие.Вставить(WebЦвета.ГолубойСКраснымОттенком,		Новый Цвет(255, 240, 245));
	Соответствие.Вставить(WebЦвета.ГолубойСоСтальнымОттенком,	Новый Цвет(176, 196, 222));
	Соответствие.Вставить(WebЦвета.ГрифельноСерый,				Новый Цвет(112, 128, 144));
	Соответствие.Вставить(WebЦвета.ГрифельноСиний,				Новый Цвет(106, 090, 205));
	Соответствие.Вставить(WebЦвета.Древесный,					Новый Цвет(222, 184, 135));
	Соответствие.Вставить(WebЦвета.ДымчатоБелый,				Новый Цвет(245, 245, 245));
	Соответствие.Вставить(WebЦвета.ЖелтоЗеленый,				Новый Цвет(154, 205, 050));
	Соответствие.Вставить(WebЦвета.Желтый,						Новый Цвет(255, 255, 000));
	Соответствие.Вставить(WebЦвета.ЗамшаСветлый,				Новый Цвет(255, 228, 181));
	Соответствие.Вставить(WebЦвета.ЗеленаяЛужайка,				Новый Цвет(124, 252, 000));
	Соответствие.Вставить(WebЦвета.ЗеленоЖелтый,				Новый Цвет(173, 255, 047));
	Соответствие.Вставить(WebЦвета.ЗеленоватоЖелтый,			Новый Цвет(127, 255, 000));
	Соответствие.Вставить(WebЦвета.ЗеленоватоЛимонный,			Новый Цвет(000, 255, 000));
	Соответствие.Вставить(WebЦвета.Зеленый,						Новый Цвет(000, 128, 000));
	Соответствие.Вставить(WebЦвета.ЗеленыйЛес,					Новый Цвет(034, 139, 034));
	Соответствие.Вставить(WebЦвета.Золотистый,					Новый Цвет(218, 165, 032));
	Соответствие.Вставить(WebЦвета.Золотой,						Новый Цвет(255, 215, 000));
	Соответствие.Вставить(WebЦвета.Индиго,						Новый Цвет(075, 000, 130));
	Соответствие.Вставить(WebЦвета.Киноварь,					Новый Цвет(205, 092, 092));
	Соответствие.Вставить(WebЦвета.Кирпичный,					Новый Цвет(178, 034, 034));
	Соответствие.Вставить(WebЦвета.КожаноКоричневый,			Новый Цвет(139, 069, 019));
	Соответствие.Вставить(WebЦвета.Коралловый,					Новый Цвет(255, 127, 080));
	Соответствие.Вставить(WebЦвета.Коричневый,					Новый Цвет(165, 042, 042));
	Соответствие.Вставить(WebЦвета.КоролевскиГолубой,			Новый Цвет(065, 105, 225));
	Соответствие.Вставить(WebЦвета.КрасноФиолетовый,			Новый Цвет(208, 032, 144));
	Соответствие.Вставить(WebЦвета.Красный,						Новый Цвет(255, 000, 000));
	Соответствие.Вставить(WebЦвета.Кремовый,					Новый Цвет(255, 251, 240));
	Соответствие.Вставить(WebЦвета.Лазурный,					Новый Цвет(240, 255, 255));
	Соответствие.Вставить(WebЦвета.ЛимонноЗеленый,				Новый Цвет(050, 205, 050));
	Соответствие.Вставить(WebЦвета.Лимонный,					Новый Цвет(255, 250, 205));
	Соответствие.Вставить(WebЦвета.Лосось,						Новый Цвет(250, 128, 114));
	Соответствие.Вставить(WebЦвета.ЛососьСветлый,				Новый Цвет(255, 160, 122));
	Соответствие.Вставить(WebЦвета.ЛососьТемный,				Новый Цвет(233, 150, 122));
	Соответствие.Вставить(WebЦвета.Льняной,						Новый Цвет(250, 240, 230));
	Соответствие.Вставить(WebЦвета.Малиновый,					Новый Цвет(220, 020, 060));
	Соответствие.Вставить(WebЦвета.МятныйКрем,					Новый Цвет(245, 255, 250));
	Соответствие.Вставить(WebЦвета.НавахоБелый,					Новый Цвет(255, 222, 173));
	Соответствие.Вставить(WebЦвета.НасыщенноНебесноГолубой,		Новый Цвет(000, 191, 255));
	Соответствие.Вставить(WebЦвета.НасыщенноРозовый,			Новый Цвет(255, 020, 147));
	Соответствие.Вставить(WebЦвета.НебесноГолубой,				Новый Цвет(135, 206, 235));
	Соответствие.Вставить(WebЦвета.НейтральноАквамариновый,		Новый Цвет(102, 205, 170));
	Соответствие.Вставить(WebЦвета.НейтральноБирюзовый,			Новый Цвет(072, 209, 204));
	Соответствие.Вставить(WebЦвета.НейтральноВесеннеЗеленый,	Новый Цвет(000, 250, 154));
	Соответствие.Вставить(WebЦвета.НейтральноГрифельноСиний,	Новый Цвет(123, 104, 238));
	Соответствие.Вставить(WebЦвета.НейтральноЗеленый,			Новый Цвет(192, 220, 192));
	Соответствие.Вставить(WebЦвета.НейтральноКоричневый,		Новый Цвет(205, 133, 63));
	Соответствие.Вставить(WebЦвета.НейтральноПурпурный,			Новый Цвет(147, 112, 219));
	Соответствие.Вставить(WebЦвета.НейтральноСерый,				Новый Цвет(160, 160, 164));
	Соответствие.Вставить(WebЦвета.НейтральноСиний,				Новый Цвет(000, 000, 205));
	Соответствие.Вставить(WebЦвета.НейтральноФиолетовоКрасный,	Новый Цвет(199, 021, 133));
	Соответствие.Вставить(WebЦвета.Оливковый,					Новый Цвет(128, 128, 000));
	Соответствие.Вставить(WebЦвета.ОранжевоКрасный,				Новый Цвет(255, 069, 000));
	Соответствие.Вставить(WebЦвета.Оранжевый,					Новый Цвет(255, 165, 000));
	Соответствие.Вставить(WebЦвета.Орхидея,						Новый Цвет(218, 112, 214));
	Соответствие.Вставить(WebЦвета.ОрхидеяНейтральный,			Новый Цвет(186, 085, 211));
	Соответствие.Вставить(WebЦвета.ОрхидеяТемный,				Новый Цвет(153, 050, 204));
	Соответствие.Вставить(WebЦвета.Охра,						Новый Цвет(160, 082, 045));
	Соответствие.Вставить(WebЦвета.Перламутровый,				Новый Цвет(255, 245, 238));
	Соответствие.Вставить(WebЦвета.Персиковый,					Новый Цвет(255, 218, 185));
	Соответствие.Вставить(WebЦвета.ПесочноКоричневый,			Новый Цвет(244, 164, 096));
	Соответствие.Вставить(WebЦвета.ПолночноСиний,				Новый Цвет(025, 025, 112));
	Соответствие.Вставить(WebЦвета.ПризрачноБелый,				Новый Цвет(248, 248, 255));
	Соответствие.Вставить(WebЦвета.Пурпурный,					Новый Цвет(128, 000, 128));
	Соответствие.Вставить(WebЦвета.Пшеничный,					Новый Цвет(245, 222, 179));
	Соответствие.Вставить(WebЦвета.РозовоКоричневый,			Новый Цвет(188, 143, 143));
	Соответствие.Вставить(WebЦвета.Розовый,						Новый Цвет(255, 192, 203));
	Соответствие.Вставить(WebЦвета.Роса,						Новый Цвет(240, 255, 240));
	Соответствие.Вставить(WebЦвета.РыжеватоКоричневый,			Новый Цвет(210, 180, 140));
	Соответствие.Вставить(WebЦвета.СветлоГрифельноСерый,		Новый Цвет(119, 136, 153));
	Соответствие.Вставить(WebЦвета.СветлоГрифельноСиний,		Новый Цвет(132, 112, 255));
	Соответствие.Вставить(WebЦвета.СветлоЖелтый,				Новый Цвет(255, 255, 224));
	Соответствие.Вставить(WebЦвета.СветлоЖелтыйЗолотистый,		Новый Цвет(250, 250, 210));
	Соответствие.Вставить(WebЦвета.СветлоЗеленый,				Новый Цвет(144, 238, 144));
	Соответствие.Вставить(WebЦвета.СветлоЗолотистый,			Новый Цвет(255, 236, 139));
	Соответствие.Вставить(WebЦвета.СветлоКоралловый,			Новый Цвет(240, 128, 128));
	Соответствие.Вставить(WebЦвета.СветлоКоричневый,			Новый Цвет(255, 228, 196));
	Соответствие.Вставить(WebЦвета.СветлоНебесноГолубой,		Новый Цвет(135, 206, 250));
	Соответствие.Вставить(WebЦвета.СветлоРозовый,				Новый Цвет(255, 182, 193));
	Соответствие.Вставить(WebЦвета.СветлоСерый,					Новый Цвет(192, 192, 192));
	Соответствие.Вставить(WebЦвета.СеребристоСерый,				Новый Цвет(220, 220, 220));
	Соответствие.Вставить(WebЦвета.Серебряный,					Новый Цвет(192, 192, 192));
	Соответствие.Вставить(WebЦвета.СероСиний,					Новый Цвет(095, 158, 160));
	Соответствие.Вставить(WebЦвета.Серый,						Новый Цвет(128, 128, 128));
	Соответствие.Вставить(WebЦвета.СинеСерый,					Новый Цвет(030, 144, 255));
	Соответствие.Вставить(WebЦвета.СинеФиолетовый,				Новый Цвет(138, 043, 226));
	Соответствие.Вставить(WebЦвета.Синий,						Новый Цвет(000, 000, 255));
	Соответствие.Вставить(WebЦвета.СинийСПороховымОттенком,		Новый Цвет(176, 224, 230));
	Соответствие.Вставить(WebЦвета.СинийСоСтальнымОттенком,		Новый Цвет(070, 130, 180));
	Соответствие.Вставить(WebЦвета.Сливовый,					Новый Цвет(221, 160, 221));
	Соответствие.Вставить(WebЦвета.СлоноваяКость,				Новый Цвет(255, 255, 240));
	Соответствие.Вставить(WebЦвета.СтароеКружево,				Новый Цвет(253, 245, 230));
	Соответствие.Вставить(WebЦвета.ТемноБирюзовый,				Новый Цвет(000, 206, 209));
	Соответствие.Вставить(WebЦвета.ТемноБордовый,				Новый Цвет(128, 000, 000));
	Соответствие.Вставить(WebЦвета.ТемноГрифельноСерый,			Новый Цвет(047, 079, 079));
	Соответствие.Вставить(WebЦвета.ТемноГрифельноСиний,			Новый Цвет(072, 061, 139));
	Соответствие.Вставить(WebЦвета.ТемноЗеленый,				Новый Цвет(000, 100, 000));
	Соответствие.Вставить(WebЦвета.ТемноЗолотистый,				Новый Цвет(184, 134, 011));
	Соответствие.Вставить(WebЦвета.ТемноКрасный,				Новый Цвет(139, 000, 000));
	Соответствие.Вставить(WebЦвета.ТемноОливковоЗеленый,		Новый Цвет(085, 107, 47));
	Соответствие.Вставить(WebЦвета.ТемноОранжевый,				Новый Цвет(255, 140, 000));
	Соответствие.Вставить(WebЦвета.ТемноСерый,					Новый Цвет(169, 169, 169));
	Соответствие.Вставить(WebЦвета.ТемноСиний,					Новый Цвет(000, 000, 139));
	Соответствие.Вставить(WebЦвета.ТемноФиолетовый,				Новый Цвет(148, 000, 211));
	Соответствие.Вставить(WebЦвета.ТеплоРозовый,				Новый Цвет(255, 105, 180));
	Соответствие.Вставить(WebЦвета.Томатный,					Новый Цвет(255, 099, 071));
	Соответствие.Вставить(WebЦвета.ТопленоеМолоко,				Новый Цвет(255, 239, 213));
	Соответствие.Вставить(WebЦвета.ТусклоОливковый,				Новый Цвет(107, 142, 035));
	Соответствие.Вставить(WebЦвета.ТусклоРозовый,				Новый Цвет(255, 228, 225));
	Соответствие.Вставить(WebЦвета.ТусклоСерый,					Новый Цвет(105, 105, 105));
	Соответствие.Вставить(WebЦвета.Ультрамарин,					Новый Цвет(000, 000, 128));
	Соответствие.Вставить(WebЦвета.Фиолетовый,					Новый Цвет(238, 130, 238));
	Соответствие.Вставить(WebЦвета.Фуксин,						Новый Цвет(255, 000, 255));
	Соответствие.Вставить(WebЦвета.ФуксинТемный,				Новый Цвет(139, 000, 139));
	Соответствие.Вставить(WebЦвета.Фуксия,						Новый Цвет(255, 000, 255));
	Соответствие.Вставить(WebЦвета.Хаки,						Новый Цвет(240, 230, 140));
	Соответствие.Вставить(WebЦвета.ХакиТемный,					Новый Цвет(189, 183, 107));
	Соответствие.Вставить(WebЦвета.ЦветМорскойВолны,			Новый Цвет(046, 139, 087));
	Соответствие.Вставить(WebЦвета.ЦветМорскойВолныНейтральный,	Новый Цвет(060, 179, 113));
	Соответствие.Вставить(WebЦвета.ЦветМорскойВолныСветлый,		Новый Цвет(032, 178, 170));
	Соответствие.Вставить(WebЦвета.ЦветМорскойВолныТемный,		Новый Цвет(143, 188, 139));
	Соответствие.Вставить(WebЦвета.ЦветокБелый,					Новый Цвет(255, 250, 240));
	Соответствие.Вставить(WebЦвета.Циан,						Новый Цвет(000, 255, 255));
	Соответствие.Вставить(WebЦвета.ЦианАкварельный,				Новый Цвет(000, 255, 255));
	Соответствие.Вставить(WebЦвета.ЦианНейтральный,				Новый Цвет(000, 128, 128));
	Соответствие.Вставить(WebЦвета.ЦианСветлый,					Новый Цвет(224, 255, 255));
	Соответствие.Вставить(WebЦвета.ЦианТемный,					Новый Цвет(000, 139, 139));
	Соответствие.Вставить(WebЦвета.Черный,						Новый Цвет(000, 000, 000));
	Соответствие.Вставить(WebЦвета.ШелковыйОттенок,				Новый Цвет(255, 248, 220));
	Соответствие.Вставить(WebЦвета.Шоколадный,					Новый Цвет(210, 105, 30));
	
	Возврат Соответствие;
	
КонецФункции

// Возвращает соответствие каталога RAL Standart.
//
// Параметры:
//	Нет.
//
// Возвращаемое значение:
//	Соответствие
//      * Ключ - Строка- Цифровой цвет без префикса RAL. Пример "1001".
//      * Значение - Цвет - цвет.
//
Функция КаталогRALStandart() Экспорт
    
    Соответствие = Новый Соответствие;
    
    Соответствие.Вставить("1000", Новый Цвет(190, 189, 127));
    Соответствие.Вставить("1001", Новый Цвет(194, 176, 120));
    Соответствие.Вставить("1002", Новый Цвет(198, 166, 100));
    Соответствие.Вставить("1003", Новый Цвет(229, 190, 001));
    Соответствие.Вставить("1004", Новый Цвет(205, 164, 052));
    Соответствие.Вставить("1005", Новый Цвет(169, 131, 007));
    Соответствие.Вставить("1006", Новый Цвет(228, 160, 016));
    Соответствие.Вставить("1007", Новый Цвет(220, 156, 000));
    Соответствие.Вставить("1011", Новый Цвет(138, 102, 066));
    Соответствие.Вставить("1012", Новый Цвет(199, 180, 070));
    Соответствие.Вставить("1013", Новый Цвет(234, 230, 202));
    Соответствие.Вставить("1014", Новый Цвет(225, 204, 079));
    Соответствие.Вставить("1015", Новый Цвет(230, 214, 144));
    Соответствие.Вставить("1016", Новый Цвет(237, 255, 033));
    Соответствие.Вставить("1017", Новый Цвет(245, 208, 051));
    Соответствие.Вставить("1018", Новый Цвет(248, 243, 053));
    Соответствие.Вставить("1019", Новый Цвет(158, 151, 100));
    Соответствие.Вставить("1020", Новый Цвет(153, 153, 080));
    Соответствие.Вставить("1021", Новый Цвет(243, 218, 011));
    Соответствие.Вставить("1023", Новый Цвет(250, 210, 001));
    Соответствие.Вставить("1024", Новый Цвет(174, 160, 075));
    Соответствие.Вставить("1026", Новый Цвет(255, 255, 000));
    Соответствие.Вставить("1027", Новый Цвет(157, 145, 001));
    Соответствие.Вставить("1028", Новый Цвет(244, 169, 000));
    Соответствие.Вставить("1032", Новый Цвет(214, 174, 001));
    Соответствие.Вставить("1033", Новый Цвет(243, 165, 005));
    Соответствие.Вставить("1034", Новый Цвет(239, 169, 074));
    Соответствие.Вставить("1035", Новый Цвет(106, 093, 077));
    Соответствие.Вставить("1036", Новый Цвет(112, 083, 053));
    Соответствие.Вставить("1037", Новый Цвет(243, 159, 024));
    Соответствие.Вставить("2000", Новый Цвет(237, 118, 014));
    Соответствие.Вставить("2001", Новый Цвет(201, 060, 032));
    Соответствие.Вставить("2002", Новый Цвет(203, 040, 033));
    Соответствие.Вставить("2003", Новый Цвет(255, 117, 020));
    Соответствие.Вставить("2004", Новый Цвет(244, 070, 017));
    Соответствие.Вставить("2005", Новый Цвет(255, 035, 001));
    Соответствие.Вставить("2007", Новый Цвет(255, 164, 032));
    Соответствие.Вставить("2008", Новый Цвет(247, 094, 037));
    Соответствие.Вставить("2009", Новый Цвет(245, 064, 033));
    Соответствие.Вставить("2010", Новый Цвет(216, 075, 032));
    Соответствие.Вставить("2011", Новый Цвет(236, 124, 038));
    Соответствие.Вставить("2012", Новый Цвет(235, 106, 014));
    Соответствие.Вставить("2013", Новый Цвет(195, 088, 049));
    Соответствие.Вставить("3000", Новый Цвет(175, 043, 030));
    Соответствие.Вставить("3001", Новый Цвет(165, 032, 025));
    Соответствие.Вставить("3002", Новый Цвет(162, 035, 029));
    Соответствие.Вставить("3003", Новый Цвет(155, 017, 030));
    Соответствие.Вставить("3004", Новый Цвет(117, 021, 030));
    Соответствие.Вставить("3005", Новый Цвет(094, 033, 041));
    Соответствие.Вставить("3007", Новый Цвет(065, 034, 039));
    Соответствие.Вставить("3009", Новый Цвет(100, 036, 036));
    Соответствие.Вставить("3011", Новый Цвет(120, 031, 025));
    Соответствие.Вставить("3012", Новый Цвет(193, 135, 107));
    Соответствие.Вставить("3013", Новый Цвет(161, 035, 018));
    Соответствие.Вставить("3014", Новый Цвет(211, 110, 112));
    Соответствие.Вставить("3015", Новый Цвет(234, 137, 154));
    Соответствие.Вставить("3016", Новый Цвет(179, 040, 033));
    Соответствие.Вставить("3017", Новый Цвет(230, 050, 068));
    Соответствие.Вставить("3018", Новый Цвет(213, 048, 050));
    Соответствие.Вставить("3020", Новый Цвет(204, 006, 005));
    Соответствие.Вставить("3022", Новый Цвет(217, 080, 048));
    Соответствие.Вставить("3024", Новый Цвет(248, 000, 000));
    Соответствие.Вставить("3026", Новый Цвет(254, 000, 000));
    Соответствие.Вставить("3027", Новый Цвет(197, 029, 052));
    Соответствие.Вставить("3028", Новый Цвет(203, 050, 052));
    Соответствие.Вставить("3031", Новый Цвет(179, 036, 040));
    Соответствие.Вставить("3032", Новый Цвет(114, 020, 034));
    Соответствие.Вставить("3033", Новый Цвет(180, 076, 067));
    Соответствие.Вставить("4001", Новый Цвет(222, 076, 138));
    Соответствие.Вставить("4002", Новый Цвет(146, 043, 062));
    Соответствие.Вставить("4003", Новый Цвет(222, 076, 138));
    Соответствие.Вставить("4004", Новый Цвет(110, 028, 052));
    Соответствие.Вставить("4005", Новый Цвет(108, 070, 117));
    Соответствие.Вставить("4006", Новый Цвет(160, 052, 114));
    Соответствие.Вставить("4007", Новый Цвет(074, 025, 044));
    Соответствие.Вставить("4008", Новый Цвет(144, 070, 132));
    Соответствие.Вставить("4009", Новый Цвет(164, 125, 144));
    Соответствие.Вставить("4010", Новый Цвет(215, 045, 109));
    Соответствие.Вставить("4011", Новый Цвет(134, 115, 161));
    Соответствие.Вставить("4012", Новый Цвет(108, 104, 129));
    Соответствие.Вставить("5000", Новый Цвет(042, 046, 075));
    Соответствие.Вставить("5001", Новый Цвет(031, 052, 056));
    Соответствие.Вставить("5002", Новый Цвет(032, 033, 079));
    Соответствие.Вставить("5003", Новый Цвет(029, 030, 051));
    Соответствие.Вставить("5004", Новый Цвет(032, 033, 079));
    Соответствие.Вставить("5005", Новый Цвет(030, 045, 110));
    Соответствие.Вставить("5007", Новый Цвет(062, 095, 138));
    Соответствие.Вставить("5008", Новый Цвет(038, 037, 045));
    Соответствие.Вставить("5009", Новый Цвет(002, 086, 105));
    Соответствие.Вставить("5010", Новый Цвет(014, 041, 075));
    Соответствие.Вставить("5011", Новый Цвет(035, 026, 036));
    Соответствие.Вставить("5012", Новый Цвет(059, 131, 189));
    Соответствие.Вставить("5013", Новый Цвет(037, 041, 074));
    Соответствие.Вставить("5014", Новый Цвет(096, 111, 140));
    Соответствие.Вставить("5015", Новый Цвет(034, 113, 179));
    Соответствие.Вставить("5017", Новый Цвет(006, 057, 113));
    Соответствие.Вставить("5018", Новый Цвет(063, 136, 143));
    Соответствие.Вставить("5019", Новый Цвет(027, 085, 131));
    Соответствие.Вставить("5020", Новый Цвет(029, 051, 074));
    Соответствие.Вставить("5021", Новый Цвет(037, 109, 123));
    Соответствие.Вставить("5022", Новый Цвет(037, 040, 080));
    Соответствие.Вставить("5023", Новый Цвет(073, 103, 141));
    Соответствие.Вставить("5024", Новый Цвет(093, 155, 155));
    Соответствие.Вставить("5025", Новый Цвет(042, 100, 120));
    Соответствие.Вставить("5026", Новый Цвет(016, 044, 084));
    Соответствие.Вставить("6000", Новый Цвет(049, 102, 080));
    Соответствие.Вставить("6001", Новый Цвет(040, 114, 051));
    Соответствие.Вставить("6002", Новый Цвет(045, 087, 044));
    Соответствие.Вставить("6003", Новый Цвет(066, 070, 050));
    Соответствие.Вставить("6004", Новый Цвет(031, 058, 061));
    Соответствие.Вставить("6005", Новый Цвет(047, 069, 056));
    Соответствие.Вставить("6006", Новый Цвет(062, 059, 050));
    Соответствие.Вставить("6007", Новый Цвет(052, 059, 041));
    Соответствие.Вставить("6008", Новый Цвет(057, 053, 042));
    Соответствие.Вставить("6009", Новый Цвет(049, 055, 043));
    Соответствие.Вставить("6010", Новый Цвет(053, 104, 045));
    Соответствие.Вставить("6011", Новый Цвет(088, 114, 070));
    Соответствие.Вставить("6012", Новый Цвет(052, 062, 064));
    Соответствие.Вставить("6013", Новый Цвет(108, 113, 086));
    Соответствие.Вставить("6014", Новый Цвет(071, 064, 046));
    Соответствие.Вставить("6015", Новый Цвет(059, 060, 054));
    Соответствие.Вставить("6016", Новый Цвет(030, 089, 069));
    Соответствие.Вставить("6017", Новый Цвет(076, 145, 065));
    Соответствие.Вставить("6018", Новый Цвет(087, 166, 057));
    Соответствие.Вставить("6019", Новый Цвет(189, 236, 182));
    Соответствие.Вставить("6020", Новый Цвет(046, 058, 035));
    Соответствие.Вставить("6021", Новый Цвет(137, 172, 118));
    Соответствие.Вставить("6022", Новый Цвет(037, 034, 027));
    Соответствие.Вставить("6024", Новый Цвет(048, 132, 070));
    Соответствие.Вставить("6025", Новый Цвет(061, 100, 045));
    Соответствие.Вставить("6026", Новый Цвет(001, 093, 082));
    Соответствие.Вставить("6027", Новый Цвет(132, 195, 190));
    Соответствие.Вставить("6028", Новый Цвет(044, 085, 069));
    Соответствие.Вставить("6029", Новый Цвет(032, 096, 061));
    Соответствие.Вставить("6032", Новый Цвет(049, 127, 067));
    Соответствие.Вставить("6033", Новый Цвет(073, 126, 118));
    Соответствие.Вставить("6034", Новый Цвет(127, 181, 181));
    Соответствие.Вставить("6035", Новый Цвет(028, 084, 045));
    Соответствие.Вставить("6036", Новый Цвет(022, 053, 055));
    Соответствие.Вставить("6037", Новый Цвет(000, 143, 057));
    Соответствие.Вставить("6038", Новый Цвет(000, 187, 045));
    Соответствие.Вставить("7000", Новый Цвет(120, 133, 139));
    Соответствие.Вставить("7001", Новый Цвет(138, 149, 151));
    Соответствие.Вставить("7002", Новый Цвет(126, 123, 082));
    Соответствие.Вставить("7003", Новый Цвет(108, 112, 089));
    Соответствие.Вставить("7004", Новый Цвет(150, 153, 146));
    Соответствие.Вставить("7005", Новый Цвет(100, 107, 099));
    Соответствие.Вставить("7006", Новый Цвет(109, 101, 082));
    Соответствие.Вставить("7008", Новый Цвет(106, 095, 049));
    Соответствие.Вставить("7009", Новый Цвет(077, 086, 069));
    Соответствие.Вставить("7010", Новый Цвет(076, 081, 074));
    Соответствие.Вставить("7011", Новый Цвет(067, 075, 077));
    Соответствие.Вставить("7012", Новый Цвет(078, 087, 084));
    Соответствие.Вставить("7013", Новый Цвет(070, 069, 049));
    Соответствие.Вставить("7015", Новый Цвет(067, 071, 080));
    Соответствие.Вставить("7016", Новый Цвет(041, 049, 051));
    Соответствие.Вставить("7021", Новый Цвет(035, 040, 043));
    Соответствие.Вставить("7022", Новый Цвет(051, 047, 044));
    Соответствие.Вставить("7023", Новый Цвет(104, 108, 094));
    Соответствие.Вставить("7024", Новый Цвет(071, 074, 081));
    Соответствие.Вставить("7026", Новый Цвет(047, 053, 059));
    Соответствие.Вставить("7030", Новый Цвет(139, 140, 122));
    Соответствие.Вставить("7031", Новый Цвет(071, 075, 078));
    Соответствие.Вставить("7032", Новый Цвет(184, 183, 153));
    Соответствие.Вставить("7033", Новый Цвет(125, 132, 113));
    Соответствие.Вставить("7034", Новый Цвет(143, 139, 102));
    Соответствие.Вставить("7035", Новый Цвет(215, 215, 215));
    Соответствие.Вставить("7036", Новый Цвет(127, 118, 121));
    Соответствие.Вставить("7037", Новый Цвет(125, 127, 120));
    Соответствие.Вставить("7038", Новый Цвет(195, 195, 195));
    Соответствие.Вставить("7039", Новый Цвет(108, 105, 096));
    Соответствие.Вставить("7040", Новый Цвет(157, 161, 170));
    Соответствие.Вставить("7042", Новый Цвет(141, 148, 141));
    Соответствие.Вставить("7043", Новый Цвет(078, 084, 082));
    Соответствие.Вставить("7044", Новый Цвет(202, 196, 176));
    Соответствие.Вставить("7045", Новый Цвет(144, 144, 144));
    Соответствие.Вставить("7046", Новый Цвет(130, 137, 143));
    Соответствие.Вставить("7047", Новый Цвет(208, 208, 208));
    Соответствие.Вставить("7048", Новый Цвет(137, 129, 118));
    Соответствие.Вставить("8000", Новый Цвет(130, 108, 052));
    Соответствие.Вставить("8001", Новый Цвет(149, 095, 032));
    Соответствие.Вставить("8002", Новый Цвет(108, 059, 042));
    Соответствие.Вставить("8003", Новый Цвет(115, 066, 034));
    Соответствие.Вставить("8004", Новый Цвет(142, 064, 042));
    Соответствие.Вставить("8007", Новый Цвет(089, 053, 031));
    Соответствие.Вставить("8008", Новый Цвет(111, 079, 040));
    Соответствие.Вставить("8011", Новый Цвет(091, 058, 041));
    Соответствие.Вставить("8012", Новый Цвет(089, 035, 033));
    Соответствие.Вставить("8014", Новый Цвет(056, 044, 030));
    Соответствие.Вставить("8015", Новый Цвет(099, 058, 052));
    Соответствие.Вставить("8016", Новый Цвет(076, 047, 039));
    Соответствие.Вставить("8017", Новый Цвет(069, 050, 046));
    Соответствие.Вставить("8019", Новый Цвет(064, 058, 058));
    Соответствие.Вставить("8022", Новый Цвет(033, 033, 033));
    Соответствие.Вставить("8023", Новый Цвет(166, 094, 046));
    Соответствие.Вставить("8024", Новый Цвет(121, 085, 061));
    Соответствие.Вставить("8025", Новый Цвет(117, 092, 072));
    Соответствие.Вставить("8028", Новый Цвет(078, 059, 049));
    Соответствие.Вставить("8029", Новый Цвет(118, 060, 040));
    Соответствие.Вставить("9001", Новый Цвет(250, 244, 227));
    Соответствие.Вставить("9002", Новый Цвет(231, 235, 218));
    Соответствие.Вставить("9003", Новый Цвет(244, 244, 244));
    Соответствие.Вставить("9004", Новый Цвет(040, 040, 040));
    Соответствие.Вставить("9005", Новый Цвет(010, 010, 013));
    Соответствие.Вставить("9006", Новый Цвет(165, 165, 165));
    Соответствие.Вставить("9007", Новый Цвет(143, 143, 143));
    Соответствие.Вставить("9010", Новый Цвет(255, 255, 255));
    Соответствие.Вставить("9011", Новый Цвет(028, 028, 028));
    Соответствие.Вставить("9016", Новый Цвет(246, 246, 246));
    Соответствие.Вставить("9017", Новый Цвет(030, 030, 030));
    Соответствие.Вставить("9018", Новый Цвет(215, 215, 215));
    Соответствие.Вставить("9022", Новый Цвет(156, 156, 156));
    Соответствие.Вставить("9023", Новый Цвет(130, 130, 130));    
    
    Возврат Соответствие;
    
КонецФункции

// Возвращает соответствие каталога RAL Design.
//
// Параметры:
//	Нет.
//
// Возвращаемое значение:
//	Соответствие
//      * Ключ - Строка- Цифровой цвет без префикса RAL. Пример "000 20 00" = "RAL 000 20 00".
//      * Значение - Цвет - цвет.
//
Функция КаталогRALDesign() Экспорт
    
    Соответствие = Новый Соответствие;
    
    Соответствие.Вставить("000 15 00", Новый Цвет(46, 48, 50));
    Соответствие.Вставить("000 20 00", Новый Цвет(55, 57, 59));
    Соответствие.Вставить("000 25 00", Новый Цвет(65, 67, 69));
    Соответствие.Вставить("000 30 00", Новый Цвет(74, 75, 76));
    Соответствие.Вставить("000 35 00", Новый Цвет(86, 87, 88));
    Соответствие.Вставить("000 40 00", Новый Цвет(96, 97, 98));
    Соответствие.Вставить("000 45 00", Новый Цвет(11, 11, 112));
    Соответствие.Вставить("000 50 00", Новый Цвет(12, 12, 122));
    Соответствие.Вставить("000 55 00", Новый Цвет(13, 13, 133));
    Соответствие.Вставить("000 60 00", Новый Цвет(14, 14, 147));
    Соответствие.Вставить("000 65 00", Новый Цвет(15, 16, 162));
    Соответствие.Вставить("000 70 00", Новый Цвет(17, 17, 175));
    Соответствие.Вставить("000 75 00", Новый Цвет(18, 18, 190));
    Соответствие.Вставить("000 80 00", Новый Цвет(20, 20, 204));
    Соответствие.Вставить("000 85 00", Новый Цвет(21, 21, 214));
    Соответствие.Вставить("000 90 00", Новый Цвет(22, 22, 226));
    Соответствие.Вставить("010 20 15", Новый Цвет(74, 46, 53));
    Соответствие.Вставить("010 20 20", Новый Цвет(81, 45, 53));
    Соответствие.Вставить("010 20 25", Новый Цвет(87, 42, 54));
    Соответствие.Вставить("010 30 15", Новый Цвет(99, 68, 75));
    Соответствие.Вставить("010 30 20", Новый Цвет(107, 64, 74));
    Соответствие.Вставить("010 30 25", Новый Цвет(115, 62, 74));
    Соответствие.Вставить("010 30 30", Новый Цвет(122, 57, 72));
    Соответствие.Вставить("010 30 35", Новый Цвет(124, 50, 68));
    Соответствие.Вставить("010 30 40", Новый Цвет(132, 42, 66));
    Соответствие.Вставить("010 30 44", Новый Цвет(140, 33, 67));
    Соответствие.Вставить("010 40 10", Новый Цвет(117, 95, 98));
    Соответствие.Вставить("010 40 15", Новый Цвет(125, 90, 96));
    Соответствие.Вставить("010 40 20", Новый Цвет(132, 85, 94));
    Соответствие.Вставить("010 40 25", Новый Цвет(141, 83, 95));
    Соответствие.Вставить("010 40 30", Новый Цвет(148, 78, 92));
    Соответствие.Вставить("010 40 35", Новый Цвет(152, 72, 89));
    Соответствие.Вставить("010 40 40", Новый Цвет(161, 67, 91));
    Соответствие.Вставить("010 40 45", Новый Цвет(168, 61, 89));
    Соответствие.Вставить("010 40 50", Новый Цвет(174, 53, 88));
    Соответствие.Вставить("010 40 53", Новый Цвет(178, 44, 84));
    Соответствие.Вставить("010 50 10", Новый Цвет(14, 11, 123));
    Соответствие.Вставить("010 50 15", Новый Цвет(14, 11, 121));
    Соответствие.Вставить("010 50 20", Новый Цвет(15, 10, 119));
    Соответствие.Вставить("010 50 25", Новый Цвет(16, 10, 118));
    Соответствие.Вставить("010 50 30", Новый Цвет(17, 10, 115));
    Соответствие.Вставить("010 50 35", Новый Цвет(180, 9, 114));
    Соответствие.Вставить("010 50 40", Новый Цвет(186, 9, 112));
    Соответствие.Вставить("010 50 45", Новый Цвет(193, 8, 111));
    Соответствие.Вставить("010 50 50", Новый Цвет(204, 7, 110));
    Соответствие.Вставить("010 60 10", Новый Цвет(16, 14, 145));
    Соответствие.Вставить("010 60 15", Новый Цвет(17, 13, 145));
    Соответствие.Вставить("010 60 20", Новый Цвет(18, 13, 144));
    Соответствие.Вставить("010 60 25", Новый Цвет(19, 12, 143));
    Соответствие.Вставить("010 60 30", Новый Цвет(20, 12, 141));
    Соответствие.Вставить("010 60 35", Новый Цвет(21, 12, 140));
    Соответствие.Вставить("010 60 40", Новый Цвет(22, 11, 139));
    Соответствие.Вставить("010 60 45", Новый Цвет(23, 10, 137));
    Соответствие.Вставить("010 70 10", Новый Цвет(19, 16, 174));
    Соответствие.Вставить("010 70 15", Новый Цвет(20, 16, 170));
    Соответствие.Вставить("010 70 20", Новый Цвет(21, 16, 170));
    Соответствие.Вставить("010 70 25", Новый Цвет(22, 15, 168));
    Соответствие.Вставить("010 70 30", Новый Цвет(23, 15, 167));
    Соответствие.Вставить("010 70 35", Новый Цвет(24, 14, 166));
    Соответствие.Вставить("010 80 10", Новый Цвет(22, 19, 199));
    Соответствие.Вставить("010 80 15", Новый Цвет(23, 19, 197));
    Соответствие.Вставить("010 80 20", Новый Цвет(24, 18, 195));
    Соответствие.Вставить("010 90 05", Новый Цвет(24, 22, 227));
    Соответствие.Вставить("010 90 10", Новый Цвет(24, 22, 220));
    Соответствие.Вставить("010 92 05", Новый Цвет(24, 23, 234));
    Соответствие.Вставить("020 20 05", Новый Цвет(61, 53, 55));
    Соответствие.Вставить("020 20 10", Новый Цвет(71, 52, 54));
    Соответствие.Вставить("020 20 20", Новый Цвет(83, 48, 52));
    Соответствие.Вставить("020 20 29", Новый Цвет(92, 37, 45));
    Соответствие.Вставить("020 30 05", Новый Цвет(83, 73, 75));
    Соответствие.Вставить("020 30 10", Новый Цвет(92, 70, 72));
    Соответствие.Вставить("020 30 20", Новый Цвет(105, 63, 67));
    Соответствие.Вставить("020 30 30", Новый Цвет(120, 58, 65));
    Соответствие.Вставить("020 30 40", Новый Цвет(133, 46, 61));
    Соответствие.Вставить("020 30 48", Новый Цвет(138, 32, 54));
    Соответствие.Вставить("020 40 05", Новый Цвет(107, 97, 97));
    Соответствие.Вставить("020 40 10", Новый Цвет(114, 94, 95));
    Соответствие.Вставить("020 40 20", Новый Цвет(131, 87, 89));
    Соответствие.Вставить("020 40 30", Новый Цвет(145, 78, 84));
    Соответствие.Вставить("020 40 40", Новый Цвет(156, 68, 78));
    Соответствие.Вставить("020 40 50", Новый Цвет(171, 51, 72));
    Соответствие.Вставить("020 50 05", Новый Цвет(13, 12, 120));
    Соответствие.Вставить("020 50 10", Новый Цвет(14, 11, 116));
    Соответствие.Вставить("020 50 20", Новый Цвет(15, 10, 112));
    Соответствие.Вставить("020 50 30", Новый Цвет(17, 10, 107));
    Соответствие.Вставить("020 50 40", Новый Цвет(184, 9, 101));
    Соответствие.Вставить("020 50 50", Новый Цвет(198, 79, 95));
    Соответствие.Вставить("020 50 58", Новый Цвет(216, 67, 90));
    Соответствие.Вставить("020 60 05", Новый Цвет(15, 14, 144));
    Соответствие.Вставить("020 60 10", Новый Цвет(16, 14, 144));
    Соответствие.Вставить("020 60 20", Новый Цвет(18, 13, 137));
    Соответствие.Вставить("020 60 30", Новый Цвет(20, 12, 132));
    Соответствие.Вставить("020 60 40", Новый Цвет(21, 11, 126));
    Соответствие.Вставить("020 70 05", Новый Цвет(18, 17, 172));
    Соответствие.Вставить("020 70 10", Новый Цвет(19, 16, 169));
    Соответствие.Вставить("020 70 20", Новый Цвет(21, 16, 165));
    Соответствие.Вставить("020 70 30", Новый Цвет(23, 15, 160));
    Соответствие.Вставить("020 80 05", Новый Цвет(21, 20, 199));
    Соответствие.Вставить("020 80 10", Новый Цвет(22, 19, 195));
    Соответствие.Вставить("020 80 20", Новый Цвет(24, 18, 192));
    Соответствие.Вставить("020 90 05", Новый Цвет(24, 22, 224));
    Соответствие.Вставить("020 90 10", Новый Цвет(24, 22, 221));
    Соответствие.Вставить("030 30 20", Новый Цвет(104, 67, 66));
    Соответствие.Вставить("030 30 30", Новый Цвет(116, 60, 58));
    Соответствие.Вставить("030 30 40", Новый Цвет(127, 52, 54));
    Соответствие.Вставить("030 30 45", Новый Цвет(133, 42, 48));
    Соответствие.Вставить("030 40 10", Новый Цвет(113, 94, 93));
    Соответствие.Вставить("030 40 20", Новый Цвет(131, 90, 88));
    Соответствие.Вставить("030 40 30", Новый Цвет(144, 82, 79));
    Соответствие.Вставить("030 40 40", Новый Цвет(158, 72, 71));
    Соответствие.Вставить("030 40 50", Новый Цвет(172, 63, 68));
    Соответствие.Вставить("030 40 60", Новый Цвет(181, 49, 61));
    Соответствие.Вставить("030 50 10", Новый Цвет(14, 11, 115));
    Соответствие.Вставить("030 50 20", Новый Цвет(15, 11, 108));
    Соответствие.Вставить("030 50 30", Новый Цвет(17, 103, 98));
    Соответствие.Вставить("030 50 40", Новый Цвет(186, 97, 94));
    Соответствие.Вставить("030 50 50", Новый Цвет(198, 86, 85));
    Соответствие.Вставить("030 50 60", Новый Цвет(213, 73, 76));
    Соответствие.Вставить("030 60 10", Новый Цвет(16, 14, 141));
    Соответствие.Вставить("030 60 20", Новый Цвет(18, 13, 131));
    Соответствие.Вставить("030 60 30", Новый Цвет(20, 13, 125));
    Соответствие.Вставить("030 60 40", Новый Цвет(21, 12, 117));
    Соответствие.Вставить("030 60 50", Новый Цвет(23, 11, 108));
    Соответствие.Вставить("030 70 10", Новый Цвет(19, 17, 167));
    Соответствие.Вставить("030 70 20", Новый Цвет(21, 16, 155));
    Соответствие.Вставить("030 70 30", Новый Цвет(23, 15, 147));
    Соответствие.Вставить("030 70 40", Новый Цвет(24, 14, 141));
    Соответствие.Вставить("030 80 10", Новый Цвет(22, 19, 191));
    Соответствие.Вставить("030 80 20", Новый Цвет(24, 18, 182));
    Соответствие.Вставить("030 90 05", Новый Цвет(24, 22, 224));
    Соответствие.Вставить("030 90 10", Новый Цвет(24, 22, 219));
    Соответствие.Вставить("040 20 19", Новый Цвет(79, 50, 44));
    Соответствие.Вставить("040 30 05", Новый Цвет(82, 74, 72));
    Соответствие.Вставить("040 30 10", Новый Цвет(89, 72, 67));
    Соответствие.Вставить("040 30 20", Новый Цвет(100, 67, 58));
    Соответствие.Вставить("040 30 30", Новый Цвет(115, 63, 54));
    Соответствие.Вставить("040 30 40", Новый Цвет(125, 58, 49));
    Соответствие.Вставить("040 40 05", Новый Цвет(108, 98, 97));
    Соответствие.Вставить("040 40 10", Новый Цвет(113, 95, 90));
    Соответствие.Вставить("040 40 20", Новый Цвет(125, 90, 80));
    Соответствие.Вставить("040 40 30", Новый Цвет(139, 85, 71));
    Соответствие.Вставить("040 40 40", Новый Цвет(151, 77, 59));
    Соответствие.Вставить("040 40 50", Новый Цвет(161, 70, 51));
    Соответствие.Вставить("040 40 60", Новый Цвет(171, 60, 43));
    Соответствие.Вставить("040 40 67", Новый Цвет(180, 52, 38));
    Соответствие.Вставить("040 50 05", Новый Цвет(12, 12, 118));
    Соответствие.Вставить("040 50 10", Новый Цвет(13, 11, 111));
    Соответствие.Вставить("040 50 20", Новый Цвет(15, 11, 102));
    Соответствие.Вставить("040 50 30", Новый Цвет(16, 109, 92));
    Соответствие.Вставить("040 50 40", Новый Цвет(18, 101, 80));
    Соответствие.Вставить("040 50 50", Новый Цвет(195, 95, 71));
    Соответствие.Вставить("040 50 60", Новый Цвет(206, 86, 61));
    Соответствие.Вставить("040 50 70", Новый Цвет(218, 76, 55));
    Соответствие.Вставить("040 60 05", Новый Цвет(15, 14, 144));
    Соответствие.Вставить("040 60 10", Новый Цвет(16, 14, 136));
    Соответствие.Вставить("040 60 20", Новый Цвет(17, 13, 126));
    Соответствие.Вставить("040 60 30", Новый Цвет(19, 13, 114));
    Соответствие.Вставить("040 60 40", Новый Цвет(20, 12, 103));
    Соответствие.Вставить("040 60 50", Новый Цвет(22, 120, 93));
    Соответствие.Вставить("040 60 60", Новый Цвет(23, 113, 82));
    Соответствие.Вставить("040 70 05", Новый Цвет(18, 17, 169));
    Соответствие.Вставить("040 70 10", Новый Цвет(19, 16, 163));
    Соответствие.Вставить("040 70 20", Новый Цвет(21, 16, 151));
    Соответствие.Вставить("040 70 30", Новый Цвет(22, 15, 139));
    Соответствие.Вставить("040 70 40", Новый Цвет(23, 15, 129));
    Соответствие.Вставить("040 70 50", Новый Цвет(25, 14, 115));
    Соответствие.Вставить("040 80 05", Новый Цвет(21, 20, 196));
    Соответствие.Вставить("040 80 10", Новый Цвет(22, 20, 190));
    Соответствие.Вставить("040 80 20", Новый Цвет(24, 19, 179));
    Соответствие.Вставить("040 80 30", Новый Цвет(24, 18, 166));
    Соответствие.Вставить("040 90 05", Новый Цвет(23, 22, 221));
    Соответствие.Вставить("040 90 10", Новый Цвет(24, 22, 216));
    Соответствие.Вставить("050 20 10", Новый Цвет(68, 58, 54));
    Соответствие.Вставить("050 20 16", Новый Цвет(72, 51, 42));
    Соответствие.Вставить("050 30 20", Новый Цвет(98, 70, 55));
    Соответствие.Вставить("050 30 30", Новый Цвет(111, 67, 50));
    Соответствие.Вставить("050 30 36", Новый Цвет(116, 65, 43));
    Соответствие.Вставить("050 40 10", Новый Цвет(109, 95, 86));
    Соответствие.Вставить("050 40 20", Новый Цвет(122, 92, 75));
    Соответствие.Вставить("050 40 30", Новый Цвет(131, 86, 62));
    Соответствие.Вставить("050 40 40", Новый Цвет(143, 82, 49));
    Соответствие.Вставить("050 40 50", Новый Цвет(153, 76, 43));
    Соответствие.Вставить("050 50 10", Новый Цвет(13, 12, 111));
    Соответствие.Вставить("050 50 20", Новый Цвет(14, 117, 97));
    Соответствие.Вставить("050 50 30", Новый Цвет(16, 113, 84));
    Соответствие.Вставить("050 50 40", Новый Цвет(17, 107, 73));
    Соответствие.Вставить("050 50 50", Новый Цвет(18, 103, 61));
    Соответствие.Вставить("050 50 60", Новый Цвет(192, 97, 49));
    Соответствие.Вставить("050 50 70", Новый Цвет(204, 94, 40));
    Соответствие.Вставить("050 50 78", Новый Цвет(212, 96, 37));
    Соответствие.Вставить("050 60 10", Новый Цвет(16, 14, 132));
    Соответствие.Вставить("050 60 20", Новый Цвет(17, 13, 119));
    Соответствие.Вставить("050 60 30", Новый Цвет(19, 13, 107));
    Соответствие.Вставить("050 60 40", Новый Цвет(20, 133, 96));
    Соответствие.Вставить("050 60 50", Новый Цвет(21, 129, 81));
    Соответствие.Вставить("050 60 60", Новый Цвет(22, 123, 66));
    Соответствие.Вставить("050 60 70", Новый Цвет(23, 116, 54));
    Соответствие.Вставить("050 60 80", Новый Цвет(24, 106, 35));
    Соответствие.Вставить("050 70 10", Новый Цвет(18, 17, 162));
    Соответствие.Вставить("050 70 20", Новый Цвет(20, 16, 148));
    Соответствие.Вставить("050 70 30", Новый Цвет(22, 16, 132));
    Соответствие.Вставить("050 70 40", Новый Цвет(23, 15, 120));
    Соответствие.Вставить("050 70 50", Новый Цвет(24, 15, 107));
    Соответствие.Вставить("050 70 60", Новый Цвет(25, 147, 90));
    Соответствие.Вставить("050 80 10", Новый Цвет(21, 20, 188));
    Соответствие.Вставить("050 80 20", Новый Цвет(23, 19, 170));
    Соответствие.Вставить("050 80 30", Новый Цвет(24, 18, 157));
    Соответствие.Вставить("050 90 05", Новый Цвет(24, 22, 220));
    Соответствие.Вставить("050 90 10", Новый Цвет(24, 22, 213));
    Соответствие.Вставить("050 92 05", Новый Цвет(23, 23, 226));
    Соответствие.Вставить("060 20 05", Новый Цвет(59, 56, 53));
    Соответствие.Вставить("060 30 05", Новый Цвет(80, 75, 71));
    Соответствие.Вставить("060 30 10", Новый Цвет(85, 73, 64));
    Соответствие.Вставить("060 30 20", Новый Цвет(93, 74, 56));
    Соответствие.Вставить("060 30 27", Новый Цвет(100, 70, 43));
    Соответствие.Вставить("060 40 05", Новый Цвет(104, 98, 92));
    Соответствие.Вставить("060 40 10", Новый Цвет(109, 96, 84));
    Соответствие.Вставить("060 40 20", Новый Цвет(121, 96, 74));
    Соответствие.Вставить("060 40 30", Новый Цвет(128, 93, 59));
    Соответствие.Вставить("060 40 40", Новый Цвет(138, 91, 49));
    Соответствие.Вставить("060 50 05", Новый Цвет(12, 12, 116));
    Соответствие.Вставить("060 50 10", Новый Цвет(13, 12, 109));
    Соответствие.Вставить("060 50 20", Новый Цвет(14, 119, 93));
    Соответствие.Вставить("060 50 30", Новый Цвет(15, 118, 81));
    Соответствие.Вставить("060 50 40", Новый Цвет(16, 114, 67));
    Соответствие.Вставить("060 50 50", Новый Цвет(17, 110, 55));
    Соответствие.Вставить("060 50 60", Новый Цвет(18, 103, 33));
    Соответствие.Вставить("060 50 70", Новый Цвет(18, 102, 24));
    Соответствие.Вставить("060 60 05", Новый Цвет(15, 14, 141));
    Соответствие.Вставить("060 60 10", Новый Цвет(16, 14, 132));
    Соответствие.Вставить("060 60 20", Новый Цвет(17, 14, 117));
    Соответствие.Вставить("060 60 30", Новый Цвет(18, 14, 104));
    Соответствие.Вставить("060 60 40", Новый Цвет(19, 140, 87));
    Соответствие.Вставить("060 60 50", Новый Цвет(20, 134, 71));
    Соответствие.Вставить("060 60 60", Новый Цвет(21, 132, 53));
    Соответствие.Вставить("060 60 70", Новый Цвет(22, 127, 36));
    Соответствие.Вставить("060 60 80", Новый Цвет(23, 123, 25));
    Соответствие.Вставить("060 70 05", Новый Цвет(18, 17, 167));
    Соответствие.Вставить("060 70 10", Новый Цвет(18, 17, 160));
    Соответствие.Вставить("060 70 20", Новый Цвет(19, 17, 144));
    Соответствие.Вставить("060 70 30", Новый Цвет(21, 16, 128));
    Соответствие.Вставить("060 70 40", Новый Цвет(22, 16, 112));
    Соответствие.Вставить("060 70 50", Новый Цвет(23, 162, 97));
    Соответствие.Вставить("060 70 60", Новый Цвет(24, 157, 78));
    Соответствие.Вставить("060 70 70", Новый Цвет(25, 154, 57));
    Соответствие.Вставить("060 80 10", Новый Цвет(21, 20, 184));
    Соответствие.Вставить("060 80 20", Новый Цвет(22, 20, 170));
    Соответствие.Вставить("060 80 30", Новый Цвет(24, 19, 150));
    Соответствие.Вставить("060 80 40", Новый Цвет(24, 19, 131));
    Соответствие.Вставить("060 90 05", Новый Цвет(23, 23, 218));
    Соответствие.Вставить("060 90 10", Новый Цвет(24, 22, 211));
    Соответствие.Вставить("060 90 15", Новый Цвет(24, 22, 202));
    Соответствие.Вставить("070 30 20", Новый Цвет(90, 76, 55));
    Соответствие.Вставить("070 40 10", Новый Цвет(104, 98, 85));
    Соответствие.Вставить("070 40 20", Новый Цвет(113, 97, 68));
    Соответствие.Вставить("070 40 30", Новый Цвет(122, 95, 55));
    Соответствие.Вставить("070 40 40", Новый Цвет(127, 94, 40));
    Соответствие.Вставить("070 50 10", Новый Цвет(13, 12, 107));
    Соответствие.Вставить("070 50 20", Новый Цвет(13, 120, 91));
    Соответствие.Вставить("070 50 30", Новый Цвет(14, 118, 73));
    Соответствие.Вставить("070 50 40", Новый Цвет(15, 118, 57));
    Соответствие.Вставить("070 50 50", Новый Цвет(15, 118, 51));
    Соответствие.Вставить("070 50 55", Новый Цвет(16, 118, 43));
    Соответствие.Вставить("070 60 10", Новый Цвет(15, 14, 130));
    Соответствие.Вставить("070 60 20", Новый Цвет(16, 14, 116));
    Соответствие.Вставить("070 60 30", Новый Цвет(17, 143, 97));
    Соответствие.Вставить("070 60 40", Новый Цвет(17, 142, 78));
    Соответствие.Вставить("070 60 50", Новый Цвет(18, 143, 63));
    Соответствие.Вставить("070 60 60", Новый Цвет(19, 141, 46));
    Соответствие.Вставить("070 60 70", Новый Цвет(20, 138, 33));
    Соответствие.Вставить("070 60 75", Новый Цвет(20, 139, 19));
    Соответствие.Вставить("070 70 10", Новый Цвет(18, 17, 157));
    Соответствие.Вставить("070 70 20", Новый Цвет(19, 17, 138));
    Соответствие.Вставить("070 70 30", Новый Цвет(20, 17, 121));
    Соответствие.Вставить("070 70 40", Новый Цвет(21, 17, 102));
    Соответствие.Вставить("070 70 50", Новый Цвет(21, 169, 87));
    Соответствие.Вставить("070 70 60", Новый Цвет(22, 165, 65));
    Соответствие.Вставить("070 70 70", Новый Цвет(23, 161, 43));
    Соответствие.Вставить("070 70 80", Новый Цвет(23, 158 , 8));
    Соответствие.Вставить("070 80 10", Новый Цвет(21, 20, 182));
    Соответствие.Вставить("070 80 20", Новый Цвет(22, 20, 163));
    Соответствие.Вставить("070 80 30", Новый Цвет(23, 20, 148));
    Соответствие.Вставить("070 80 40", Новый Цвет(24, 20, 133));
    Соответствие.Вставить("070 80 50", Новый Цвет(24, 19, 111));
    Соответствие.Вставить("070 80 60", Новый Цвет(25, 197, 90));
    Соответствие.Вставить("070 90 05", Новый Цвет(23, 23, 222));
    Соответствие.Вставить("070 90 10", Новый Цвет(23, 23, 211));
    Соответствие.Вставить("070 90 20", Новый Цвет(24, 23, 193));
    Соответствие.Вставить("075 40 20", Новый Цвет(107, 96, 67));
    Соответствие.Вставить("075 40 30", Новый Цвет(113, 94, 52));
    Соответствие.Вставить("075 40 38", Новый Цвет(117, 94, 39));
    Соответствие.Вставить("075 50 20", Новый Цвет(13, 121, 90));
    Соответствие.Вставить("075 50 30", Новый Цвет(14, 122, 74));
    Соответствие.Вставить("075 50 40", Новый Цвет(14, 119, 58));
    Соответствие.Вставить("075 50 50", Новый Цвет(15, 118, 39));
    Соответствие.Вставить("075 50 58", Новый Цвет(15, 115, 14));
    Соответствие.Вставить("075 60 10", Новый Цвет(15, 14, 131));
    Соответствие.Вставить("075 60 20", Новый Цвет(16, 14, 112));
    Соответствие.Вставить("075 60 30", Новый Цвет(17, 147, 98));
    Соответствие.Вставить("075 60 40", Новый Цвет(17, 148, 83));
    Соответствие.Вставить("075 60 50", Новый Цвет(18, 145, 61));
    Соответствие.Вставить("075 60 60", Новый Цвет(18, 142, 37));
    Соответствие.Вставить("075 60 70", Новый Цвет(19, 143 , 2));
    Соответствие.Вставить("075 70 10", Новый Цвет(17, 17, 157));
    Соответствие.Вставить("075 70 20", Новый Цвет(18, 17, 136));
    Соответствие.Вставить("075 70 30", Новый Цвет(19, 17, 120));
    Соответствие.Вставить("075 70 40", Новый Цвет(20, 17, 101));
    Соответствие.Вставить("075 70 50", Новый Цвет(21, 171, 84));
    Соответствие.Вставить("075 70 60", Новый Цвет(21, 170, 63));
    Соответствие.Вставить("075 70 70", Новый Цвет(22, 170, 39));
    Соответствие.Вставить("075 70 80", Новый Цвет(22, 168 , 0));
    Соответствие.Вставить("075 80 10", Новый Цвет(21, 20, 183));
    Соответствие.Вставить("075 80 20", Новый Цвет(21, 20, 163));
    Соответствие.Вставить("075 80 30", Новый Цвет(22, 20, 145));
    Соответствие.Вставить("075 80 40", Новый Цвет(23, 19, 129));
    Соответствие.Вставить("075 80 50", Новый Цвет(24, 19, 111));
    Соответствие.Вставить("075 80 60", Новый Цвет(24, 197, 92));
    Соответствие.Вставить("075 90 10", Новый Цвет(24, 23, 210));
    Соответствие.Вставить("075 90 20", Новый Цвет(24, 23, 190));
    Соответствие.Вставить("075 92 05", Новый Цвет(23, 23, 223));
    Соответствие.Вставить("080 20 10", Новый Цвет(59, 56, 45));
    Соответствие.Вставить("080 30 05", Новый Цвет(77, 75, 69));
    Соответствие.Вставить("080 30 10", Новый Цвет(77, 74, 60));
    Соответствие.Вставить("080 30 20", Новый Цвет(84, 76, 48));
    Соответствие.Вставить("080 30 26", Новый Цвет(87, 74, 40));
    Соответствие.Вставить("080 40 05", Новый Цвет(102, 98, 91));
    Соответствие.Вставить("080 40 10", Новый Цвет(10, 101, 86));
    Соответствие.Вставить("080 40 20", Новый Цвет(107, 97, 66));
    Соответствие.Вставить("080 40 30", Новый Цвет(113, 98, 54));
    Соответствие.Вставить("080 40 40", Новый Цвет(118, 97, 32));
    Соответствие.Вставить("080 50 05", Новый Цвет(12, 12, 114));
    Соответствие.Вставить("080 50 10", Новый Цвет(12, 12, 107));
    Соответствие.Вставить("080 50 20", Новый Цвет(13, 125, 92));
    Соответствие.Вставить("080 50 30", Новый Цвет(13, 125, 75));
    Соответствие.Вставить("080 50 40", Новый Цвет(14, 122, 58));
    Соответствие.Вставить("080 50 50", Новый Цвет(14, 124, 43));
    Соответствие.Вставить("080 60 05", Новый Цвет(15, 14, 140));
    Соответствие.Вставить("080 60 10", Новый Цвет(15, 14, 130));
    Соответствие.Вставить("080 60 20", Новый Цвет(15, 14, 111));
    Соответствие.Вставить("080 60 30", Новый Цвет(16, 149, 94));
    Соответствие.Вставить("080 60 40", Новый Цвет(16, 148, 82));
    Соответствие.Вставить("080 60 50", Новый Цвет(17, 150, 61));
    Соответствие.Вставить("080 60 60", Новый Цвет(17, 148, 33));
    Соответствие.Вставить("080 60 70", Новый Цвет(18, 147 , 4));
    Соответствие.Вставить("080 70 10", Новый Цвет(18, 17, 157));
    Соответствие.Вставить("080 70 20", Новый Цвет(18, 17, 137));
    Соответствие.Вставить("080 70 30", Новый Цвет(19, 17, 121));
    Соответствие.Вставить("080 70 40", Новый Цвет(20, 17, 103));
    Соответствие.Вставить("080 70 50", Новый Цвет(20, 175, 82));
    Соответствие.Вставить("080 70 60", Новый Цвет(21, 177, 61));
    Соответствие.Вставить("080 70 70", Новый Цвет(21, 176, 41));
    Соответствие.Вставить("080 70 80", Новый Цвет(21, 173 , 0));
    Соответствие.Вставить("080 70 88", Новый Цвет(21, 172 , 0));
    Соответствие.Вставить("080 80 05", Новый Цвет(20, 20, 192));
    Соответствие.Вставить("080 80 10", Новый Цвет(21, 20, 183));
    Соответствие.Вставить("080 80 20", Новый Цвет(21, 20, 162));
    Соответствие.Вставить("080 80 30", Новый Цвет(21, 20, 143));
    Соответствие.Вставить("080 80 40", Новый Цвет(22, 20, 127));
    Соответствие.Вставить("080 80 50", Новый Цвет(23, 20, 106));
    Соответствие.Вставить("080 80 60", Новый Цвет(23, 202, 82));
    Соответствие.Вставить("080 80 70", Новый Цвет(24, 201, 60));
    Соответствие.Вставить("080 80 80", Новый Цвет(24, 200, 33));
    Соответствие.Вставить("080 80 90", Новый Цвет(25, 202 , 0));
    Соответствие.Вставить("080 90 05", Новый Цвет(23, 23, 220));
    Соответствие.Вставить("080 90 10", Новый Цвет(23, 22, 207));
    Соответствие.Вставить("080 90 20", Новый Цвет(24, 22, 188));
    Соответствие.Вставить("085 40 20", Новый Цвет(103, 97, 64));
    Соответствие.Вставить("085 40 30", Новый Цвет(10, 101, 56));
    Соответствие.Вставить("085 50 20", Новый Цвет(13, 123, 88));
    Соответствие.Вставить("085 50 30", Новый Цвет(13, 123, 70));
    Соответствие.Вставить("085 50 40", Новый Цвет(13, 124, 55));
    Соответствие.Вставить("085 50 50", Новый Цвет(13, 125, 35));
    Соответствие.Вставить("085 60 10", Новый Цвет(15, 14, 131));
    Соответствие.Вставить("085 60 20", Новый Цвет(15, 14, 113));
    Соответствие.Вставить("085 60 30", Новый Цвет(16, 151, 96));
    Соответствие.Вставить("085 60 40", Новый Цвет(16, 150, 78));
    Соответствие.Вставить("085 60 50", Новый Цвет(16, 151, 58));
    Соответствие.Вставить("085 60 60", Новый Цвет(17, 152, 32));
    Соответствие.Вставить("085 70 10", Новый Цвет(17, 17, 153));
    Соответствие.Вставить("085 70 20", Новый Цвет(18, 17, 138));
    Соответствие.Вставить("085 70 30", Новый Цвет(18, 17, 116));
    Соответствие.Вставить("085 70 40", Новый Цвет(18, 17, 100));
    Соответствие.Вставить("085 70 50", Новый Цвет(19, 177, 78));
    Соответствие.Вставить("085 70 60", Новый Цвет(19, 176, 55));
    Соответствие.Вставить("085 70 70", Новый Цвет(20, 175, 34));
    Соответствие.Вставить("085 70 75", Новый Цвет(20, 177, 11));
    Соответствие.Вставить("085 80 10", Новый Цвет(20, 20, 179));
    Соответствие.Вставить("085 80 20", Новый Цвет(21, 20, 164));
    Соответствие.Вставить("085 80 30", Новый Цвет(21, 20, 142));
    Соответствие.Вставить("085 80 40", Новый Цвет(21, 20, 124));
    Соответствие.Вставить("085 80 50", Новый Цвет(22, 20, 104));
    Соответствие.Вставить("085 80 60", Новый Цвет(22, 204, 82));
    Соответствие.Вставить("085 80 70", Новый Цвет(23, 203, 57));
    Соответствие.Вставить("085 80 80", Новый Цвет(23, 202, 17));
    Соответствие.Вставить("085 80 85", Новый Цвет(23, 202 , 5));
    Соответствие.Вставить("085 90 10", Новый Цвет(23, 23, 211));
    Соответствие.Вставить("085 90 20", Новый Цвет(24, 23, 189));
    Соответствие.Вставить("085 90 30", Новый Цвет(24, 23, 168));
    Соответствие.Вставить("090 30 20", Новый Цвет(81, 77, 46));
    Соответствие.Вставить("090 40 10", Новый Цвет(10, 101, 86));
    Соответствие.Вставить("090 40 20", Новый Цвет(103, 99, 67));
    Соответствие.Вставить("090 40 30", Новый Цвет(10, 102, 55));
    Соответствие.Вставить("090 50 10", Новый Цвет(12, 12, 108));
    Соответствие.Вставить("090 50 20", Новый Цвет(12, 124, 91));
    Соответствие.Вставить("090 50 30", Новый Цвет(13, 127, 72));
    Соответствие.Вставить("090 50 40", Новый Цвет(13, 126, 56));
    Соответствие.Вставить("090 60 10", Новый Цвет(14, 14, 132));
    Соответствие.Вставить("090 60 20", Новый Цвет(15, 14, 114));
    Соответствие.Вставить("090 60 30", Новый Цвет(15, 15, 100));
    Соответствие.Вставить("090 60 40", Новый Цвет(15, 151, 79));
    Соответствие.Вставить("090 60 50", Новый Цвет(16, 153, 59));
    Соответствие.Вставить("090 60 60", Новый Цвет(16, 155, 37));
    Соответствие.Вставить("090 70 10", Новый Цвет(17, 17, 156));
    Соответствие.Вставить("090 70 20", Новый Цвет(18, 17, 136));
    Соответствие.Вставить("090 70 30", Новый Цвет(18, 17, 123));
    Соответствие.Вставить("090 70 40", Новый Цвет(18, 178, 99));
    Соответствие.Вставить("090 70 50", Новый Цвет(19, 180, 83));
    Соответствие.Вставить("090 70 60", Новый Цвет(19, 181, 60));
    Соответствие.Вставить("090 70 70", Новый Цвет(19, 182, 29));
    Соответствие.Вставить("090 70 80", Новый Цвет(19, 181 , 3));
    Соответствие.Вставить("090 80 10", Новый Цвет(20, 20, 181));
    Соответствие.Вставить("090 80 20", Новый Цвет(20, 20, 163));
    Соответствие.Вставить("090 80 30", Новый Цвет(21, 20, 147));
    Соответствие.Вставить("090 80 40", Новый Цвет(21, 20, 132));
    Соответствие.Вставить("090 80 50", Новый Цвет(22, 20, 104));
    Соответствие.Вставить("090 80 60", Новый Цвет(22, 207, 79));
    Соответствие.Вставить("090 80 70", Новый Цвет(22, 210, 63));
    Соответствие.Вставить("090 80 80", Новый Цвет(22, 209, 19));
    Соответствие.Вставить("090 80 90", Новый Цвет(22, 212 , 0));
    Соответствие.Вставить("090 90 05", Новый Цвет(23, 23, 221));
    Соответствие.Вставить("090 90 10", Новый Цвет(23, 23, 211));
    Соответствие.Вставить("090 90 20", Новый Цвет(23, 23, 190));
    Соответствие.Вставить("090 90 30", Новый Цвет(24, 23, 172));
    Соответствие.Вставить("095 40 20", Новый Цвет(102, 99, 68));
    Соответствие.Вставить("095 40 30", Новый Цвет(10, 102, 53));
    Соответствие.Вставить("095 50 20", Новый Цвет(12, 123, 91));
    Соответствие.Вставить("095 50 30", Новый Цвет(12, 124, 73));
    Соответствие.Вставить("095 50 40", Новый Цвет(13, 128, 57));
    Соответствие.Вставить("095 50 50", Новый Цвет(12, 131, 33));
    Соответствие.Вставить("095 60 10", Новый Цвет(15, 14, 133));
    Соответствие.Вставить("095 60 20", Новый Цвет(15, 15, 115));
    Соответствие.Вставить("095 60 30", Новый Цвет(15, 150, 93));
    Соответствие.Вставить("095 60 40", Новый Цвет(15, 153, 77));
    Соответствие.Вставить("095 60 50", Новый Цвет(15, 153, 57));
    Соответствие.Вставить("095 60 60", Новый Цвет(15, 155, 32));
    Соответствие.Вставить("095 60 70", Новый Цвет(14, 158 , 3));
    Соответствие.Вставить("095 70 10", Новый Цвет(17, 17, 156));
    Соответствие.Вставить("095 70 20", Новый Цвет(17, 17, 140));
    Соответствие.Вставить("095 70 30", Новый Цвет(18, 17, 122));
    Соответствие.Вставить("095 70 40", Новый Цвет(17, 17, 100));
    Соответствие.Вставить("095 70 50", Новый Цвет(18, 178, 84));
    Соответствие.Вставить("095 70 60", Новый Цвет(18, 178, 65));
    Соответствие.Вставить("095 70 70", Новый Цвет(17, 182, 30));
    Соответствие.Вставить("095 80 10", Новый Цвет(20, 20, 183));
    Соответствие.Вставить("095 80 20", Новый Цвет(20, 20, 165));
    Соответствие.Вставить("095 80 30", Новый Цвет(21, 20, 147));
    Соответствие.Вставить("095 80 40", Новый Цвет(21, 20, 126));
    Соответствие.Вставить("095 80 50", Новый Цвет(21, 20, 109));
    Соответствие.Вставить("095 80 60", Новый Цвет(20, 207, 89));
    Соответствие.Вставить("095 80 70", Новый Цвет(20, 207, 57));
    Соответствие.Вставить("095 80 80", Новый Цвет(20, 206, 32));
    Соответствие.Вставить("095 90 10", Новый Цвет(23, 23, 210));
    Соответствие.Вставить("095 90 20", Новый Цвет(23, 23, 190));
    Соответствие.Вставить("095 90 30", Новый Цвет(23, 23, 167));
    Соответствие.Вставить("095 90 40", Новый Цвет(23, 23, 148));
    Соответствие.Вставить("095 90 50", Новый Цвет(24, 23, 132));
    Соответствие.Вставить("095 90 59", Новый Цвет(24, 24, 113));
    Соответствие.Вставить("100 20 05", Новый Цвет(55, 59, 52));
    Соответствие.Вставить("100 30 05", Новый Цвет(74, 75, 69));
    Соответствие.Вставить("100 30 10", Новый Цвет(75, 76, 61));
    Соответствие.Вставить("100 30 20", Новый Цвет(77, 82, 51));
    Соответствие.Вставить("100 40 05", Новый Цвет(96, 97, 91));
    Соответствие.Вставить("100 40 10", Новый Цвет(10, 101, 86));
    Соответствие.Вставить("100 40 20", Новый Цвет(9, 103, 72));
    Соответствие.Вставить("100 40 30", Новый Цвет(9, 103, 53));
    Соответствие.Вставить("100 40 40", Новый Цвет(9, 106, 34));
    Соответствие.Вставить("100 50 05", Новый Цвет(12, 12, 115));
    Соответствие.Вставить("100 50 10", Новый Цвет(12, 12, 105));
    Соответствие.Вставить("100 50 20", Новый Цвет(12, 127, 91));
    Соответствие.Вставить("100 50 30", Новый Цвет(12, 128, 76));
    Соответствие.Вставить("100 50 40", Новый Цвет(12, 130, 55));
    Соответствие.Вставить("100 50 50", Новый Цвет(11, 132, 35));
    Соответствие.Вставить("100 60 05", Новый Цвет(14, 14, 140));
    Соответствие.Вставить("100 60 10", Новый Цвет(14, 14, 131));
    Соответствие.Вставить("100 60 20", Новый Цвет(14, 15, 116));
    Соответствие.Вставить("100 60 30", Новый Цвет(14, 153, 96));
    Соответствие.Вставить("100 60 40", Новый Цвет(15, 156, 82));
    Соответствие.Вставить("100 60 50", Новый Цвет(14, 158, 63));
    Соответствие.Вставить("100 60 60", Новый Цвет(13, 159, 29));
    Соответствие.Вставить("100 70 05", Новый Цвет(17, 17, 167));
    Соответствие.Вставить("100 70 10", Новый Цвет(17, 17, 157));
    Соответствие.Вставить("100 70 20", Новый Цвет(17, 17, 139));
    Соответствие.Вставить("100 70 30", Новый Цвет(17, 18, 121));
    Соответствие.Вставить("100 70 40", Новый Цвет(17, 18, 106));
    Соответствие.Вставить("100 70 50", Новый Цвет(17, 182, 85));
    Соответствие.Вставить("100 70 60", Новый Цвет(17, 184, 64));
    Соответствие.Вставить("100 80 05", Новый Цвет(20, 20, 191));
    Соответствие.Вставить("100 80 10", Новый Цвет(20, 20, 180));
    Соответствие.Вставить("100 80 20", Новый Цвет(20, 20, 163));
    Соответствие.Вставить("100 80 30", Новый Цвет(20, 20, 146));
    Соответствие.Вставить("100 80 40", Новый Цвет(20, 20, 127));
    Соответствие.Вставить("100 80 50", Новый Цвет(20, 21, 110));
    Соответствие.Вставить("100 80 60", Новый Цвет(19, 215, 84));
    Соответствие.Вставить("100 80 70", Новый Цвет(19, 216, 65));
    Соответствие.Вставить("100 80 80", Новый Цвет(19, 217, 25));
    Соответствие.Вставить("100 90 05", Новый Цвет(23, 23, 219));
    Соответствие.Вставить("100 90 10", Новый Цвет(23, 23, 210));
    Соответствие.Вставить("100 90 20", Новый Цвет(23, 23, 190));
    Соответствие.Вставить("100 90 30", Новый Цвет(23, 23, 173));
    Соответствие.Вставить("100 90 40", Новый Цвет(23, 24, 151));
    Соответствие.Вставить("100 90 50", Новый Цвет(22, 23, 131));
    Соответствие.Вставить("110 20 10", Новый Цвет(52, 58, 46));
    Соответствие.Вставить("110 30 20", Новый Цвет(68, 81, 51));
    Соответствие.Вставить("110 40 10", Новый Цвет(9, 102, 87));
    Соответствие.Вставить("110 40 20", Новый Цвет(9, 103, 71));
    Соответствие.Вставить("110 40 30", Новый Цвет(8, 106, 55));
    Соответствие.Вставить("110 40 40", Новый Цвет(8, 109, 40));
    Соответствие.Вставить("110 50 10", Новый Цвет(11, 12, 107));
    Соответствие.Вставить("110 50 20", Новый Цвет(11, 128, 94));
    Соответствие.Вставить("110 50 30", Новый Цвет(11, 130, 78));
    Соответствие.Вставить("110 50 40", Новый Цвет(10, 133, 60));
    Соответствие.Вставить("110 50 50", Новый Цвет(9, 134, 35));
    Соответствие.Вставить("110 50 55", Новый Цвет(9, 139, 24));
    Соответствие.Вставить("110 60 10", Новый Цвет(14, 15, 132));
    Соответствие.Вставить("110 60 20", Новый Цвет(14, 15, 120));
    Соответствие.Вставить("110 60 30", Новый Цвет(14, 15, 103));
    Соответствие.Вставить("110 60 40", Новый Цвет(13, 158, 87));
    Соответствие.Вставить("110 60 50", Новый Цвет(12, 163, 66));
    Соответствие.Вставить("110 60 60", Новый Цвет(11, 166, 37));
    Соответствие.Вставить("110 60 65", Новый Цвет(11, 168, 21));
    Соответствие.Вставить("110 70 10", Новый Цвет(17, 17, 158));
    Соответствие.Вставить("110 70 20", Новый Цвет(16, 17, 141));
    Соответствие.Вставить("110 70 30", Новый Цвет(16, 18, 124));
    Соответствие.Вставить("110 70 40", Новый Цвет(15, 18, 107));
    Соответствие.Вставить("110 70 50", Новый Цвет(15, 186, 87));
    Соответствие.Вставить("110 70 60", Новый Цвет(14, 188, 66));
    Соответствие.Вставить("110 70 70", Новый Цвет(13, 189, 35));
    Соответствие.Вставить("110 70 77", Новый Цвет(13, 191 , 4));
    Соответствие.Вставить("110 80 10", Новый Цвет(19, 20, 182));
    Соответствие.Вставить("110 80 20", Новый Цвет(19, 21, 164));
    Соответствие.Вставить("110 80 30", Новый Цвет(19, 20, 148));
    Соответствие.Вставить("110 80 40", Новый Цвет(18, 21, 131));
    Соответствие.Вставить("110 80 50", Новый Цвет(18, 21, 113));
    Соответствие.Вставить("110 80 60", Новый Цвет(17, 220, 95));
    Соответствие.Вставить("110 80 70", Новый Цвет(17, 220, 69));
    Соответствие.Вставить("110 90 05", Новый Цвет(22, 23, 221));
    Соответствие.Вставить("110 90 10", Новый Цвет(22, 23, 210));
    Соответствие.Вставить("110 90 20", Новый Цвет(22, 23, 190));
    Соответствие.Вставить("110 90 30", Новый Цвет(22, 23, 172));
    Соответствие.Вставить("110 90 35", Новый Цвет(21, 24, 163));
    Соответствие.Вставить("110 90 40", Новый Цвет(21, 24, 155));
    Соответствие.Вставить("110 92 05", Новый Цвет(23, 23, 225));
    Соответствие.Вставить("120 30 05", Новый Цвет(70, 75, 68));
    Соответствие.Вставить("120 30 10", Новый Цвет(72, 80, 67));
    Соответствие.Вставить("120 30 20", Новый Цвет(66, 84, 56));
    Соответствие.Вставить("120 40 05", Новый Цвет(93, 99, 92));
    Соответствие.Вставить("120 40 10", Новый Цвет(9, 102, 86));
    Соответствие.Вставить("120 40 20", Новый Цвет(8, 104, 74));
    Соответствие.Вставить("120 40 30", Новый Цвет(8, 107, 60));
    Соответствие.Вставить("120 40 40", Новый Цвет(6, 112, 41));
    Соответствие.Вставить("120 50 05", Новый Цвет(11, 12, 115));
    Соответствие.Вставить("120 50 10", Новый Цвет(11, 12, 109));
    Соответствие.Вставить("120 50 20", Новый Цвет(11, 131, 95));
    Соответствие.Вставить("120 50 30", Новый Цвет(10, 133, 79));
    Соответствие.Вставить("120 50 40", Новый Цвет(9, 135, 61));
    Соответствие.Вставить("120 50 50", Новый Цвет(8, 137, 48));
    Соответствие.Вставить("120 60 05", Новый Цвет(14, 15, 144));
    Соответствие.Вставить("120 60 10", Новый Цвет(14, 15, 134));
    Соответствие.Вставить("120 60 20", Новый Цвет(13, 15, 119));
    Соответствие.Вставить("120 60 30", Новый Цвет(12, 15, 104));
    Соответствие.Вставить("120 60 40", Новый Цвет(12, 162, 89));
    Соответствие.Вставить("120 60 50", Новый Цвет(11, 165, 72));
    Соответствие.Вставить("120 60 60", Новый Цвет(9, 167, 52));
    Соответствие.Вставить("120 60 63", Новый Цвет(9, 168, 43));
    Соответствие.Вставить("120 70 05", Новый Цвет(16, 17, 167));
    Соответствие.Вставить("120 70 10", Новый Цвет(16, 17, 157));
    Соответствие.Вставить("120 70 20", Новый Цвет(16, 18, 143));
    Соответствие.Вставить("120 70 30", Новый Цвет(15, 18, 129));
    Соответствие.Вставить("120 70 40", Новый Цвет(14, 19, 112));
    Соответствие.Вставить("120 70 50", Новый Цвет(13, 192, 95));
    Соответствие.Вставить("120 70 60", Новый Цвет(12, 194, 79));
    Соответствие.Вставить("120 70 70", Новый Цвет(11, 193, 56));
    Соответствие.Вставить("120 70 75", Новый Цвет(10, 193, 39));
    Соответствие.Вставить("120 80 05", Новый Цвет(19, 20, 193));
    Соответствие.Вставить("120 80 10", Новый Цвет(19, 20, 183));
    Соответствие.Вставить("120 80 20", Новый Цвет(18, 21, 171));
    Соответствие.Вставить("120 80 30", Новый Цвет(17, 21, 152));
    Соответствие.Вставить("120 80 40", Новый Цвет(17, 21, 136));
    Соответствие.Вставить("120 80 50", Новый Цвет(16, 22, 118));
    Соответствие.Вставить("120 80 60", Новый Цвет(15, 22, 103));
    Соответствие.Вставить("120 90 05", Новый Цвет(22, 22, 218));
    Соответствие.Вставить("120 90 10", Новый Цвет(22, 23, 212));
    Соответствие.Вставить("120 90 20", Новый Цвет(21, 23, 194));
    Соответствие.Вставить("120 90 30", Новый Цвет(20, 24, 177));
    Соответствие.Вставить("130 30 20", Новый Цвет(57, 80, 54));
    Соответствие.Вставить("130 40 10", Новый Цвет(9, 104, 89));
    Соответствие.Вставить("130 40 20", Новый Цвет(7, 103, 73));
    Соответствие.Вставить("130 40 30", Новый Цвет(7, 107, 64));
    Соответствие.Вставить("130 50 10", Новый Цвет(11, 12, 109));
    Соответствие.Вставить("130 50 20", Новый Цвет(10, 129, 97));
    Соответствие.Вставить("130 50 30", Новый Цвет(9, 132, 82));
    Соответствие.Вставить("130 50 40", Новый Цвет(7, 135, 68));
    Соответствие.Вставить("130 50 50", Новый Цвет(5, 138, 58));
    Соответствие.Вставить("130 60 10", Новый Цвет(13, 15, 135));
    Соответствие.Вставить("130 60 20", Новый Цвет(12, 15, 122));
    Соответствие.Вставить("130 60 30", Новый Цвет(11, 15, 108));
    Соответствие.Вставить("130 60 40", Новый Цвет(10, 161, 93));
    Соответствие.Вставить("130 60 50", Новый Цвет(8, 164, 76));
    Соответствие.Вставить("130 60 60", Новый Цвет(6, 168, 64));
    Соответствие.Вставить("130 70 10", Новый Цвет(16, 17, 162));
    Соответствие.Вставить("130 70 20", Новый Цвет(15, 18, 148));
    Соответствие.Вставить("130 70 30", Новый Цвет(14, 18, 135));
    Соответствие.Вставить("130 70 40", Новый Цвет(13, 18, 117));
    Соответствие.Вставить("130 70 50", Новый Цвет(11, 19, 106));
    Соответствие.Вставить("130 70 60", Новый Цвет(10, 196, 88));
    Соответствие.Вставить("130 80 10", Новый Цвет(19, 20, 188));
    Соответствие.Вставить("130 80 20", Новый Цвет(18, 21, 174));
    Соответствие.Вставить("130 80 30", Новый Цвет(17, 21, 160));
    Соответствие.Вставить("130 80 40", Новый Цвет(15, 21, 145));
    Соответствие.Вставить("130 80 50", Новый Цвет(14, 22, 129));
    Соответствие.Вставить("130 90 05", Новый Цвет(22, 23, 222));
    Соответствие.Вставить("130 90 10", Новый Цвет(22, 23, 215));
    Соответствие.Вставить("130 90 20", Новый Цвет(20, 23, 198));
    Соответствие.Вставить("130 92 05", Новый Цвет(22, 23, 227));
    Соответствие.Вставить("140 20 05", Новый Цвет(47, 55, 51));
    Соответствие.Вставить("140 20 10", Новый Цвет(49, 63, 52));
    Соответствие.Вставить("140 20 20", Новый Цвет(44, 67, 50));
    Соответствие.Вставить("140 30 05", Новый Цвет(69, 78, 73));
    Соответствие.Вставить("140 30 10", Новый Цвет(64, 82, 69));
    Соответствие.Вставить("140 30 20", Новый Цвет(55, 86, 61));
    Соответствие.Вставить("140 30 30", Новый Цвет(39, 89, 54));
    Соответствие.Вставить("140 30 40", Новый Цвет(21, 91, 51));
    Соответствие.Вставить("140 40 05", Новый Цвет(9, 101, 94));
    Соответствие.Вставить("140 40 10", Новый Цвет(8, 102, 88));
    Соответствие.Вставить("140 40 20", Новый Цвет(7, 105, 77));
    Соответствие.Вставить("140 40 30", Новый Цвет(5, 110, 68));
    Соответствие.Вставить("140 40 40", Новый Цвет(3, 115, 58));
    Соответствие.Вставить("140 40 50", Новый Цвет(1, 118, 51));
    Соответствие.Вставить("140 50 05", Новый Цвет(11, 12, 116));
    Соответствие.Вставить("140 50 10", Новый Цвет(10, 12, 111));
    Соответствие.Вставить("140 50 20", Новый Цвет(9, 13, 101));
    Соответствие.Вставить("140 50 30", Новый Цвет(8, 135, 89));
    Соответствие.Вставить("140 50 40", Новый Цвет(5, 138, 77));
    Соответствие.Вставить("140 50 50", Новый Цвет(3, 142, 66));
    Соответствие.Вставить("140 50 60", Новый Цвет(1, 146, 56));
    Соответствие.Вставить("140 60 05", Новый Цвет(13, 14, 144));
    Соответствие.Вставить("140 60 10", Новый Цвет(13, 15, 136));
    Соответствие.Вставить("140 60 20", Новый Цвет(12, 15, 128));
    Соответствие.Вставить("140 60 30", Новый Цвет(10, 16, 115));
    Соответствие.Вставить("140 60 40", Новый Цвет(9, 16, 103));
    Соответствие.Вставить("140 60 50", Новый Цвет(6, 167, 89));
    Соответствие.Вставить("140 60 60", Новый Цвет(3, 172, 80));
    Соответствие.Вставить("140 60 70", Новый Цвет(, 172, 69));
    Соответствие.Вставить("140 70 05", Новый Цвет(16, 17, 168));
    Соответствие.Вставить("140 70 10", Новый Цвет(15, 17, 164));
    Соответствие.Вставить("140 70 20", Новый Цвет(14, 18, 151));
    Соответствие.Вставить("140 70 30", Новый Цвет(12, 18, 140));
    Соответствие.Вставить("140 70 40", Новый Цвет(11, 19, 128));
    Соответствие.Вставить("140 70 50", Новый Цвет(9, 19, 113));
    Соответствие.Вставить("140 70 60", Новый Цвет(6, 19, 100));
    Соответствие.Вставить("140 80 10", Новый Цвет(18, 20, 190));
    Соответствие.Вставить("140 80 20", Новый Цвет(17, 21, 176));
    Соответствие.Вставить("140 80 30", Новый Цвет(15, 21, 164));
    Соответствие.Вставить("140 80 40", Новый Цвет(13, 22, 152));
    Соответствие.Вставить("140 90 05", Новый Цвет(22, 23, 222));
    Соответствие.Вставить("140 90 10", Новый Цвет(21, 23, 217));
    Соответствие.Вставить("150 30 20", Новый Цвет(45, 85, 64));
    Соответствие.Вставить("150 30 30", Новый Цвет(29, 88, 59));
    Соответствие.Вставить("150 40 10", Новый Цвет(8, 102, 91));
    Соответствие.Вставить("150 40 20", Новый Цвет(6, 107, 83));
    Соответствие.Вставить("150 40 30", Новый Цвет(3, 109, 75));
    Соответствие.Вставить("150 40 40", Новый Цвет(1, 113, 64));
    Соответствие.Вставить("150 40 50", Новый Цвет(, 114, 59));
    Соответствие.Вставить("150 50 10", Новый Цвет(10, 12, 114));
    Соответствие.Вставить("150 50 20", Новый Цвет(8, 13, 105));
    Соответствие.Вставить("150 50 30", Новый Цвет(6, 136, 97));
    Соответствие.Вставить("150 50 40", Новый Цвет(4, 138, 91));
    Соответствие.Вставить("150 50 50", Новый Цвет(, 142, 80));
    Соответствие.Вставить("150 50 60", Новый Цвет(, 144, 71));
    Соответствие.Вставить("150 60 10", Новый Цвет(13, 15, 141));
    Соответствие.Вставить("150 60 20", Новый Цвет(11, 15, 131));
    Соответствие.Вставить("150 60 30", Новый Цвет(9, 16, 123));
    Соответствие.Вставить("150 60 40", Новый Цвет(7, 16, 113));
    Соответствие.Вставить("150 60 50", Новый Цвет(3, 16, 107));
    Соответствие.Вставить("150 60 60", Новый Цвет(, 170, 92));
    Соответствие.Вставить("150 70 10", Новый Цвет(15, 17, 165));
    Соответствие.Вставить("150 70 20", Новый Цвет(14, 18, 158));
    Соответствие.Вставить("150 70 30", Новый Цвет(12, 19, 149));
    Соответствие.Вставить("150 70 40", Новый Цвет(9, 19, 138));
    Соответствие.Вставить("150 70 50", Новый Цвет(7, 19, 127));
    Соответствие.Вставить("150 80 10", Новый Цвет(18, 20, 193));
    Соответствие.Вставить("150 80 20", Новый Цвет(16, 21, 183));
    Соответствие.Вставить("150 80 30", Новый Цвет(14, 21, 176));
    Соответствие.Вставить("150 80 40", Новый Цвет(12, 22, 163));
    Соответствие.Вставить("150 90 05", Новый Цвет(22, 23, 222));
    Соответствие.Вставить("150 90 10", Новый Цвет(21, 23, 218));
    Соответствие.Вставить("160 20 15", Новый Цвет(35, 65, 53));
    Соответствие.Вставить("160 20 20", Новый Цвет(28, 59, 51));
    Соответствие.Вставить("160 30 05", Новый Цвет(66, 78, 74));
    Соответствие.Вставить("160 30 10", Новый Цвет(62, 82, 73));
    Соответствие.Вставить("160 30 15", Новый Цвет(51, 80, 68));
    Соответствие.Вставить("160 30 20", Новый Цвет(39, 83, 67));
    Соответствие.Вставить("160 30 25", Новый Цвет(30, 84, 63));
    Соответствие.Вставить("160 30 30", Новый Цвет(17, 85, 61));
    Соответствие.Вставить("160 30 35", Новый Цвет(3, 90, 62));
    Соответствие.Вставить("160 30 40", Новый Цвет(2, 89, 59));
    Соответствие.Вставить("160 40 05", Новый Цвет(8, 100, 96));
    Соответствие.Вставить("160 40 10", Новый Цвет(8, 104, 96));
    Соответствие.Вставить("160 40 15", Новый Цвет(7, 106, 93));
    Соответствие.Вставить("160 40 20", Новый Цвет(5, 106, 89));
    Соответствие.Вставить("160 40 25", Новый Цвет(4, 107, 84));
    Соответствие.Вставить("160 40 30", Новый Цвет(3, 110, 82));
    Соответствие.Вставить("160 40 35", Новый Цвет(2, 112, 80));
    Соответствие.Вставить("160 40 40", Новый Цвет(1, 112, 78));
    Соответствие.Вставить("160 40 45", Новый Цвет(, 113, 75));
    Соответствие.Вставить("160 40 50", Новый Цвет(, 113, 70));
    Соответствие.Вставить("160 40 55", Новый Цвет(, 117, 69));
    Соответствие.Вставить("160 50 05", Новый Цвет(11, 12, 120));
    Соответствие.Вставить("160 50 10", Новый Цвет(10, 12, 118));
    Соответствие.Вставить("160 50 15", Новый Цвет(9, 13, 116));
    Соответствие.Вставить("160 50 20", Новый Цвет(8, 13, 114));
    Соответствие.Вставить("160 50 25", Новый Цвет(7, 13, 108));
    Соответствие.Вставить("160 50 30", Новый Цвет(5, 13, 106));
    Соответствие.Вставить("160 50 35", Новый Цвет(4, 13, 104));
    Соответствие.Вставить("160 50 40", Новый Цвет(1, 14, 101));
    Соответствие.Вставить("160 50 45", Новый Цвет(1, 141, 98));
    Соответствие.Вставить("160 50 50", Новый Цвет(, 141, 95));
    Соответствие.Вставить("160 50 55", Новый Цвет(, 143, 92));
    Соответствие.Вставить("160 50 60", Новый Цвет(, 143, 89));
    Соответствие.Вставить("160 60 05", Новый Цвет(13, 15, 145));
    Соответствие.Вставить("160 60 10", Новый Цвет(12, 15, 143));
    Соответствие.Вставить("160 60 15", Новый Цвет(12, 15, 141));
    Соответствие.Вставить("160 60 20", Новый Цвет(10, 15, 137));
    Соответствие.Вставить("160 60 25", Новый Цвет(9, 16, 134));
    Соответствие.Вставить("160 60 30", Новый Цвет(8, 16, 132));
    Соответствие.Вставить("160 60 35", Новый Цвет(7, 16, 129));
    Соответствие.Вставить("160 60 40", Новый Цвет(5, 16, 125));
    Соответствие.Вставить("160 60 45", Новый Цвет(3, 16, 123));
    Соответствие.Вставить("160 60 50", Новый Цвет(, 16, 119));
    Соответствие.Вставить("160 60 55", Новый Цвет(, 16, 114));
    Соответствие.Вставить("160 60 58", Новый Цвет(, 16, 110));
    Соответствие.Вставить("160 70 05", Новый Цвет(16, 17, 172));
    Соответствие.Вставить("160 70 10", Новый Цвет(15, 17, 167));
    Соответствие.Вставить("160 70 15", Новый Цвет(14, 18, 164));
    Соответствие.Вставить("160 70 20", Новый Цвет(13, 18, 163));
    Соответствие.Вставить("160 70 25", Новый Цвет(12, 18, 159));
    Соответствие.Вставить("160 70 30", Новый Цвет(10, 18, 156));
    Соответствие.Вставить("160 70 35", Новый Цвет(9, 18, 153));
    Соответствие.Вставить("160 70 40", Новый Цвет(7, 19, 150));
    Соответствие.Вставить("160 70 45", Новый Цвет(5, 19, 146));
    Соответствие.Вставить("160 70 50", Новый Цвет(4, 19, 146));
    Соответствие.Вставить("160 80 05", Новый Цвет(18, 20, 197));
    Соответствие.Вставить("160 80 10", Новый Цвет(18, 20, 194));
    Соответствие.Вставить("160 80 15", Новый Цвет(16, 21, 190));
    Соответствие.Вставить("160 80 20", Новый Цвет(15, 21, 188));
    Соответствие.Вставить("160 80 25", Новый Цвет(15, 21, 187));
    Соответствие.Вставить("160 80 30", Новый Цвет(14, 21, 184));
    Соответствие.Вставить("160 90 05", Новый Цвет(21, 23, 223));
    Соответствие.Вставить("160 90 10", Новый Цвет(20, 23, 220));
    Соответствие.Вставить("170 20 10", Новый Цвет(38, 60, 57));
    Соответствие.Вставить("170 20 20", Новый Цвет(19, 62, 53));
    Соответствие.Вставить("170 20 25", Новый Цвет(8, 65, 52));
    Соответствие.Вставить("170 30 15", Новый Цвет(48, 84, 74));
    Соответствие.Вставить("170 30 20", Новый Цвет(34, 81, 70));
    Соответствие.Вставить("170 30 25", Новый Цвет(17, 85, 70));
    Соответствие.Вставить("170 30 30", Новый Цвет(12, 85, 69));
    Соответствие.Вставить("170 30 35", Новый Цвет(0, 87, 69));
    Соответствие.Вставить("170 30 40", Новый Цвет(0, 89, 68));
    Соответствие.Вставить("170 40 10", Новый Цвет(7, 103, 97));
    Соответствие.Вставить("170 40 15", Новый Цвет(6, 103, 93));
    Соответствие.Вставить("170 40 20", Новый Цвет(5, 108, 95));
    Соответствие.Вставить("170 40 25", Новый Цвет(4, 107, 91));
    Соответствие.Вставить("170 40 30", Новый Цвет(2, 111, 91));
    Соответствие.Вставить("170 40 35", Новый Цвет(1, 111, 88));
    Соответствие.Вставить("170 40 40", Новый Цвет(, 112, 88));
    Соответствие.Вставить("170 40 45", Новый Цвет(, 111, 85));
    Соответствие.Вставить("170 40 50", Новый Цвет(, 111, 82));
    Соответствие.Вставить("170 50 10", Новый Цвет(10, 12, 119));
    Соответствие.Вставить("170 50 15", Новый Цвет(8, 12, 117));
    Соответствие.Вставить("170 50 20", Новый Цвет(7, 13, 117));
    Соответствие.Вставить("170 50 25", Новый Цвет(6, 13, 114));
    Соответствие.Вставить("170 50 30", Новый Цвет(4, 13, 113));
    Соответствие.Вставить("170 50 35", Новый Цвет(2, 13, 111));
    Соответствие.Вставить("170 50 40", Новый Цвет(, 13, 109));
    Соответствие.Вставить("170 50 45", Новый Цвет(, 13, 109));
    Соответствие.Вставить("170 50 50", Новый Цвет(, 14, 108));
    Соответствие.Вставить("170 50 55", Новый Цвет(, 14, 105));
    Соответствие.Вставить("170 60 10", Новый Цвет(12, 15, 144));
    Соответствие.Вставить("170 60 15", Новый Цвет(11, 15, 143));
    Соответствие.Вставить("170 60 20", Новый Цвет(10, 15, 140));
    Соответствие.Вставить("170 60 25", Новый Цвет(9, 15, 141));
    Соответствие.Вставить("170 60 30", Новый Цвет(7, 16, 139));
    Соответствие.Вставить("170 60 35", Новый Цвет(4, 16, 138));
    Соответствие.Вставить("170 60 40", Новый Цвет(3, 16, 136));
    Соответствие.Вставить("170 60 45", Новый Цвет(1, 16, 134));
    Соответствие.Вставить("170 60 50", Новый Цвет(, 16, 135));
    Соответствие.Вставить("170 70 10", Новый Цвет(15, 18, 172));
    Соответствие.Вставить("170 70 15", Новый Цвет(14, 18, 169));
    Соответствие.Вставить("170 70 20", Новый Цвет(12, 18, 168));
    Соответствие.Вставить("170 70 25", Новый Цвет(11, 18, 166));
    Соответствие.Вставить("170 70 30", Новый Цвет(10, 19, 166));
    Соответствие.Вставить("170 70 35", Новый Цвет(8, 19, 162));
    Соответствие.Вставить("170 70 40", Новый Цвет(6, 19, 159));
    Соответствие.Вставить("170 80 10", Новый Цвет(17, 20, 198));
    Соответствие.Вставить("170 80 15", Новый Цвет(16, 21, 197));
    Соответствие.Вставить("170 80 20", Новый Цвет(15, 21, 195));
    Соответствие.Вставить("170 80 25", Новый Цвет(14, 21, 193));
    Соответствие.Вставить("170 90 05", Новый Цвет(21, 23, 225));
    Соответствие.Вставить("170 90 10", Новый Цвет(20, 23, 224));
    Соответствие.Вставить("170 92 05", Новый Цвет(22, 23, 233));
    Соответствие.Вставить("180 20 05", Новый Цвет(47, 60, 59));
    Соответствие.Вставить("180 20 15", Новый Цвет(24, 59, 55));
    Соответствие.Вставить("180 20 20", Новый Цвет(17, 61, 58));
    Соответствие.Вставить("180 30 05", Новый Цвет(67, 80, 79));
    Соответствие.Вставить("180 30 10", Новый Цвет(54, 80, 78));
    Соответствие.Вставить("180 30 15", Новый Цвет(46, 82, 78));
    Соответствие.Вставить("180 30 20", Новый Цвет(32, 83, 77));
    Соответствие.Вставить("180 30 25", Новый Цвет(20, 86, 78));
    Соответствие.Вставить("180 30 30", Новый Цвет(11, 85, 78));
    Соответствие.Вставить("180 30 35", Новый Цвет(9, 87, 79));
    Соответствие.Вставить("180 40 05", Новый Цвет(8, 100, 98));
    Соответствие.Вставить("180 40 10", Новый Цвет(7, 10, 100));
    Соответствие.Вставить("180 40 15", Новый Цвет(6, 105, 99));
    Соответствие.Вставить("180 40 20", Новый Цвет(5, 10, 100));
    Соответствие.Вставить("180 40 25", Новый Цвет(3, 10, 101));
    Соответствие.Вставить("180 40 30", Новый Цвет(, 109, 99));
    Соответствие.Вставить("180 40 35", Новый Цвет(, 109, 98));
    Соответствие.Вставить("180 40 40", Новый Цвет(, 111, 98));
    Соответствие.Вставить("180 40 45", Новый Цвет(, 111, 99));
    Соответствие.Вставить("180 50 05", Новый Цвет(11, 12, 125));
    Соответствие.Вставить("180 50 10", Новый Цвет(9, 12, 123));
    Соответствие.Вставить("180 50 15", Новый Цвет(8, 12, 123));
    Соответствие.Вставить("180 50 20", Новый Цвет(7, 13, 122));
    Соответствие.Вставить("180 50 25", Новый Цвет(4, 13, 124));
    Соответствие.Вставить("180 50 30", Новый Цвет(3, 13, 122));
    Соответствие.Вставить("180 50 35", Новый Цвет(1, 13, 122));
    Соответствие.Вставить("180 50 40", Новый Цвет(, 13, 121));
    Соответствие.Вставить("180 50 45", Новый Цвет(, 13, 121));
    Соответствие.Вставить("180 50 50", Новый Цвет(, 13, 120));
    Соответствие.Вставить("180 60 05", Новый Цвет(13, 15, 149));
    Соответствие.Вставить("180 60 10", Новый Цвет(12, 15, 148));
    Соответствие.Вставить("180 60 15", Новый Цвет(11, 15, 148));
    Соответствие.Вставить("180 60 20", Новый Цвет(9, 15, 148));
    Соответствие.Вставить("180 60 25", Новый Цвет(8, 15, 146));
    Соответствие.Вставить("180 60 30", Новый Цвет(6, 16, 148));
    Соответствие.Вставить("180 60 35", Новый Цвет(3, 16, 148));
    Соответствие.Вставить("180 60 40", Новый Цвет(1, 16, 150));
    Соответствие.Вставить("180 60 45", Новый Цвет(, 16, 150));
    Соответствие.Вставить("180 60 50", Новый Цвет(, 16, 149));
    Соответствие.Вставить("180 70 05", Новый Цвет(16, 17, 175));
    Соответствие.Вставить("180 70 10", Новый Цвет(14, 17, 174));
    Соответствие.Вставить("180 70 15", Новый Цвет(13, 18, 175));
    Соответствие.Вставить("180 70 20", Новый Цвет(12, 18, 175));
    Соответствие.Вставить("180 70 25", Новый Цвет(10, 18, 173));
    Соответствие.Вставить("180 70 30", Новый Цвет(9, 18, 174));
    Соответствие.Вставить("180 70 35", Новый Цвет(6, 19, 174));
    Соответствие.Вставить("180 70 40", Новый Цвет(5, 19, 176));
    Соответствие.Вставить("180 80 05", Новый Цвет(18, 20, 199));
    Соответствие.Вставить("180 80 10", Новый Цвет(17, 20, 202));
    Соответствие.Вставить("180 80 15", Новый Цвет(16, 21, 203));
    Соответствие.Вставить("180 80 20", Новый Цвет(14, 21, 200));
    Соответствие.Вставить("180 80 25", Новый Цвет(13, 21, 201));
    Соответствие.Вставить("180 80 30", Новый Цвет(12, 21, 203));
    Соответствие.Вставить("180 90 05", Новый Цвет(21, 23, 229));
    Соответствие.Вставить("180 90 10", Новый Цвет(20, 23, 229));
    Соответствие.Вставить("190 20 20", Новый Цвет(19, 65, 64));
    Соответствие.Вставить("190 30 15", Новый Цвет(47, 83, 82));
    Соответствие.Вставить("190 30 20", Новый Цвет(27, 83, 83));
    Соответствие.Вставить("190 30 25", Новый Цвет(14, 85, 85));
    Соответствие.Вставить("190 30 30", Новый Цвет(1, 86, 87));
    Соответствие.Вставить("190 30 35", Новый Цвет(0, 86, 88));
    Соответствие.Вставить("190 40 10", Новый Цвет(7, 10, 102));
    Соответствие.Вставить("190 40 15", Новый Цвет(6, 10, 105));
    Соответствие.Вставить("190 40 20", Новый Цвет(5, 10, 106));
    Соответствие.Вставить("190 40 25", Новый Цвет(2, 10, 108));
    Соответствие.Вставить("190 40 30", Новый Цвет(1, 10, 108));
    Соответствие.Вставить("190 40 35", Новый Цвет(, 10, 110));
    Соответствие.Вставить("190 40 40", Новый Цвет(, 11, 111));
    Соответствие.Вставить("190 40 45", Новый Цвет(, 11, 112));
    Соответствие.Вставить("190 50 10", Новый Цвет(9, 12, 125));
    Соответствие.Вставить("190 50 15", Новый Цвет(8, 13, 129));
    Соответствие.Вставить("190 50 20", Новый Цвет(7, 13, 129));
    Соответствие.Вставить("190 50 25", Новый Цвет(5, 13, 131));
    Соответствие.Вставить("190 50 30", Новый Цвет(1, 13, 131));
    Соответствие.Вставить("190 50 35", Новый Цвет(, 13, 133));
    Соответствие.Вставить("190 50 40", Новый Цвет(, 13, 136));
    Соответствие.Вставить("190 50 45", Новый Цвет(, 13, 137));
    Соответствие.Вставить("190 60 10", Новый Цвет(12, 15, 153));
    Соответствие.Вставить("190 60 15", Новый Цвет(11, 15, 154));
    Соответствие.Вставить("190 60 20", Новый Цвет(9, 15, 153));
    Соответствие.Вставить("190 60 25", Новый Цвет(8, 15, 156));
    Соответствие.Вставить("190 60 30", Новый Цвет(6, 16, 160));
    Соответствие.Вставить("190 60 35", Новый Цвет(4, 16, 162));
    Соответствие.Вставить("190 60 40", Новый Цвет(1, 16, 161));
    Соответствие.Вставить("190 60 45", Новый Цвет(, 16, 161));
    Соответствие.Вставить("190 70 10", Новый Цвет(14, 17, 178));
    Соответствие.Вставить("190 70 15", Новый Цвет(14, 18, 179));
    Соответствие.Вставить("190 70 20", Новый Цвет(12, 18, 181));
    Соответствие.Вставить("190 70 25", Новый Цвет(11, 18, 183));
    Соответствие.Вставить("190 70 30", Новый Цвет(9, 18, 186));
    Соответствие.Вставить("190 70 35", Новый Цвет(7, 18, 186));
    Соответствие.Вставить("190 80 10", Новый Цвет(17, 20, 203));
    Соответствие.Вставить("190 80 15", Новый Цвет(16, 21, 208));
    Соответствие.Вставить("190 80 20", Новый Цвет(15, 21, 208));
    Соответствие.Вставить("190 80 25", Новый Цвет(13, 21, 209));
    Соответствие.Вставить("190 90 05", Новый Цвет(21, 23, 230));
    Соответствие.Вставить("190 90 10", Новый Цвет(20, 23, 232));
    Соответствие.Вставить("200 20 10", Новый Цвет(39, 59, 62));
    Соответствие.Вставить("200 20 15", Новый Цвет(25, 57, 62));
    Соответствие.Вставить("200 20 20", Новый Цвет(10, 59, 63));
    Соответствие.Вставить("200 20 23", Новый Цвет(8, 61, 70));
    Соответствие.Вставить("200 30 05", Новый Цвет(63, 77, 78));
    Соответствие.Вставить("200 30 10", Новый Цвет(58, 81, 84));
    Соответствие.Вставить("200 30 15", Новый Цвет(46, 83, 87));
    Соответствие.Вставить("200 30 20", Новый Цвет(34, 84, 88));
    Соответствие.Вставить("200 30 25", Новый Цвет(14, 82, 87));
    Соответствие.Вставить("200 30 30", Новый Цвет(3, 85, 92));
    Соответствие.Вставить("200 30 33", Новый Цвет(0, 85, 96));
    Соответствие.Вставить("200 40 05", Новый Цвет(8, 10, 101));
    Соответствие.Вставить("200 40 10", Новый Цвет(7, 10, 104));
    Соответствие.Вставить("200 40 15", Новый Цвет(6, 10, 108));
    Соответствие.Вставить("200 40 20", Новый Цвет(5, 10, 112));
    Соответствие.Вставить("200 40 25", Новый Цвет(2, 10, 114));
    Соответствие.Вставить("200 40 30", Новый Цвет(1, 10, 116));
    Соответствие.Вставить("200 40 35", Новый Цвет(, 10, 117));
    Соответствие.Вставить("200 40 40", Новый Цвет(, 10, 122));
    Соответствие.Вставить("200 50 05", Новый Цвет(10, 12, 124));
    Соответствие.Вставить("200 50 10", Новый Цвет(9, 12, 130));
    Соответствие.Вставить("200 50 15", Новый Цвет(8, 12, 132));
    Соответствие.Вставить("200 50 20", Новый Цвет(7, 13, 134));
    Соответствие.Вставить("200 50 25", Новый Цвет(5, 13, 138));
    Соответствие.Вставить("200 50 30", Новый Цвет(2, 13, 142));
    Соответствие.Вставить("200 50 35", Новый Цвет(, 13, 144));
    Соответствие.Вставить("200 50 40", Новый Цвет(, 13, 148));
    Соответствие.Вставить("200 50 45", Новый Цвет(, 13, 150));
    Соответствие.Вставить("200 60 05", Новый Цвет(13, 14, 150));
    Соответствие.Вставить("200 60 10", Новый Цвет(12, 15, 154));
    Соответствие.Вставить("200 60 15", Новый Цвет(11, 15, 158));
    Соответствие.Вставить("200 60 20", Новый Цвет(9, 15, 160));
    Соответствие.Вставить("200 60 25", Новый Цвет(8, 15, 163));
    Соответствие.Вставить("200 60 30", Новый Цвет(5, 15, 165));
    Соответствие.Вставить("200 60 35", Новый Цвет(3, 16, 171));
    Соответствие.Вставить("200 60 40", Новый Цвет(2, 16, 175));
    Соответствие.Вставить("200 70 05", Новый Цвет(16, 17, 176));
    Соответствие.Вставить("200 70 10", Новый Цвет(14, 17, 183));
    Соответствие.Вставить("200 70 15", Новый Цвет(13, 18, 183));
    Соответствие.Вставить("200 70 20", Новый Цвет(12, 18, 185));
    Соответствие.Вставить("200 70 25", Новый Цвет(11, 18, 193));
    Соответствие.Вставить("200 80 05", Новый Цвет(18, 20, 203));
    Соответствие.Вставить("200 80 10", Новый Цвет(17, 20, 207));
    Соответствие.Вставить("200 80 15", Новый Цвет(16, 20, 207));
    Соответствие.Вставить("200 80 20", Новый Цвет(15, 21, 214));
    Соответствие.Вставить("200 80 25", Новый Цвет(13, 21, 217));
    Соответствие.Вставить("200 90 05", Новый Цвет(21, 23, 232));
    Соответствие.Вставить("200 90 10", Новый Цвет(20, 23, 233));
    Соответствие.Вставить("200 92 05", Новый Цвет(21, 23, 239));
    Соответствие.Вставить("210 30 15", Новый Цвет(40, 79, 86));
    Соответствие.Вставить("210 30 20", Новый Цвет(27, 83, 93));
    Соответствие.Вставить("210 30 25", Новый Цвет(14, 81, 95));
    Соответствие.Вставить("210 30 30", Новый Цвет(7, 80, 98));
    Соответствие.Вставить("210 40 10", Новый Цвет(7, 10, 105));
    Соответствие.Вставить("210 40 15", Новый Цвет(6, 10, 112));
    Соответствие.Вставить("210 40 20", Новый Цвет(4, 10, 114));
    Соответствие.Вставить("210 40 25", Новый Цвет(2, 10, 116));
    Соответствие.Вставить("210 40 30", Новый Цвет(, 10, 121));
    Соответствие.Вставить("210 40 35", Новый Цвет(, 10, 124));
    Соответствие.Вставить("210 40 38", Новый Цвет(, 10, 128));
    Соответствие.Вставить("210 50 10", Новый Цвет(9, 12, 131));
    Соответствие.Вставить("210 50 15", Новый Цвет(8, 12, 132));
    Соответствие.Вставить("210 50 20", Новый Цвет(7, 12, 138));
    Соответствие.Вставить("210 50 25", Новый Цвет(5, 13, 141));
    Соответствие.Вставить("210 50 30", Новый Цвет(3, 12, 146));
    Соответствие.Вставить("210 50 35", Новый Цвет(2, 13, 149));
    Соответствие.Вставить("210 50 40", Новый Цвет(, 13, 155));
    Соответствие.Вставить("210 50 45", Новый Цвет(, 13, 160));
    Соответствие.Вставить("210 60 10", Новый Цвет(12, 15, 157));
    Соответствие.Вставить("210 60 15", Новый Цвет(11, 15, 159));
    Соответствие.Вставить("210 60 20", Новый Цвет(9, 15, 167));
    Соответствие.Вставить("210 60 25", Новый Цвет(8, 15, 172));
    Соответствие.Вставить("210 60 30", Новый Цвет(6, 16, 177));
    Соответствие.Вставить("210 60 35", Новый Цвет(3, 15, 179));
    Соответствие.Вставить("210 60 40", Новый Цвет(1, 15, 184));
    Соответствие.Вставить("210 70 10", Новый Цвет(14, 17, 182));
    Соответствие.Вставить("210 70 15", Новый Цвет(14, 18, 188));
    Соответствие.Вставить("210 70 20", Новый Цвет(12, 18, 192));
    Соответствие.Вставить("210 70 25", Новый Цвет(11, 18, 198));
    Соответствие.Вставить("210 70 30", Новый Цвет(9, 18, 204));
    Соответствие.Вставить("210 70 35", Новый Цвет(7, 18, 206));
    Соответствие.Вставить("210 80 10", Новый Цвет(18, 20, 211));
    Соответствие.Вставить("210 80 15", Новый Цвет(16, 21, 214));
    Соответствие.Вставить("210 80 20", Новый Цвет(15, 21, 219));
    Соответствие.Вставить("210 80 25", Новый Цвет(14, 21, 223));
    Соответствие.Вставить("210 90 05", Новый Цвет(21, 23, 235));
    Соответствие.Вставить("210 90 10", Новый Цвет(20, 23, 235));
    Соответствие.Вставить("220 20 05", Новый Цвет(46, 56, 60));
    Соответствие.Вставить("220 20 15", Новый Цвет(29, 58, 70));
    Соответствие.Вставить("220 20 20", Новый Цвет(22, 58, 73));
    Соответствие.Вставить("220 30 05", Новый Цвет(65, 75, 79));
    Соответствие.Вставить("220 30 10", Новый Цвет(57, 79, 85));
    Соответствие.Вставить("220 30 15", Новый Цвет(42, 81, 92));
    Соответствие.Вставить("220 30 20", Новый Цвет(30, 80, 95));
    Соответствие.Вставить("220 30 25", Новый Цвет(14, 81, 99));
    Соответствие.Вставить("220 30 30", Новый Цвет(6, 8, 105));
    Соответствие.Вставить("220 40 05", Новый Цвет(8, 10, 103));
    Соответствие.Вставить("220 40 10", Новый Цвет(8, 10, 109));
    Соответствие.Вставить("220 40 15", Новый Цвет(6, 10, 115));
    Соответствие.Вставить("220 40 20", Новый Цвет(5, 10, 119));
    Соответствие.Вставить("220 40 25", Новый Цвет(4, 10, 123));
    Соответствие.Вставить("220 40 30", Новый Цвет(2, 10, 131));
    Соответствие.Вставить("220 40 35", Новый Цвет(1, 10, 136));
    Соответствие.Вставить("220 40 40", Новый Цвет(, 10, 140));
    Соответствие.Вставить("220 50 05", Новый Цвет(11, 12, 129));
    Соответствие.Вставить("220 50 10", Новый Цвет(10, 12, 133));
    Соответствие.Вставить("220 50 15", Новый Цвет(8, 12, 139));
    Соответствие.Вставить("220 50 20", Новый Цвет(7, 12, 143));
    Соответствие.Вставить("220 50 25", Новый Цвет(6, 12, 146));
    Соответствие.Вставить("220 50 30", Новый Цвет(3, 13, 154));
    Соответствие.Вставить("220 50 35", Новый Цвет(1, 12, 159));
    Соответствие.Вставить("220 50 40", Новый Цвет(, 13, 165));
    Соответствие.Вставить("220 60 05", Новый Цвет(13, 14, 152));
    Соответствие.Вставить("220 60 10", Новый Цвет(12, 15, 159));
    Соответствие.Вставить("220 60 15", Новый Цвет(11, 15, 165));
    Соответствие.Вставить("220 60 20", Новый Цвет(10, 15, 169));
    Соответствие.Вставить("220 60 25", Новый Цвет(8, 15, 176));
    Соответствие.Вставить("220 60 30", Новый Цвет(7, 15, 183));
    Соответствие.Вставить("220 60 35", Новый Цвет(5, 15, 185));
    Соответствие.Вставить("220 60 40", Новый Цвет(2, 15, 191));
    Соответствие.Вставить("220 70 05", Новый Цвет(16, 17, 180));
    Соответствие.Вставить("220 70 10", Новый Цвет(15, 17, 188));
    Соответствие.Вставить("220 70 15", Новый Цвет(14, 18, 193));
    Соответствие.Вставить("220 70 20", Новый Цвет(12, 18, 198));
    Соответствие.Вставить("220 70 25", Новый Цвет(11, 18, 202));
    Соответствие.Вставить("220 70 30", Новый Цвет(9, 18, 205));
    Соответствие.Вставить("220 70 35", Новый Цвет(8, 18, 215));
    Соответствие.Вставить("220 80 05", Новый Цвет(18, 20, 205));
    Соответствие.Вставить("220 80 10", Новый Цвет(17, 20, 214));
    Соответствие.Вставить("220 80 15", Новый Цвет(16, 21, 222));
    Соответствие.Вставить("220 80 20", Новый Цвет(16, 21, 227));
    Соответствие.Вставить("220 80 25", Новый Цвет(14, 21, 230));
    Соответствие.Вставить("220 90 05", Новый Цвет(21, 23, 233));
    Соответствие.Вставить("220 92 05", Новый Цвет(22, 23, 241));
    Соответствие.Вставить("230 20 10", Новый Цвет(41, 58, 67));
    Соответствие.Вставить("230 20 20", Новый Цвет(23, 55, 76));
    Соответствие.Вставить("230 30 15", Новый Цвет(48, 79, 92));
    Соответствие.Вставить("230 30 20", Новый Цвет(40, 79, 98));
    Соответствие.Вставить("230 30 25", Новый Цвет(24, 8, 105));
    Соответствие.Вставить("230 40 10", Новый Цвет(79, 9, 109));
    Соответствие.Вставить("230 40 15", Новый Цвет(7, 10, 115));
    Соответствие.Вставить("230 40 20", Новый Цвет(5, 10, 122));
    Соответствие.Вставить("230 40 25", Новый Цвет(3, 10, 128));
    Соответствие.Вставить("230 40 30", Новый Цвет(2, 10, 134));
    Соответствие.Вставить("230 40 35", Новый Цвет(, 10, 142));
    Соответствие.Вставить("230 40 40", Новый Цвет(, 10, 145));
    Соответствие.Вставить("230 50 10", Новый Цвет(10, 12, 134));
    Соответствие.Вставить("230 50 15", Новый Цвет(9, 12, 141));
    Соответствие.Вставить("230 50 20", Новый Цвет(8, 12, 148));
    Соответствие.Вставить("230 50 25", Новый Цвет(6, 12, 153));
    Соответствие.Вставить("230 50 30", Новый Цвет(5, 12, 157));
    Соответствие.Вставить("230 50 35", Новый Цвет(3, 12, 166));
    Соответствие.Вставить("230 50 40", Новый Цвет(1, 12, 172));
    Соответствие.Вставить("230 60 10", Новый Цвет(12, 15, 162));
    Соответствие.Вставить("230 60 15", Новый Цвет(11, 15, 167));
    Соответствие.Вставить("230 60 20", Новый Цвет(10, 15, 175));
    Соответствие.Вставить("230 60 25", Новый Цвет(9, 15, 179));
    Соответствие.Вставить("230 60 30", Новый Цвет(8, 15, 186));
    Соответствие.Вставить("230 60 35", Новый Цвет(6, 15, 193));
    Соответствие.Вставить("230 60 40", Новый Цвет(4, 15, 200));
    Соответствие.Вставить("230 70 10", Новый Цвет(15, 17, 190));
    Соответствие.Вставить("230 70 15", Новый Цвет(14, 17, 193));
    Соответствие.Вставить("230 70 20", Новый Цвет(12, 17, 201));
    Соответствие.Вставить("230 70 25", Новый Цвет(12, 18, 209));
    Соответствие.Вставить("230 70 30", Новый Цвет(10, 18, 214));
    Соответствие.Вставить("230 80 10", Новый Цвет(18, 20, 217));
    Соответствие.Вставить("230 80 15", Новый Цвет(17, 20, 220));
    Соответствие.Вставить("230 80 20", Новый Цвет(16, 20, 228));
    Соответствие.Вставить("230 90 05", Новый Цвет(21, 23, 233));
    Соответствие.Вставить("240 20 15", Новый Цвет(34, 57, 73));
    Соответствие.Вставить("240 20 20", Новый Цвет(26, 55, 79));
    Соответствие.Вставить("240 20 22", Новый Цвет(21, 54, 81));
    Соответствие.Вставить("240 30 05", Новый Цвет(67, 76, 82));
    Соответствие.Вставить("240 30 10", Новый Цвет(62, 80, 92));
    Соответствие.Вставить("240 30 15", Новый Цвет(54, 79, 97));
    Соответствие.Вставить("240 30 20", Новый Цвет(44, 7, 102));
    Соответствие.Вставить("240 30 25", Новый Цвет(33, 7, 108));
    Соответствие.Вставить("240 30 30", Новый Цвет(18, 7, 115));
    Соответствие.Вставить("240 30 35", Новый Цвет(2, 7, 119));
    Соответствие.Вставить("240 40 05", Новый Цвет(88, 9, 105));
    Соответствие.Вставить("240 40 10", Новый Цвет(8, 10, 112));
    Соответствие.Вставить("240 40 15", Новый Цвет(7, 10, 121));
    Соответствие.Вставить("240 40 20", Новый Цвет(6, 10, 126));
    Соответствие.Вставить("240 40 25", Новый Цвет(5, 10, 134));
    Соответствие.Вставить("240 40 30", Новый Цвет(35, 9, 141));
    Соответствие.Вставить("240 40 35", Новый Цвет(23, 9, 145));
    Соответствие.Вставить("240 40 40", Новый Цвет(13, 9, 153));
    Соответствие.Вставить("240 50 05", Новый Цвет(11, 12, 128));
    Соответствие.Вставить("240 50 10", Новый Цвет(10, 12, 139));
    Соответствие.Вставить("240 50 15", Новый Цвет(9, 12, 145));
    Соответствие.Вставить("240 50 20", Новый Цвет(8, 12, 151));
    Соответствие.Вставить("240 50 25", Новый Цвет(7, 12, 160));
    Соответствие.Вставить("240 50 30", Новый Цвет(5, 12, 165));
    Соответствие.Вставить("240 50 35", Новый Цвет(3, 12, 172));
    Соответствие.Вставить("240 50 40", Новый Цвет(3, 12, 179));
    Соответствие.Вставить("240 60 05", Новый Цвет(13, 14, 157));
    Соответствие.Вставить("240 60 10", Новый Цвет(12, 14, 163));
    Соответствие.Вставить("240 60 15", Новый Цвет(11, 15, 171));
    Соответствие.Вставить("240 60 20", Новый Цвет(11, 15, 179));
    Соответствие.Вставить("240 60 25", Новый Цвет(9, 15, 187));
    Соответствие.Вставить("240 60 30", Новый Цвет(8, 15, 194));
    Соответствие.Вставить("240 60 35", Новый Цвет(6, 15, 202));
    Соответствие.Вставить("240 60 40", Новый Цвет(5, 15, 205));
    Соответствие.Вставить("240 70 05", Новый Цвет(16, 17, 182));
    Соответствие.Вставить("240 70 10", Новый Цвет(15, 17, 189));
    Соответствие.Вставить("240 70 15", Новый Цвет(14, 17, 197));
    Соответствие.Вставить("240 70 20", Новый Цвет(13, 17, 205));
    Соответствие.Вставить("240 70 25", Новый Цвет(12, 17, 212));
    Соответствие.Вставить("240 70 30", Новый Цвет(11, 17, 219));
    Соответствие.Вставить("240 80 05", Новый Цвет(18, 20, 208));
    Соответствие.Вставить("240 80 10", Новый Цвет(18, 20, 218));
    Соответствие.Вставить("240 80 15", Новый Цвет(17, 20, 225));
    Соответствие.Вставить("240 80 20", Новый Цвет(16, 20, 235));
    Соответствие.Вставить("240 90 05", Новый Цвет(22, 23, 239));
    Соответствие.Вставить("250 20 20", Новый Цвет(27, 55, 82));
    Соответствие.Вставить("250 20 25", Новый Цвет(29, 55, 90));
    Соответствие.Вставить("250 30 15", Новый Цвет(57, 78, 98));
    Соответствие.Вставить("250 30 20", Новый Цвет(42, 7, 104));
    Соответствие.Вставить("250 30 25", Новый Цвет(42, 7, 112));
    Соответствие.Вставить("250 30 30", Новый Цвет(30, 7, 122));
    Соответствие.Вставить("250 40 10", Новый Цвет(8, 10, 115));
    Соответствие.Вставить("250 40 15", Новый Цвет(78, 9, 122));
    Соответствие.Вставить("250 40 20", Новый Цвет(67, 9, 127));
    Соответствие.Вставить("250 40 25", Новый Цвет(56, 9, 136));
    Соответствие.Вставить("250 40 30", Новый Цвет(47, 9, 141));
    Соответствие.Вставить("250 40 35", Новый Цвет(32, 9, 148));
    Соответствие.Вставить("250 40 40", Новый Цвет(17, 9, 155));
    Соответствие.Вставить("250 50 10", Новый Цвет(10, 12, 139));
    Соответствие.Вставить("250 50 15", Новый Цвет(10, 12, 146));
    Соответствие.Вставить("250 50 20", Новый Цвет(9, 12, 154));
    Соответствие.Вставить("250 50 25", Новый Цвет(8, 12, 160));
    Соответствие.Вставить("250 50 30", Новый Цвет(7, 12, 169));
    Соответствие.Вставить("250 50 35", Новый Цвет(5, 12, 177));
    Соответствие.Вставить("250 50 40", Новый Цвет(4, 12, 185));
    Соответствие.Вставить("250 60 10", Новый Цвет(13, 14, 165));
    Соответствие.Вставить("250 60 15", Новый Цвет(12, 14, 174));
    Соответствие.Вставить("250 60 20", Новый Цвет(11, 14, 181));
    Соответствие.Вставить("250 60 25", Новый Цвет(10, 14, 189));
    Соответствие.Вставить("250 60 30", Новый Цвет(9, 14, 195));
    Соответствие.Вставить("250 60 35", Новый Цвет(9, 14, 205));
    Соответствие.Вставить("250 60 40", Новый Цвет(8, 14, 215));
    Соответствие.Вставить("250 70 10", Новый Цвет(15, 17, 191));
    Соответствие.Вставить("250 70 15", Новый Цвет(15, 17, 200));
    Соответствие.Вставить("250 70 20", Новый Цвет(14, 17, 208));
    Соответствие.Вставить("250 70 25", Новый Цвет(13, 17, 217));
    Соответствие.Вставить("250 70 30", Новый Цвет(12, 17, 224));
    Соответствие.Вставить("250 80 10", Новый Цвет(18, 20, 218));
    Соответствие.Вставить("250 80 15", Новый Цвет(18, 20, 226));
    Соответствие.Вставить("250 80 20", Новый Цвет(16, 20, 232));
    Соответствие.Вставить("250 90 05", Новый Цвет(22, 22, 236));
    Соответствие.Вставить("250 92 05", Новый Цвет(22, 23, 243));
    Соответствие.Вставить("260 20 05", Новый Цвет(50, 55, 62));
    Соответствие.Вставить("260 20 10", Новый Цвет(48, 56, 69));
    Соответствие.Вставить("260 20 15", Новый Цвет(42, 55, 75));
    Соответствие.Вставить("260 20 20", Новый Цвет(37, 55, 82));
    Соответствие.Вставить("260 30 05", Новый Цвет(70, 75, 83));
    Соответствие.Вставить("260 30 10", Новый Цвет(66, 75, 90));
    Соответствие.Вставить("260 30 15", Новый Цвет(61, 74, 98));
    Соответствие.Вставить("260 30 20", Новый Цвет(55, 7, 106));
    Соответствие.Вставить("260 30 25", Новый Цвет(48, 7, 113));
    Соответствие.Вставить("260 30 30", Новый Цвет(44, 7, 121));
    Соответствие.Вставить("260 30 35", Новый Цвет(22, 7, 128));
    Соответствие.Вставить("260 40 05", Новый Цвет(91, 9, 105));
    Соответствие.Вставить("260 40 10", Новый Цвет(87, 9, 114));
    Соответствие.Вставить("260 40 15", Новый Цвет(85, 9, 122));
    Соответствие.Вставить("260 40 20", Новый Цвет(77, 9, 130));
    Соответствие.Вставить("260 40 25", Новый Цвет(71, 9, 136));
    Соответствие.Вставить("260 40 30", Новый Цвет(62, 9, 142));
    Соответствие.Вставить("260 40 35", Новый Цвет(56, 9, 151));
    Соответствие.Вставить("260 40 40", Новый Цвет(35, 9, 159));
    Соответствие.Вставить("260 40 45", Новый Цвет(19, 9, 167));
    Соответствие.Вставить("260 50 05", Новый Цвет(11, 12, 128));
    Соответствие.Вставить("260 50 10", Новый Цвет(11, 12, 137));
    Соответствие.Вставить("260 50 15", Новый Цвет(10, 12, 145));
    Соответствие.Вставить("260 50 20", Новый Цвет(10, 12, 154));
    Соответствие.Вставить("260 50 25", Новый Цвет(9, 12, 163));
    Соответствие.Вставить("260 50 30", Новый Цвет(8, 12, 173));
    Соответствие.Вставить("260 50 35", Новый Цвет(7, 11, 177));
    Соответствие.Вставить("260 50 40", Новый Цвет(6, 11, 187));
    Соответствие.Вставить("260 60 05", Новый Цвет(14, 14, 154));
    Соответствие.Вставить("260 60 10", Новый Цвет(13, 14, 163));
    Соответствие.Вставить("260 60 15", Новый Цвет(13, 14, 172));
    Соответствие.Вставить("260 60 20", Новый Цвет(12, 14, 180));
    Соответствие.Вставить("260 60 25", Новый Цвет(12, 14, 188));
    Соответствие.Вставить("260 60 30", Новый Цвет(11, 14, 196));
    Соответствие.Вставить("260 60 35", Новый Цвет(10, 14, 206));
    Соответствие.Вставить("260 70 05", Новый Цвет(16, 17, 183));
    Соответствие.Вставить("260 70 10", Новый Цвет(16, 17, 192));
    Соответствие.Вставить("260 70 15", Новый Цвет(15, 17, 200));
    Соответствие.Вставить("260 70 20", Новый Цвет(15, 17, 207));
    Соответствие.Вставить("260 70 25", Новый Цвет(14, 17, 217));
    Соответствие.Вставить("260 80 05", Новый Цвет(19, 20, 208));
    Соответствие.Вставить("260 80 10", Новый Цвет(18, 20, 219));
    Соответствие.Вставить("260 80 15", Новый Цвет(18, 20, 225));
    Соответствие.Вставить("260 90 05", Новый Цвет(22, 22, 233));
    Соответствие.Вставить("270 20 20", Новый Цвет(42, 52, 84));
    Соответствие.Вставить("270 20 25", Новый Цвет(40, 53, 90));
    Соответствие.Вставить("270 20 29", Новый Цвет(37, 52, 98));
    Соответствие.Вставить("270 30 15", Новый Цвет(70, 7, 101));
    Соответствие.Вставить("270 30 20", Новый Цвет(65, 7, 106));
    Соответствие.Вставить("270 30 25", Новый Цвет(62, 7, 114));
    Соответствие.Вставить("270 30 30", Новый Цвет(57, 7, 122));
    Соответствие.Вставить("270 30 35", Новый Цвет(51, 7, 128));
    Соответствие.Вставить("270 30 40", Новый Цвет(43, 6, 138));
    Соответствие.Вставить("270 40 15", Новый Цвет(90, 9, 124));
    Соответствие.Вставить("270 40 20", Новый Цвет(85, 9, 132));
    Соответствие.Вставить("270 40 25", Новый Цвет(83, 9, 139));
    Соответствие.Вставить("270 40 30", Новый Цвет(79, 9, 147));
    Соответствие.Вставить("270 40 35", Новый Цвет(70, 9, 155));
    Соответствие.Вставить("270 40 40", Новый Цвет(67, 9, 162));
    Соответствие.Вставить("270 50 10", Новый Цвет(11, 12, 142));
    Соответствие.Вставить("270 50 15", Новый Цвет(11, 12, 150));
    Соответствие.Вставить("270 50 20", Новый Цвет(10, 12, 157));
    Соответствие.Вставить("270 50 25", Новый Цвет(10, 11, 165));
    Соответствие.Вставить("270 50 30", Новый Цвет(10, 11, 173));
    Соответствие.Вставить("270 50 35", Новый Цвет(9, 11, 179));
    Соответствие.Вставить("270 50 40", Новый Цвет(9, 11, 189));
    Соответствие.Вставить("270 60 10", Новый Цвет(13, 14, 167));
    Соответствие.Вставить("270 60 15", Новый Цвет(13, 14, 176));
    Соответствие.Вставить("270 60 20", Новый Цвет(13, 14, 184));
    Соответствие.Вставить("270 60 25", Новый Цвет(12, 14, 191));
    Соответствие.Вставить("270 60 30", Новый Цвет(12, 14, 201));
    Соответствие.Вставить("270 60 35", Новый Цвет(11, 14, 208));
    Соответствие.Вставить("270 70 10", Новый Цвет(16, 17, 195));
    Соответствие.Вставить("270 70 15", Новый Цвет(16, 17, 202));
    Соответствие.Вставить("270 70 20", Новый Цвет(16, 17, 213));
    Соответствие.Вставить("270 70 25", Новый Цвет(15, 16, 219));
    Соответствие.Вставить("270 80 10", Новый Цвет(19, 20, 221));
    Соответствие.Вставить("270 80 15", Новый Цвет(19, 20, 228));
    Соответствие.Вставить("270 90 05", Новый Цвет(22, 22, 237));
    Соответствие.Вставить("280 20 15", Новый Цвет(50, 53, 76));
    Соответствие.Вставить("280 20 20", Новый Цвет(49, 52, 81));
    Соответствие.Вставить("280 20 25", Новый Цвет(50, 52, 90));
    Соответствие.Вставить("280 20 30", Новый Цвет(45, 49, 95));
    Соответствие.Вставить("280 30 05", Новый Цвет(72, 75, 83));
    Соответствие.Вставить("280 30 10", Новый Цвет(73, 74, 92));
    Соответствие.Вставить("280 30 15", Новый Цвет(73, 7, 100));
    Соответствие.Вставить("280 30 20", Новый Цвет(69, 7, 106));
    Соответствие.Вставить("280 30 25", Новый Цвет(68, 7, 114));
    Соответствие.Вставить("280 30 30", Новый Цвет(64, 6, 120));
    Соответствие.Вставить("280 30 35", Новый Цвет(62, 6, 126));
    Соответствие.Вставить("280 30 40", Новый Цвет(60, 6, 133));
    Соответствие.Вставить("280 40 05", Новый Цвет(95, 9, 106));
    Соответствие.Вставить("280 40 10", Новый Цвет(93, 9, 113));
    Соответствие.Вставить("280 40 15", Новый Цвет(92, 9, 120));
    Соответствие.Вставить("280 40 20", Новый Цвет(90, 9, 129));
    Соответствие.Вставить("280 40 25", Новый Цвет(91, 9, 139));
    Соответствие.Вставить("280 40 30", Новый Цвет(87, 9, 143));
    Соответствие.Вставить("280 40 35", Новый Цвет(84, 8, 151));
    Соответствие.Вставить("280 40 40", Новый Цвет(79, 8, 160));
    Соответствие.Вставить("280 40 45", Новый Цвет(75, 8, 169));
    Соответствие.Вставить("280 50 05", Новый Цвет(11, 12, 130));
    Соответствие.Вставить("280 50 10", Новый Цвет(11, 11, 138));
    Соответствие.Вставить("280 50 15", Новый Цвет(11, 11, 146));
    Соответствие.Вставить("280 50 20", Новый Цвет(11, 11, 156));
    Соответствие.Вставить("280 50 25", Новый Цвет(11, 11, 163));
    Соответствие.Вставить("280 50 30", Новый Цвет(11, 11, 171));
    Соответствие.Вставить("280 50 35", Новый Цвет(10, 11, 178));
    Соответствие.Вставить("280 50 40", Новый Цвет(10, 11, 189));
    Соответствие.Вставить("280 60 05", Новый Цвет(14, 14, 156));
    Соответствие.Вставить("280 60 10", Новый Цвет(14, 14, 164));
    Соответствие.Вставить("280 60 15", Новый Цвет(14, 14, 172));
    Соответствие.Вставить("280 60 20", Новый Цвет(14, 14, 181));
    Соответствие.Вставить("280 60 25", Новый Цвет(14, 14, 190));
    Соответствие.Вставить("280 60 30", Новый Цвет(13, 13, 196));
    Соответствие.Вставить("280 60 35", Новый Цвет(13, 13, 207));
    Соответствие.Вставить("280 70 05", Новый Цвет(17, 17, 180));
    Соответствие.Вставить("280 70 10", Новый Цвет(17, 17, 191));
    Соответствие.Вставить("280 70 15", Новый Цвет(17, 17, 200));
    Соответствие.Вставить("280 70 20", Новый Цвет(16, 16, 209));
    Соответствие.Вставить("280 70 25", Новый Цвет(16, 16, 218));
    Соответствие.Вставить("280 80 05", Новый Цвет(20, 20, 211));
    Соответствие.Вставить("280 80 10", Новый Цвет(19, 20, 218));
    Соответствие.Вставить("280 80 15", Новый Цвет(19, 19, 225));
    Соответствие.Вставить("280 90 05", Новый Цвет(22, 22, 235));
    Соответствие.Вставить("290 20 10", Новый Цвет(52, 52, 69));
    Соответствие.Вставить("290 20 20", Новый Цвет(58, 52, 82));
    Соответствие.Вставить("290 20 25", Новый Цвет(57, 51, 90));
    Соответствие.Вставить("290 20 30", Новый Цвет(53, 48, 95));
    Соответствие.Вставить("290 20 35", Новый Цвет(55, 4, 101));
    Соответствие.Вставить("290 30 15", Новый Цвет(75, 71, 96));
    Соответствие.Вставить("290 30 20", Новый Цвет(77, 6, 104));
    Соответствие.Вставить("290 30 25", Новый Цвет(76, 6, 111));
    Соответствие.Вставить("290 30 30", Новый Цвет(76, 6, 120));
    Соответствие.Вставить("290 30 35", Новый Цвет(76, 6, 127));
    Соответствие.Вставить("290 30 40", Новый Цвет(76, 6, 135));
    Соответствие.Вставить("290 40 10", Новый Цвет(98, 9, 115));
    Соответствие.Вставить("290 40 15", Новый Цвет(100, 9, 120));
    Соответствие.Вставить("290 40 20", Новый Цвет(99, 9, 129));
    Соответствие.Вставить("290 40 25", Новый Цвет(98, 8, 136));
    Соответствие.Вставить("290 40 30", Новый Цвет(98, 8, 143));
    Соответствие.Вставить("290 40 35", Новый Цвет(97, 8, 149));
    Соответствие.Вставить("290 40 40", Новый Цвет(97, 8, 159));
    Соответствие.Вставить("290 40 45", Новый Цвет(95, 8, 164));
    Соответствие.Вставить("290 50 10", Новый Цвет(12, 11, 139));
    Соответствие.Вставить("290 50 15", Новый Цвет(12, 11, 143));
    Соответствие.Вставить("290 50 20", Новый Цвет(12, 11, 154));
    Соответствие.Вставить("290 50 25", Новый Цвет(12, 11, 161));
    Соответствие.Вставить("290 50 30", Новый Цвет(12, 10, 168));
    Соответствие.Вставить("290 50 35", Новый Цвет(12, 10, 176));
    Соответствие.Вставить("290 50 40", Новый Цвет(12, 10, 184));
    Соответствие.Вставить("290 60 10", Новый Цвет(14, 14, 165));
    Соответствие.Вставить("290 60 15", Новый Цвет(14, 14, 173));
    Соответствие.Вставить("290 60 20", Новый Цвет(15, 13, 181));
    Соответствие.Вставить("290 60 25", Новый Цвет(14, 13, 188));
    Соответствие.Вставить("290 60 30", Новый Цвет(14, 13, 196));
    Соответствие.Вставить("290 60 35", Новый Цвет(14, 13, 202));
    Соответствие.Вставить("290 70 10", Новый Цвет(17, 17, 192));
    Соответствие.Вставить("290 70 15", Новый Цвет(17, 16, 201));
    Соответствие.Вставить("290 70 20", Новый Цвет(17, 16, 207));
    Соответствие.Вставить("290 70 25", Новый Цвет(17, 16, 216));
    Соответствие.Вставить("290 80 10", Новый Цвет(20, 19, 217));
    Соответствие.Вставить("290 80 15", Новый Цвет(20, 19, 224));
    Соответствие.Вставить("290 90 05", Новый Цвет(22, 22, 236));
    Соответствие.Вставить("290 92 05", Новый Цвет(23, 23, 244));
    Соответствие.Вставить("300 20 05", Новый Цвет(56, 54, 62));
    Соответствие.Вставить("300 20 15", Новый Цвет(61, 51, 74));
    Соответствие.Вставить("300 20 20", Новый Цвет(62, 48, 78));
    Соответствие.Вставить("300 20 25", Новый Цвет(61, 48, 83));
    Соответствие.Вставить("300 20 30", Новый Цвет(60, 44, 92));
    Соответствие.Вставить("300 30 05", Новый Цвет(76, 73, 81));
    Соответствие.Вставить("300 30 10", Новый Цвет(80, 72, 90));
    Соответствие.Вставить("300 30 15", Новый Цвет(81, 69, 95));
    Соответствие.Вставить("300 30 20", Новый Цвет(82, 6, 100));
    Соответствие.Вставить("300 30 25", Новый Цвет(85, 6, 110));
    Соответствие.Вставить("300 30 30", Новый Цвет(86, 6, 115));
    Соответствие.Вставить("300 30 35", Новый Цвет(87, 6, 121));
    Соответствие.Вставить("300 30 40", Новый Цвет(86, 5, 127));
    Соответствие.Вставить("300 40 05", Новый Цвет(99, 9, 105));
    Соответствие.Вставить("300 40 10", Новый Цвет(101, 9, 112));
    Соответствие.Вставить("300 40 15", Новый Цвет(104, 9, 118));
    Соответствие.Вставить("300 40 20", Новый Цвет(106, 8, 126));
    Соответствие.Вставить("300 40 25", Новый Цвет(109, 8, 132));
    Соответствие.Вставить("300 40 30", Новый Цвет(110, 8, 139));
    Соответствие.Вставить("300 40 35", Новый Цвет(109, 8, 143));
    Соответствие.Вставить("300 40 40", Новый Цвет(110, 7, 150));
    Соответствие.Вставить("300 40 45", Новый Цвет(112, 7, 160));
    Соответствие.Вставить("300 50 05", Новый Цвет(12, 11, 128));
    Соответствие.Вставить("300 50 10", Новый Цвет(12, 11, 136));
    Соответствие.Вставить("300 50 15", Новый Цвет(12, 11, 144));
    Соответствие.Вставить("300 50 20", Новый Цвет(13, 11, 150));
    Соответствие.Вставить("300 50 25", Новый Цвет(13, 10, 157));
    Соответствие.Вставить("300 50 30", Новый Цвет(13, 10, 164));
    Соответствие.Вставить("300 50 35", Новый Цвет(13, 10, 173));
    Соответствие.Вставить("300 50 40", Новый Цвет(13, 10, 179));
    Соответствие.Вставить("300 60 05", Новый Цвет(14, 14, 157));
    Соответствие.Вставить("300 60 10", Новый Цвет(15, 14, 163));
    Соответствие.Вставить("300 60 15", Новый Цвет(15, 13, 171));
    Соответствие.Вставить("300 60 20", Новый Цвет(15, 13, 177));
    Соответствие.Вставить("300 60 25", Новый Цвет(15, 13, 185));
    Соответствие.Вставить("300 60 30", Новый Цвет(16, 13, 192));
    Соответствие.Вставить("300 60 35", Новый Цвет(16, 12, 198));
    Соответствие.Вставить("300 70 05", Новый Цвет(17, 17, 182));
    Соответствие.Вставить("300 70 10", Новый Цвет(18, 16, 189));
    Соответствие.Вставить("300 70 15", Новый Цвет(18, 16, 197));
    Соответствие.Вставить("300 70 20", Новый Цвет(18, 16, 205));
    Соответствие.Вставить("300 70 25", Новый Цвет(18, 15, 212));
    Соответствие.Вставить("300 80 05", Новый Цвет(20, 19, 209));
    Соответствие.Вставить("300 80 10", Новый Цвет(20, 19, 217));
    Соответствие.Вставить("300 80 15", Новый Цвет(20, 19, 225));
    Соответствие.Вставить("300 90 05", Новый Цвет(23, 22, 235));
    Соответствие.Вставить("310 20 20", Новый Цвет(65, 48, 76));
    Соответствие.Вставить("310 20 25", Новый Цвет(71, 45, 82));
    Соответствие.Вставить("310 20 30", Новый Цвет(68, 38, 87));
    Соответствие.Вставить("310 30 15", Новый Цвет(87, 71, 95));
    Соответствие.Вставить("310 30 20", Новый Цвет(89, 6, 102));
    Соответствие.Вставить("310 30 25", Новый Цвет(92, 6, 105));
    Соответствие.Вставить("310 30 30", Новый Цвет(96, 5, 110));
    Соответствие.Вставить("310 30 35", Новый Цвет(96, 5, 113));
    Соответствие.Вставить("310 30 40", Новый Цвет(99, 5, 120));
    Соответствие.Вставить("310 40 10", Новый Цвет(106, 9, 112));
    Соответствие.Вставить("310 40 15", Новый Цвет(110, 9, 119));
    Соответствие.Вставить("310 40 20", Новый Цвет(115, 8, 124));
    Соответствие.Вставить("310 40 25", Новый Цвет(118, 8, 130));
    Соответствие.Вставить("310 40 30", Новый Цвет(118, 8, 134));
    Соответствие.Вставить("310 40 35", Новый Цвет(121, 8, 140));
    Соответствие.Вставить("310 40 40", Новый Цвет(124, 7, 146));
    Соответствие.Вставить("310 50 10", Новый Цвет(13, 11, 137));
    Соответствие.Вставить("310 50 15", Новый Цвет(13, 11, 142));
    Соответствие.Вставить("310 50 20", Новый Цвет(13, 11, 147));
    Соответствие.Вставить("310 50 25", Новый Цвет(14, 10, 155));
    Соответствие.Вставить("310 50 30", Новый Цвет(14, 10, 161));
    Соответствие.Вставить("310 50 35", Новый Цвет(14, 10, 164));
    Соответствие.Вставить("310 50 40", Новый Цвет(14, 10, 172));
    Соответствие.Вставить("310 60 10", Новый Цвет(15, 14, 161));
    Соответствие.Вставить("310 60 15", Новый Цвет(16, 13, 167));
    Соответствие.Вставить("310 60 20", Новый Цвет(16, 13, 175));
    Соответствие.Вставить("310 60 25", Новый Цвет(16, 13, 180));
    Соответствие.Вставить("310 60 30", Новый Цвет(17, 12, 184));
    Соответствие.Вставить("310 60 35", Новый Цвет(17, 12, 194));
    Соответствие.Вставить("310 70 10", Новый Цвет(18, 16, 185));
    Соответствие.Вставить("310 70 15", Новый Цвет(18, 16, 195));
    Соответствие.Вставить("310 70 20", Новый Цвет(19, 16, 199));
    Соответствие.Вставить("310 70 25", Новый Цвет(19, 15, 206));
    Соответствие.Вставить("310 80 10", Новый Цвет(20, 19, 214));
    Соответствие.Вставить("310 80 15", Новый Цвет(21, 19, 219));
    Соответствие.Вставить("310 90 05", Новый Цвет(23, 22, 234));
    Соответствие.Вставить("320 20 10", Новый Цвет(64, 53, 66));
    Соответствие.Вставить("320 20 15", Новый Цвет(68, 50, 71));
    Соответствие.Вставить("320 20 20", Новый Цвет(72, 45, 73));
    Соответствие.Вставить("320 20 25", Новый Цвет(72, 41, 77));
    Соответствие.Вставить("320 30 05", Новый Цвет(78, 72, 81));
    Соответствие.Вставить("320 30 10", Новый Цвет(84, 70, 85));
    Соответствие.Вставить("320 30 15", Новый Цвет(87, 64, 89));
    Соответствие.Вставить("320 30 20", Новый Цвет(94, 62, 94));
    Соответствие.Вставить("320 30 25", Новый Цвет(100, 6, 101));
    Соответствие.Вставить("320 30 30", Новый Цвет(101, 5, 105));
    Соответствие.Вставить("320 30 35", Новый Цвет(104, 5, 110));
    Соответствие.Вставить("320 30 37", Новый Цвет(109, 5, 114));
    Соответствие.Вставить("320 40 05", Новый Цвет(101, 9, 104));
    Соответствие.Вставить("320 40 10", Новый Цвет(108, 9, 110));
    Соответствие.Вставить("320 40 15", Новый Цвет(113, 9, 115));
    Соответствие.Вставить("320 40 20", Новый Цвет(117, 8, 118));
    Соответствие.Вставить("320 40 25", Новый Цвет(120, 8, 124));
    Соответствие.Вставить("320 40 30", Новый Цвет(126, 7, 126));
    Соответствие.Вставить("320 40 35", Новый Цвет(131, 7, 131));
    Соответствие.Вставить("320 40 40", Новый Цвет(133, 6, 139));
    Соответствие.Вставить("320 50 05", Новый Цвет(12, 11, 126));
    Соответствие.Вставить("320 50 10", Новый Цвет(13, 11, 133));
    Соответствие.Вставить("320 50 15", Новый Цвет(13, 11, 138));
    Соответствие.Вставить("320 50 20", Новый Цвет(14, 10, 143));
    Соответствие.Вставить("320 50 25", Новый Цвет(14, 10, 149));
    Соответствие.Вставить("320 50 30", Новый Цвет(15, 10, 154));
    Соответствие.Вставить("320 50 35", Новый Цвет(156, 9, 158));
    Соответствие.Вставить("320 50 40", Новый Цвет(159, 9, 164));
    Соответствие.Вставить("320 60 05", Новый Цвет(15, 14, 154));
    Соответствие.Вставить("320 60 10", Новый Цвет(15, 14, 159));
    Соответствие.Вставить("320 60 15", Новый Цвет(16, 13, 165));
    Соответствие.Вставить("320 60 20", Новый Цвет(17, 13, 169));
    Соответствие.Вставить("320 60 25", Новый Цвет(17, 12, 176));
    Соответствие.Вставить("320 60 30", Новый Цвет(18, 12, 181));
    Соответствие.Вставить("320 60 35", Новый Цвет(18, 12, 185));
    Соответствие.Вставить("320 70 05", Новый Цвет(17, 16, 178));
    Соответствие.Вставить("320 70 10", Новый Цвет(18, 16, 185));
    Соответствие.Вставить("320 70 15", Новый Цвет(18, 16, 192));
    Соответствие.Вставить("320 70 20", Новый Цвет(19, 15, 197));
    Соответствие.Вставить("320 70 25", Новый Цвет(20, 15, 203));
    Соответствие.Вставить("320 80 05", Новый Цвет(20, 19, 205));
    Соответствие.Вставить("320 80 10", Новый Цвет(21, 19, 213));
    Соответствие.Вставить("320 80 15", Новый Цвет(21, 18, 216));
    Соответствие.Вставить("320 90 05", Новый Цвет(23, 22, 234));
    Соответствие.Вставить("330 20 20", Новый Цвет(74, 43, 68));
    Соответствие.Вставить("330 20 25", Новый Цвет(82, 41, 74));
    Соответствие.Вставить("330 30 15", Новый Цвет(92, 67, 87));
    Соответствие.Вставить("330 30 20", Новый Цвет(98, 64, 90));
    Соответствие.Вставить("330 30 25", Новый Цвет(103, 59, 95));
    Соответствие.Вставить("330 30 30", Новый Цвет(109, 54, 97));
    Соответствие.Вставить("330 30 35", Новый Цвет(113, 5, 102));
    Соответствие.Вставить("330 30 40", Новый Цвет(118, 4, 103));
    Соответствие.Вставить("330 40 10", Новый Цвет(111, 9, 107));
    Соответствие.Вставить("330 40 15", Новый Цвет(116, 8, 111));
    Соответствие.Вставить("330 40 20", Новый Цвет(122, 8, 116));
    Соответствие.Вставить("330 40 25", Новый Цвет(128, 8, 118));
    Соответствие.Вставить("330 40 30", Новый Цвет(136, 7, 124));
    Соответствие.Вставить("330 40 35", Новый Цвет(141, 7, 127));
    Соответствие.Вставить("330 40 40", Новый Цвет(144, 6, 129));
    Соответствие.Вставить("330 40 45", Новый Цвет(147, 6, 131));
    Соответствие.Вставить("330 50 10", Новый Цвет(13, 11, 130));
    Соответствие.Вставить("330 50 15", Новый Цвет(14, 11, 136));
    Соответствие.Вставить("330 50 20", Новый Цвет(14, 10, 140));
    Соответствие.Вставить("330 50 25", Новый Цвет(15, 10, 142));
    Соответствие.Вставить("330 50 30", Новый Цвет(16, 10, 149));
    Соответствие.Вставить("330 50 35", Новый Цвет(164, 9, 152));
    Соответствие.Вставить("330 50 40", Новый Цвет(172, 9, 154));
    Соответствие.Вставить("330 60 10", Новый Цвет(16, 14, 156));
    Соответствие.Вставить("330 60 15", Новый Цвет(17, 13, 163));
    Соответствие.Вставить("330 60 20", Новый Цвет(17, 13, 166));
    Соответствие.Вставить("330 60 25", Новый Цвет(18, 12, 168));
    Соответствие.Вставить("330 60 30", Новый Цвет(18, 12, 174));
    Соответствие.Вставить("330 60 35", Новый Цвет(19, 11, 177));
    Соответствие.Вставить("330 60 40", Новый Цвет(19, 11, 182));
    Соответствие.Вставить("330 70 10", Новый Цвет(18, 16, 185));
    Соответствие.Вставить("330 70 15", Новый Цвет(19, 16, 187));
    Соответствие.Вставить("330 70 20", Новый Цвет(20, 15, 191));
    Соответствие.Вставить("330 70 25", Новый Цвет(21, 15, 196));
    Соответствие.Вставить("330 70 30", Новый Цвет(21, 15, 198));
    Соответствие.Вставить("330 80 10", Новый Цвет(21, 19, 209));
    Соответствие.Вставить("330 80 15", Новый Цвет(22, 19, 215));
    Соответствие.Вставить("330 80 20", Новый Цвет(23, 18, 218));
    Соответствие.Вставить("330 90 05", Новый Цвет(23, 22, 232));
    Соответствие.Вставить("340 20 05", Новый Цвет(59, 53, 59));
    Соответствие.Вставить("340 20 15", Новый Цвет(73, 48, 63));
    Соответствие.Вставить("340 20 20", Новый Цвет(79, 46, 67));
    Соответствие.Вставить("340 20 25", Новый Цвет(85, 42, 69));
    Соответствие.Вставить("340 30 05", Новый Цвет(80, 72, 79));
    Соответствие.Вставить("340 30 10", Новый Цвет(88, 68, 80));
    Соответствие.Вставить("340 30 15", Новый Цвет(96, 68, 85));
    Соответствие.Вставить("340 30 20", Новый Цвет(102, 64, 87));
    Соответствие.Вставить("340 30 25", Новый Цвет(108, 59, 90));
    Соответствие.Вставить("340 30 30", Новый Цвет(112, 53, 90));
    Соответствие.Вставить("340 30 35", Новый Цвет(118, 47, 93));
    Соответствие.Вставить("340 30 38", Новый Цвет(120, 43, 94));
    Соответствие.Вставить("340 40 05", Новый Цвет(102, 9, 100));
    Соответствие.Вставить("340 40 10", Новый Цвет(113, 9, 103));
    Соответствие.Вставить("340 40 15", Новый Цвет(119, 8, 106));
    Соответствие.Вставить("340 40 20", Новый Цвет(128, 8, 109));
    Соответствие.Вставить("340 40 25", Новый Цвет(132, 7, 112));
    Соответствие.Вставить("340 40 30", Новый Цвет(140, 7, 115));
    Соответствие.Вставить("340 40 35", Новый Цвет(142, 6, 116));
    Соответствие.Вставить("340 40 40", Новый Цвет(147, 6, 117));
    Соответствие.Вставить("340 40 45", Новый Цвет(157, 5, 121));
    Соответствие.Вставить("340 50 05", Новый Цвет(12, 11, 125));
    Соответствие.Вставить("340 50 10", Новый Цвет(13, 11, 128));
    Соответствие.Вставить("340 50 15", Новый Цвет(14, 11, 131));
    Соответствие.Вставить("340 50 20", Новый Цвет(15, 10, 134));
    Соответствие.Вставить("340 50 25", Новый Цвет(15, 10, 137));
    Соответствие.Вставить("340 50 30", Новый Цвет(166, 9, 138));
    Соответствие.Вставить("340 50 35", Новый Цвет(171, 9, 143));
    Соответствие.Вставить("340 50 40", Новый Цвет(180, 8, 145));
    Соответствие.Вставить("340 50 45", Новый Цвет(186, 7, 146));
    Соответствие.Вставить("340 60 05", Новый Цвет(15, 14, 150));
    Соответствие.Вставить("340 60 10", Новый Цвет(16, 14, 155));
    Соответствие.Вставить("340 60 15", Новый Цвет(17, 13, 158));
    Соответствие.Вставить("340 60 20", Новый Цвет(18, 13, 160));
    Соответствие.Вставить("340 60 25", Новый Цвет(18, 12, 163));
    Соответствие.Вставить("340 60 30", Новый Цвет(19, 12, 167));
    Соответствие.Вставить("340 60 35", Новый Цвет(20, 11, 168));
    Соответствие.Вставить("340 60 40", Новый Цвет(20, 11, 171));
    Соответствие.Вставить("340 70 05", Новый Цвет(18, 16, 177));
    Соответствие.Вставить("340 70 10", Новый Цвет(19, 16, 181));
    Соответствие.Вставить("340 70 15", Новый Цвет(20, 16, 185));
    Соответствие.Вставить("340 70 20", Новый Цвет(20, 15, 185));
    Соответствие.Вставить("340 70 25", Новый Цвет(21, 15, 188));
    Соответствие.Вставить("340 70 30", Новый Цвет(22, 14, 194));
    Соответствие.Вставить("340 70 35", Новый Цвет(23, 14, 195));
    Соответствие.Вставить("340 80 05", Новый Цвет(20, 19, 201));
    Соответствие.Вставить("340 80 10", Новый Цвет(22, 19, 209));
    Соответствие.Вставить("340 80 15", Новый Цвет(22, 18, 209));
    Соответствие.Вставить("340 80 20", Новый Цвет(23, 18, 214));
    Соответствие.Вставить("340 90 05", Новый Цвет(23, 22, 231));
    Соответствие.Вставить("340 92 05", Новый Цвет(24, 23, 237));
    Соответствие.Вставить("350 20 10", Новый Цвет(69, 53, 62));
    Соответствие.Вставить("350 20 20", Новый Цвет(82, 45, 63));
    Соответствие.Вставить("350 20 25", Новый Цвет(86, 41, 62));
    Соответствие.Вставить("350 20 30", Новый Цвет(96, 38, 67));
    Соответствие.Вставить("350 30 15", Новый Цвет(97, 67, 80));
    Соответствие.Вставить("350 30 20", Новый Цвет(106, 64, 84));
    Соответствие.Вставить("350 30 25", Новый Цвет(114, 61, 86));
    Соответствие.Вставить("350 30 30", Новый Цвет(118, 57, 86));
    Соответствие.Вставить("350 30 35", Новый Цвет(123, 50, 86));
    Соответствие.Вставить("350 30 40", Новый Цвет(127, 44, 87));
    Соответствие.Вставить("350 40 10", Новый Цвет(116, 9, 105));
    Соответствие.Вставить("350 40 15", Новый Цвет(121, 8, 102));
    Соответствие.Вставить("350 40 20", Новый Цвет(130, 8, 105));
    Соответствие.Вставить("350 40 25", Новый Цвет(135, 8, 106));
    Соответствие.Вставить("350 40 30", Новый Цвет(143, 7, 106));
    Соответствие.Вставить("350 40 35", Новый Цвет(148, 6, 109));
    Соответствие.Вставить("350 40 40", Новый Цвет(154, 6, 109));
    Соответствие.Вставить("350 40 45", Новый Цвет(159, 5, 110));
    Соответствие.Вставить("350 40 50", Новый Цвет(166, 4, 109));
    Соответствие.Вставить("350 50 10", Новый Цвет(13, 11, 126));
    Соответствие.Вставить("350 50 15", Новый Цвет(14, 11, 126));
    Соответствие.Вставить("350 50 20", Новый Цвет(15, 10, 130));
    Соответствие.Вставить("350 50 25", Новый Цвет(16, 10, 130));
    Соответствие.Вставить("350 50 30", Новый Цвет(170, 9, 132));
    Соответствие.Вставить("350 50 35", Новый Цвет(178, 9, 131));
    Соответствие.Вставить("350 50 40", Новый Цвет(185, 8, 133));
    Соответствие.Вставить("350 50 45", Новый Цвет(192, 8, 135));
    Соответствие.Вставить("350 50 50", Новый Цвет(200, 7, 135));
    Соответствие.Вставить("350 60 10", Новый Цвет(16, 14, 152));
    Соответствие.Вставить("350 60 15", Новый Цвет(17, 13, 154));
    Соответствие.Вставить("350 60 20", Новый Цвет(18, 13, 155));
    Соответствие.Вставить("350 60 25", Новый Цвет(19, 12, 154));
    Соответствие.Вставить("350 60 30", Новый Цвет(20, 12, 158));
    Соответствие.Вставить("350 60 35", Новый Цвет(20, 11, 160));
    Соответствие.Вставить("350 60 40", Новый Цвет(21, 11, 161));
    Соответствие.Вставить("350 60 45", Новый Цвет(22, 11, 163));
    Соответствие.Вставить("350 70 10", Новый Цвет(19, 16, 176));
    Соответствие.Вставить("350 70 15", Новый Цвет(20, 16, 178));
    Соответствие.Вставить("350 70 20", Новый Цвет(21, 15, 181));
    Соответствие.Вставить("350 70 25", Новый Цвет(22, 15, 183));
    Соответствие.Вставить("350 70 30", Новый Цвет(23, 14, 183));
    Соответствие.Вставить("350 70 35", Новый Цвет(23, 14, 185));
    Соответствие.Вставить("350 80 10", Новый Цвет(21, 19, 203));
    Соответствие.Вставить("350 80 15", Новый Цвет(22, 19, 206));
    Соответствие.Вставить("350 80 20", Новый Цвет(23, 18, 207));
    Соответствие.Вставить("350 90 05", Новый Цвет(23, 22, 229));
    Соответствие.Вставить("360 20 15", Новый Цвет(76, 46, 55));
    Соответствие.Вставить("360 30 05", Новый Цвет(81, 72, 76));
    Соответствие.Вставить("360 30 10", Новый Цвет(92, 72, 80));
    Соответствие.Вставить("360 30 15", Новый Цвет(98, 65, 76));
    Соответствие.Вставить("360 30 20", Новый Цвет(105, 62, 77));
    Соответствие.Вставить("360 30 25", Новый Цвет(110, 58, 76));
    Соответствие.Вставить("360 30 30", Новый Цвет(117, 51, 76));
    Соответствие.Вставить("360 30 35", Новый Цвет(125, 47, 76));
    Соответствие.Вставить("360 30 40", Новый Цвет(128, 43, 76));
    Соответствие.Вставить("360 40 05", Новый Цвет(104, 95, 98));
    Соответствие.Вставить("360 40 10", Новый Цвет(113, 9, 101));
    Соответствие.Вставить("360 40 15", Новый Цвет(121, 87, 98));
    Соответствие.Вставить("360 40 20", Новый Цвет(130, 8, 100));
    Соответствие.Вставить("360 40 25", Новый Цвет(137, 79, 99));
    Соответствие.Вставить("360 40 30", Новый Цвет(146, 7, 100));
    Соответствие.Вставить("360 40 35", Новый Цвет(152, 68, 99));
    Соответствие.Вставить("360 40 40", Новый Цвет(160, 6, 101));
    Соответствие.Вставить("360 40 45", Новый Цвет(163, 56, 98));
    Соответствие.Вставить("360 40 50", Новый Цвет(171, 46, 98));
    Соответствие.Вставить("360 50 05", Новый Цвет(13, 11, 124));
    Соответствие.Вставить("360 50 10", Новый Цвет(14, 11, 123));
    Соответствие.Вставить("360 50 15", Новый Цвет(14, 11, 122));
    Соответствие.Вставить("360 50 20", Новый Цвет(15, 10, 123));
    Соответствие.Вставить("360 50 25", Новый Цвет(16, 10, 124));
    Соответствие.Вставить("360 50 30", Новый Цвет(173, 9, 124));
    Соответствие.Вставить("360 50 35", Новый Цвет(181, 9, 124));
    Соответствие.Вставить("360 50 40", Новый Цвет(190, 8, 122));
    Соответствие.Вставить("360 50 45", Новый Цвет(196, 7, 123));
    Соответствие.Вставить("360 50 50", Новый Цвет(201, 7, 121));
    Соответствие.Вставить("360 60 05", Новый Цвет(15, 14, 149));
    Соответствие.Вставить("360 60 10", Новый Цвет(16, 14, 148));
    Соответствие.Вставить("360 60 15", Новый Цвет(17, 13, 149));
    Соответствие.Вставить("360 60 20", Новый Цвет(18, 13, 150));
    Соответствие.Вставить("360 60 25", Новый Цвет(19, 12, 150));
    Соответствие.Вставить("360 70 05", Новый Цвет(18, 17, 176));
    Соответствие.Вставить("360 70 10", Новый Цвет(19, 16, 174));
    Соответствие.Вставить("360 70 15", Новый Цвет(20, 16, 175));
    Соответствие.Вставить("360 80 05", Новый Цвет(21, 20, 202));
    Соответствие.Вставить("360 80 10", Новый Цвет(22, 19, 201));
    Соответствие.Вставить("360 90 05", Новый Цвет(24, 22, 226));
    Соответствие.Вставить("360 92 05", Новый Цвет(24, 23, 236));    
    
    Возврат Соответствие;
		
КонецФункции

// Возвращает таблицу Web-цветов, которые могут использоваться в CSS с абсолютными цветами.
// Таблица цветов взята на сайте http://www.cloford.com/resources/colours/namedcol.htm
//
// Возвращаемое значение:
//	Соответствие - Соответствие с цветами.
//
Функция КаталогCSSЦветов() Экспорт
	
	Соответствие = Новый Соответствие;

	Соответствие.Вставить("aliceblue", 			Новый Цвет(240, 248, 255));
	Соответствие.Вставить("antiquewhite", 		Новый Цвет(250, 235, 215));
	Соответствие.Вставить("aqua", 				Новый Цвет(0, 255, 255));
	Соответствие.Вставить("aquamarine", 		Новый Цвет(127, 255, 212));
	Соответствие.Вставить("azure", 				Новый Цвет(240, 255, 255));
	Соответствие.Вставить("beige", 				Новый Цвет(245, 245, 220));
	Соответствие.Вставить("bisque", 			Новый Цвет(255, 228, 196));
	Соответствие.Вставить("black", 				Новый Цвет(0, 0, 0));
	Соответствие.Вставить("blanchedalmond", 	Новый Цвет(255, 235, 205));
	Соответствие.Вставить("blue", 				Новый Цвет(0, 0, 255));
	Соответствие.Вставить("blueviolet", 		Новый Цвет(138, 43, 226));
	Соответствие.Вставить("brown", 				Новый Цвет(165, 42, 42));
	Соответствие.Вставить("burlywood", 			Новый Цвет(222, 184, 135));
	Соответствие.Вставить("cadetblue", 			Новый Цвет(95, 158, 160));
	Соответствие.Вставить("chartreuse", 		Новый Цвет(127, 255, 0));
	Соответствие.Вставить("chocolate", 			Новый Цвет(210, 105, 30));
	Соответствие.Вставить("coral", 				Новый Цвет(255, 127, 80));
	Соответствие.Вставить("cornflowerblue", 	Новый Цвет(100, 149, 237));
	Соответствие.Вставить("cornsilk", 			Новый Цвет(255, 248, 220));
	Соответствие.Вставить("crimson", 			Новый Цвет(220, 20, 60));
	Соответствие.Вставить("darkblue", 			Новый Цвет(0, 0, 139));
	Соответствие.Вставить("darkcyan", 			Новый Цвет(0, 139, 139));
	Соответствие.Вставить("darkgoldenrod", 		Новый Цвет(184, 134, 11));
	Соответствие.Вставить("darkgray", 			Новый Цвет(169, 169, 169));
	Соответствие.Вставить("darkgreen", 			Новый Цвет(0, 100, 0));
	Соответствие.Вставить("darkkhaki", 			Новый Цвет(189, 183, 107));
	Соответствие.Вставить("darkmagenta", 		Новый Цвет(139, 0, 139));
	Соответствие.Вставить("darkolivegreen", 	Новый Цвет(85, 107, 47));
	Соответствие.Вставить("darkorange", 		Новый Цвет(255, 140, 0));
	Соответствие.Вставить("darkorchid", 		Новый Цвет(153, 50, 204));
	Соответствие.Вставить("darkred", 			Новый Цвет(139, 0, 0));
	Соответствие.Вставить("darksalmon", 		Новый Цвет(233, 150, 122));
	Соответствие.Вставить("darkseagreen", 		Новый Цвет(143, 188, 143));
	Соответствие.Вставить("darkslateblue", 		Новый Цвет(72, 61, 139));
	Соответствие.Вставить("darkslategray", 		Новый Цвет(47, 79, 79));
	Соответствие.Вставить("darkturquoise", 		Новый Цвет(0, 206, 209));
	Соответствие.Вставить("darkviolet", 		Новый Цвет(148, 0, 211));
	Соответствие.Вставить("deeppink", 			Новый Цвет(255, 20, 147));
	Соответствие.Вставить("deepskyblue", 		Новый Цвет(0, 191, 255));
	Соответствие.Вставить("dimgray", 			Новый Цвет(105, 105, 105));
	Соответствие.Вставить("dodgerblue", 		Новый Цвет(30, 144, 255));
	Соответствие.Вставить("firebrick", 			Новый Цвет(178, 34, 34));
	Соответствие.Вставить("floralwhite", 		Новый Цвет(255, 250, 240));
	Соответствие.Вставить("forestgreen", 		Новый Цвет(34, 139, 34));
	Соответствие.Вставить("fuchsia", 			Новый Цвет(255, 0, 255));
	Соответствие.Вставить("gainsboro", 			Новый Цвет(220, 220, 220));
	Соответствие.Вставить("ghostwhite", 		Новый Цвет(248, 248, 255));
	Соответствие.Вставить("gold", 				Новый Цвет(255, 215, 0));
	Соответствие.Вставить("goldenrod", 			Новый Цвет(218, 165, 32));
	Соответствие.Вставить("gray", 				Новый Цвет(128, 128, 128));
	Соответствие.Вставить("green", 				Новый Цвет(0, 128, 0));
	Соответствие.Вставить("greenyellow", 		Новый Цвет(173, 255, 47));
	Соответствие.Вставить("honeydew", 			Новый Цвет(240, 255, 240));
	Соответствие.Вставить("hotpink", 			Новый Цвет(255, 105, 180));
	Соответствие.Вставить("indianred", 			Новый Цвет(205, 92, 92));
	Соответствие.Вставить("indigo", 			Новый Цвет(75, 0, 130));
	Соответствие.Вставить("ivory", 				Новый Цвет(255, 255, 240));
	Соответствие.Вставить("khaki", 				Новый Цвет(240, 230, 140));
	Соответствие.Вставить("lavender", 			Новый Цвет(230, 230, 250));
	Соответствие.Вставить("lavenderblush", 		Новый Цвет(255, 240, 245));
	Соответствие.Вставить("lawngreen", 			Новый Цвет(124, 252, 0));
	Соответствие.Вставить("lemonchiffon", 		Новый Цвет(255, 250, 205));
	Соответствие.Вставить("lightblue", 			Новый Цвет(173, 216, 230));
	Соответствие.Вставить("lightcoral", 		Новый Цвет(240, 128, 128));
	Соответствие.Вставить("lightcyan", 			Новый Цвет(224, 255, 255));
	Соответствие.Вставить("lightgoldenrodyellow", Новый Цвет(250, 250, 210));
	Соответствие.Вставить("lightgreen", 		Новый Цвет(144, 238, 144));
	Соответствие.Вставить("lightgrey", 			Новый Цвет(211, 211, 211));
	Соответствие.Вставить("lightpink", 			Новый Цвет(255, 182, 193));
	Соответствие.Вставить("lightsalmon", 		Новый Цвет(255, 160, 122));
	Соответствие.Вставить("lightseagreen", 		Новый Цвет(32, 178, 170));
	Соответствие.Вставить("lightskyblue", 		Новый Цвет(135, 206, 250));
	Соответствие.Вставить("lightslategray", 	Новый Цвет(119, 136, 153));
	Соответствие.Вставить("lightsteelblue", 	Новый Цвет(176, 196, 222));
	Соответствие.Вставить("lightyellow", 		Новый Цвет(255, 255, 224));
	Соответствие.Вставить("lime", 				Новый Цвет(0, 255, 0));
	Соответствие.Вставить("limegreen", 			Новый Цвет(50, 205, 50));
	Соответствие.Вставить("linen", 				Новый Цвет(250, 240, 230));
	Соответствие.Вставить("maroon", 			Новый Цвет(128, 0, 0));
	Соответствие.Вставить("mediumaquamarine", 	Новый Цвет(102, 205, 170));
	Соответствие.Вставить("mediumblue", 		Новый Цвет(0, 0, 205));
	Соответствие.Вставить("mediumorchid", 		Новый Цвет(186, 85, 211));
	Соответствие.Вставить("mediumpurple", 		Новый Цвет(147, 112, 219));
	Соответствие.Вставить("mediumseagreen", 	Новый Цвет(60, 179, 113));
	Соответствие.Вставить("mediumslateblue", 	Новый Цвет(123, 104, 238));
	Соответствие.Вставить("mediumspringgreen", 	Новый Цвет(0, 250, 154));
	Соответствие.Вставить("mediumturquoise", 	Новый Цвет(72, 209, 204));
	Соответствие.Вставить("mediumvioletred", 	Новый Цвет(199, 21, 133));
	Соответствие.Вставить("midnightblue", 		Новый Цвет(25, 25, 112));
	Соответствие.Вставить("mintcream", 			Новый Цвет(245, 255, 250));
	Соответствие.Вставить("mistyrose", 			Новый Цвет(255, 228, 225));
	Соответствие.Вставить("moccasin", 			Новый Цвет(255, 228, 181));
	Соответствие.Вставить("navajowhite", 		Новый Цвет(255, 222, 173));
	Соответствие.Вставить("navy", 				Новый Цвет(0, 0, 128));
	Соответствие.Вставить("oldlace", 			Новый Цвет(253, 245, 230));
	Соответствие.Вставить("olive", 				Новый Цвет(128, 128, 0));
	Соответствие.Вставить("olivedrab", 			Новый Цвет(107, 142, 35));
	Соответствие.Вставить("orange", 			Новый Цвет(255, 165, 0));
	Соответствие.Вставить("orangered", 			Новый Цвет(255, 69, 0));
	Соответствие.Вставить("orchid", 			Новый Цвет(218, 112, 214));
	Соответствие.Вставить("palegoldenrod", 		Новый Цвет(238, 232, 170));
	Соответствие.Вставить("palegreen", 			Новый Цвет(152, 251, 152));
	Соответствие.Вставить("paleturquoise", 		Новый Цвет(175, 238, 238));
	Соответствие.Вставить("palevioletred", 		Новый Цвет(219, 112, 147));
	Соответствие.Вставить("papayawhip", 		Новый Цвет(255, 239, 213));
	Соответствие.Вставить("peachpuff", 			Новый Цвет(255, 218, 185));
	Соответствие.Вставить("peru", 				Новый Цвет(205, 133, 63));
	Соответствие.Вставить("pink", 				Новый Цвет(255, 192, 203));
	Соответствие.Вставить("plum", 				Новый Цвет(221, 160, 221));
	Соответствие.Вставить("powderblue", 		Новый Цвет(176, 224, 230));
	Соответствие.Вставить("purple", 			Новый Цвет(128, 0, 128));
	Соответствие.Вставить("red", 				Новый Цвет(255, 0, 0));
	Соответствие.Вставить("rosybrown", 			Новый Цвет(188, 143, 143));
	Соответствие.Вставить("royalblue", 			Новый Цвет(65, 105, 225));
	Соответствие.Вставить("saddlebrown", 		Новый Цвет(139, 69, 19));
	Соответствие.Вставить("salmon", 			Новый Цвет(250, 128, 114));
	Соответствие.Вставить("sandybrown", 		Новый Цвет(244, 164, 96));
	Соответствие.Вставить("seagreen", 			Новый Цвет(46, 139, 87));
	Соответствие.Вставить("seashell", 			Новый Цвет(255, 245, 238));
	Соответствие.Вставить("sienna", 			Новый Цвет(160, 82, 45));
	Соответствие.Вставить("silver", 			Новый Цвет(192, 192, 192));
	Соответствие.Вставить("skyblue", 			Новый Цвет(135, 206, 235));
	Соответствие.Вставить("slateblue", 			Новый Цвет(106, 90, 205));
	Соответствие.Вставить("slategray", 			Новый Цвет(112, 128, 144));
	Соответствие.Вставить("snow", 				Новый Цвет(255, 250, 250));
	Соответствие.Вставить("springgreen", 		Новый Цвет(0, 255, 127));
	Соответствие.Вставить("steelblue", 			Новый Цвет(70, 130, 180));
	Соответствие.Вставить("tan", 				Новый Цвет(210, 180, 140));
	Соответствие.Вставить("teal", 				Новый Цвет(0, 128, 128));
	Соответствие.Вставить("thistle", 			Новый Цвет(216, 191, 216));
	Соответствие.Вставить("tomato", 			Новый Цвет(255, 99, 71));
	Соответствие.Вставить("turquoise", 			Новый Цвет(64, 224, 208));
	Соответствие.Вставить("violet", 			Новый Цвет(238, 130, 238));
	Соответствие.Вставить("wheat", 				Новый Цвет(245, 222, 179));
	Соответствие.Вставить("white", 				Новый Цвет(255, 255, 255));
	Соответствие.Вставить("whitesmoke", 		Новый Цвет(245, 245, 245));
	Соответствие.Вставить("yellow", 			Новый Цвет(255, 255, 0));
	Соответствие.Вставить("yellowgreen", 		Новый Цвет(154, 205, 50));	
	
	Возврат Соответствие;
	
КонецФункции

#КонецОбласти

#Область СлучайныеЦвета

// Создает и возвращает случайный цвет.
//
// Параметры:
//	Нет.
//
// Возвращаемое значение:
//	Цвет - случайный цвет.
//
Функция СлучайныйЦвет() Экспорт
		
	Красный = СлучайноеЧисло(0, 255);
	Зеленый = СлучайноеЧисло(0, 255);
	Синий 	= СлучайноеЧисло(0, 255);

	Возврат Новый Цвет(Красный, Зеленый, Синий);
	
КонецФункции

// Создает и возвращает случайный светлый цвет.
//
// Параметры:
//	Нет.
//
// Возвращаемое значение:
//	Цвет - случайный светлый цвет.
//
Функция СлучайныйСветлыйЦвет() Экспорт
		
	Красный = СлучайноеЧисло(200, 255);
	Зеленый = СлучайноеЧисло(200, 255);
	Синий 	= СлучайноеЧисло(200, 255);

	Возврат Новый Цвет(Красный, Зеленый, Синий);
	
КонецФункции

// Создает и возвращает случайный темный цвет.
//
// Параметры:
//	Нет.
//
// Возвращаемое значение:
//	Цвет - случайный темный цвет.
//
Функция СлучайныйТемныйЦвет() Экспорт
		
	Красный = СлучайноеЧисло(0, 128);
	Зеленый = СлучайноеЧисло(0, 128);
	Синий 	= СлучайноеЧисло(0, 128);

	Возврат Новый Цвет(Красный, Зеленый, Синий);
	
КонецФункции

// Создает и возвращает случайный цвет из каталога RAL Standart.
//
// Параметры:
//	Нет.
//
// Возвращаемое значение:
//	Цвет - случайный цвет из каталога RAL Standart.
//
Функция СлучайныйЦветRALStandart() Экспорт
    
    Соответствие = КаталогRALStandart();
    Массив = Новый Массив;
    Для Каждого КЗ Из Соответствие Цикл
        Массив.Добавить(КЗ.Значение);
    КонецЦикла;
    
    Индекс  = СлучайноеЧисло(0, Массив.Количество() - 1);
    
    Возврат Массив[Индекс];
              
КонецФункции

// Создает и возвращает случайный цвет из системной переменной WebЦвета.
//
// Параметры:
//	Нет.
//
// Возвращаемое значение:
//	Цвет - случайный цвет из каталога RAL Standart.
//
Функция СлучайныйWebЦвет() Экспорт
    
    Соответствие = КаталогWebЦветов();
    Массив = Новый Массив;
    Для Каждого КЗ Из Соответствие Цикл
        Массив.Добавить(КЗ.Значение);
	КонецЦикла;
    
    Индекс = СлучайноеЧисло(0, Массив.Количество() - 1);
    
    Возврат Массив[Индекс];
              
КонецФункции

#КонецОбласти

#Область Прочее

// Функция возвращает набор пастельных цветов в порядке их взаимной контрастности
// Возвращаемое значение:
//  Массив - массив цветов для использования в сериях на диаграммах
Функция ЦветаСерийДиаграмм() Экспорт
	
	МассивЦветов = Новый Массив;
	
	МассивЦветов.Добавить(Новый Цвет(245, 152, 150));
	МассивЦветов.Добавить(Новый Цвет(142, 201, 249));
	МассивЦветов.Добавить(Новый Цвет(255, 202, 125));
	МассивЦветов.Добавить(Новый Цвет(178, 154, 218));
	МассивЦветов.Добавить(Новый Цвет(163, 214, 166));
	МассивЦветов.Добавить(Новый Цвет(244, 140, 175));
	МассивЦветов.Добавить(Новый Цвет(125, 221, 233));
	МассивЦветов.Добавить(Новый Цвет(255, 242, 128));
	МассивЦветов.Добавить(Новый Цвет(205, 145, 215));
	МассивЦветов.Добавить(Новый Цвет(125, 202, 194));
	
	Возврат МассивЦветов;
	
КонецФункции

// Функция - Цвет по номеру картинки
//
// Параметры:
//  НомерКартинки	 - Число	 - номер картинки цвета из библиотеки картинок
// 
// Возвращаемое значение:
//  Цвет - цвет картинки
//
Функция ЦветПоНомеруКартинки(Знач НомерКартинки) Экспорт
	
	Соответствие = Новый Соответствие;
	
	Соответствие.Вставить(1,  Новый Цвет(172,114,94));
	Соответствие.Вставить(2,  Новый Цвет(208,107,100));
	Соответствие.Вставить(3,  Новый Цвет(248,58,34));
	Соответствие.Вставить(4,  Новый Цвет(250,87,60));
	Соответствие.Вставить(5,  Новый Цвет(255,117,55));
	Соответствие.Вставить(6,  Новый Цвет(255,173,70));
	Соответствие.Вставить(7,  Новый Цвет(66,214,146));
	Соответствие.Вставить(8,  Новый Цвет(22,167,101));
	Соответствие.Вставить(9,  Новый Цвет(123,209,72));
	Соответствие.Вставить(10, Новый Цвет(179,220,108));
	Соответствие.Вставить(11, Новый Цвет(251,233,131));
	Соответствие.Вставить(12, Новый Цвет(250,209,101));
	Соответствие.Вставить(13, Новый Цвет(146,225,192));
	Соответствие.Вставить(14, Новый Цвет(159,225,231));
	Соответствие.Вставить(15, Новый Цвет(159,198,231));
	Соответствие.Вставить(16, Новый Цвет(73,134,231));
	Соответствие.Вставить(17, Новый Цвет(154,156,255));
	Соответствие.Вставить(18, Новый Цвет(185,154,255));
	Соответствие.Вставить(19, Новый Цвет(194,194,194));
	Соответствие.Вставить(20, Новый Цвет(202,189,191));
	Соответствие.Вставить(21, Новый Цвет(204,166,172));
	Соответствие.Вставить(22, Новый Цвет(246,145,178));
	Соответствие.Вставить(23, Новый Цвет(205,116,230));
	Соответствие.Вставить(24, Новый Цвет(164,122,226));
	
	Возврат Соответствие[НомерКартинки];
	
КонецФункции

// Функция - Картинка цвета по номеру картинки
//
// Параметры:
//  НомерКартинки	 - Число	 - номер картинки цвета из библиотеки картинок
// 
// Возвращаемое значение:
//  Картинка - картинка цвета из библиотеки картинок
//
Функция КартинкаЦветаПоНомеруКартинки(Знач НомерКартинки) Экспорт
	
	НомерСтрокой = Формат(НомерКартинки, "ЧЦ=2; ЧВН=");
	Возврат БиблиотекаКартинок["Цвет" + НомерСтрокой];
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция переводит шестнадцатеричное число в десятичное
// Параметры: _Hex     - Строка              - Шестнадцатеричное число
// Возвращаемое значение: Число   - Десятичное число
//
Функция HexToDecЧисло(Знач _Hex)
	
	Если _Hex = "0" Тогда 
		Возврат 0;
	КонецЕсли;
	
	ЧислаHex 		= "0123456789ABCDEF";
	_Hex 			= СокрЛП(_Hex);
	СтаршаяСтепень 	= СтрДлина(_Hex) - 1;
	Результат 		= 0;
	счСимволов 		= 1;
	Пока СтаршаяСтепень >= 0 Цикл
		_HexСимвол 		= Сред(_Hex, счСимволов, 1);
		Представление 	= СтрНайти(ЧислаHex, _HexСимвол) - 1;
		Результат 		= Результат + Представление * Pow(16, СтаршаяСтепень);
		СтаршаяСтепень 	= СтаршаяСтепень - 1;
		СчСимволов 		= СчСимволов + 1;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // HexToDec()   

// Конвертация из 10-чной в любую систему счисления.
//
// Параметры:
//	Значение - Строка,Число - исходное значение.
//	Нотация - Число - основание системы счисления.
//
// Возвращаемое значение:
//	Строка - значение в нужной системе счисления.
//
Функция Из_10_В_Любую(Знач Значение = 0, Знач Нотация = 16)
	
	Если Нотация <= 0 Тогда Возврат("") КонецЕсли;
	Значение = Число(Значение);
	Если Значение <= 0 Тогда Возврат("0") КонецЕсли;
	Значение = Цел(Значение);
	Результат = "";
	Пока Значение > 0 Цикл
		Результат = Сред("0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ", Значение % Нотация + 1, 1) + Результат;
		Значение = Цел(Значение / Нотация);		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Вспомогательная функция перевода из системы HSL в RGB.
//
// Параметры:
//	p - Число - 
//	q - Число - 
//	t - Число - 
//
// Возвращаемое значение:
//	Число - 
Функция HUE2RGB(Знач p, Знач q, Знач t)
    
    Если t < 0 Тогда 
        t = t + 1; 
    КонецЕсли;
    Если t > 1 Тогда 
        t = t - 1;
    КонецЕсли;
    Если t < 1 / 6 Тогда 
        Возврат p + (q - p) * 6 * t; 
    КонецЕсли;
    Если t < 1 / 2 Тогда 
        Возврат q; 
    КонецЕсли;
    Если t < 2/3 Тогда 
        Возврат p + (q - p) * (2 / 3 - t) * 6; 
    КонецЕсли;
    
    Возврат p;
  
КонецФункции

// Возвращает случайное число. Работает как в веб-клиенте, так и в тонком.
// В веб-клиенте не использует ГенераторСлучайныхЧисел.
//
// Параметры:
//	МинимальноеЗначение - Число - минимальная граница случайного числа.
//	МаксимальноеЗначение - Число - максимальная граница случайного числа.
//
// Возвращаемое значение:
//	Число - случайное число в диапазоне переданных чисел (включая минимум и максимум).
//
Функция СлучайноеЧисло(Знач МинимальноеЗначение = 0, Знач МаксимальноеЗначение = 100)
	
	// Находим длину диапазона
	Альфа = МаксимальноеЗначение - МинимальноеЗначение;
	
	УИД = НРег(Новый УникальныйИдентификатор);
	УИД = СтрЗаменить(УИД,"-","");
	УИД = СтрЗаменить(УИД,"a","");
	УИД = СтрЗаменить(УИД,"b","");
	УИД = СтрЗаменить(УИД,"c","");
	УИД = СтрЗаменить(УИД,"d","");
	УИД = СтрЗаменить(УИД,"e","");
	УИД = СтрЗаменить(УИД,"f","");
	
	#Если ВебКлиент Тогда
		
	// Получаем диапазон от 0 до 1
	ЧислоУИД = Число("0." + УИД);
	// Проецируем диапазон от 0 до 1 на отрезок [МинимальноеЗначение, МаксимальноеЗначение]
	ЧислоУИД = МинимальноеЗначение + Окр(ЧислоУИД * Альфа);
	Если ЧислоУИД < МинимальноеЗначение Тогда
		ЧислоУИД = МинимальноеЗначение;	
	ИначеЕсли ЧислоУИД > МаксимальноеЗначение Тогда
		ЧислоУИД = МаксимальноеЗначение;	
	КонецЕсли;
	Возврат ЧислоУИД;
	
	#Иначе
	
	// Инициализируем по переданному числу, чтобы последовательные вызовы возвращали разные значения.
	ГСЧ = Новый ГенераторСлучайныхЧисел(Число(УИД));	
	Возврат ГСЧ.СлучайноеЧисло(МинимальноеЗначение, МаксимальноеЗначение);
	
	#КонецЕсли
	
КонецФункции

// Формирует строку повторяющихся символов заданной длины.
//
// Параметры:
//  Символ      - Строка - символ, из которого будет формироваться строка.
//  ДлинаСтроки - Число  - требуемая длина результирующей строки.
//
// Возвращаемое значение:
//  Строка - строка, состоящая из повторяющихся символов.
//
Функция СформироватьСтрокуСимволов(Знач Символ, Знач ДлинаСтроки) Экспорт
	
	Результат = "";
	Для Счетчик = 1 По ДлинаСтроки Цикл
		Результат = Результат + Символ;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Дополняет строку символами слева или справа до заданной длины и возвращает ее.
// При этом удаляются незначащие символы слева и справа (подробнее про незначащие символы 
// см. синтакс-помощник к методу платформы СокрЛП). 
// По умолчанию функция дополняет строку символами "0" (ноль) слева.
//
// Параметры:
//  Значение    - Строка - исходная строка, которую необходимо дополнить символами;
//  ДлинаСтроки - Число  - требуемая результирующая длина строки;
//  Символ      - Строка - символ, которым необходимо дополнить строку;
//  Режим       - Строка - "Слева" или "Справа" - вариант добавления символов к исходной строке.
// 
// Возвращаемое значение:
//  Строка - строка, дополненная символами.
//
// Пример:
//  1. Результат = СтроковыеФункцииКлиентСервер.ДополнитьСтроку("1234", 10, "0", "Слева");
//  Возвращает: "0000001234".
//
//  2. Результат = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(" 1234  ", 10, "#", "Справа");
//  Строка = " 1234  "; ДлинаСтроки = 10; Символ = "#"; Режим = "Справа"
//  Возвращает: "1234######".
//
Функция ДополнитьСтроку(Знач Значение, Знач ДлинаСтроки, Знач Символ = "0", Знач Режим = "Слева") Экспорт
	
	// Длина символа не должна превышать единицы.
	Символ = Лев(Символ, 1);
	
	// Удаляем крайние пробелы слева и справа строки.
	Значение = СокрЛП(Значение);
	КоличествоСимволовНадоДобавить = ДлинаСтроки - СтрДлина(Значение);
	
	Если КоличествоСимволовНадоДобавить > 0 Тогда
		
		СтрокаДляДобавления = СформироватьСтрокуСимволов(Символ, КоличествоСимволовНадоДобавить);
		Если ВРег(Режим) = "СЛЕВА" Тогда
			Значение = СтрокаДляДобавления + Значение;
		ИначеЕсли ВРег(Режим) = "СПРАВА" Тогда
			Значение = Значение + СтрокаДляДобавления;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

#КонецОбласти