////////////////////////////////////////////////////////////////////////////////
//
// Модуль для работы с цветом в 1С.
// https://github.com/Diversus23/color1c
// Версия: 1.5.2
//
// Модуль использует HEX-представления цвета вида #RRGGBB
// где RR - красный, GG - зеленый, BB - синий в HEX-представлении.
// Хранить элементы цвета с справочниках рекомендуем с типом Строка[7].
// Пример, красный цвет: #FF0000 или #F00
//
// Модуль определяет работу с:
//  + HEX-представлением цвета (конвертация из HEX в цвет 1С и наоборот);
//  + HSV-представлением цвета;
//  + HSL-представлением цвета;
//  + CMYK-представлением цвета;
//  + Конвертациями из одной системы представления цвета в другую;
//  + Работа с каталогами RAL;
//  + Работа со случайными цветами;
//		+ Получение случайного цвета;
//		+ Получение случайного светлого цвета;
//		+ Получение случайного темного цвета;
//		+ Получение случайного цвета из каталога RAL Standart;
//		+ Получение случайного Web-цвета;
//  + Получение контрастных и инвертированных цветов для текста и фона;
//  + Извлечение компонент цвета (красный, зеленый, синий).
//  + Трансформация цветов:
//		+ осветление;
//		+ затемнение;
//		+ различные алгоритмы градации серого;
//		+ смешивание двух цветов;
//	+ Работа с именованными CSS-цветами (black, green, white...)
//
// Использовался инструмент https://colorscheme.ru/color-converter.html
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область HEX
	
// Функция - Цвет в HEX-вид.
//
// Параметры:
//  Цвет - Цвет	 - исходный цвет.
// 
// Возвращаемое значение:
//  Строка - строка вида #RRGGBB - где RR - красный, GG - зеленый, BB - синий.
//
Функция ЦветВHex(Знач Цвет) Экспорт
		
	Результат = "";
		
	Если Цвет.Вид = ВидЦвета.Абсолютный Тогда
		
		Результат = ДополнитьСтроку(Из_10_В_Любую(Цвет.Красный), 2)
			+ ДополнитьСтроку(Из_10_В_Любую(Цвет.Зеленый), 2)
			+ ДополнитьСтроку(Из_10_В_Любую(Цвет.Синий), 2);
			
	ИначеЕсли Цвет.Вид = ВидЦвета.WebЦвет Тогда
		
		НайденныйЦвет = КаталогWebЦветов().Получить(Цвет);               
		Если НайденныйЦвет <> Неопределено Тогда
			Возврат ЦветВHex(НайденныйЦвет); 
		Иначе
			Результат = "000000";
		КонецЕсли;                              
		
	ИначеЕсли Цвет.Вид = ВидЦвета.WindowsЦвет ИЛИ Цвет.Вид = ВидЦвета.ЭлементСтиля Тогда

        Результат = "000000";
			
		// Для версий платформ 8.3.9 и выше.
		СистемнаяИнформация = Новый СистемнаяИнформация;
		ВесПлатформы = ВесВерсии(СистемнаяИнформация.ВерсияПриложения);
		Вес = ВесВерсии("8.3.9.0");
		Если ВесПлатформы >= Вес Тогда
			ПотокВПамяти = Новый ПотокВПамяти();

			ТабДокумент = Новый ТабличныйДокумент;
			ТабДокумент.Область(1, 1, 1, 1).ЦветФона = Цвет;
			ТабДокумент.Записать(ПотокВПамяти, ТипФайлаТабличногоДокумента.ODS);

			ПотокВПамяти.Перейти(0, ПозицияВПотоке.Начало);

			ТабДокумент.Прочитать(ПотокВПамяти,, ТипФайлаТабличногоДокумента.ODS);
			ЦветФона = ТабДокумент.Область(1, 1, 1, 1).ЦветФона;

			Результат = ДополнитьСтроку(Из_10_В_Любую(ЦветФона.Красный), 2)
			    + ДополнитьСтроку(Из_10_В_Любую(ЦветФона.Зеленый), 2)
			    + ДополнитьСтроку(Из_10_В_Любую(ЦветФона.Синий), 2);
			    
			ПотокВПамяти.Закрыть();
		Иначе
			#Если НЕ ВебКлиент Тогда
				
			ТабДокумент = Новый ТабличныйДокумент;
			ТабДокумент.Область(1, 1, 1, 1).ЦветФона = Цвет;
			ВременныйФайл = ПолучитьИмяВременногоФайла("htm");
			ТабДокумент.Записать(ВременныйФайл, ТипФайлаТабличногоДокумента.HTML);
			ТекстовыйДокумент = Новый ТекстовыйДокумент;
			ТекстовыйДокумент.Прочитать(ВременныйФайл);
			Стр = ТекстовыйДокумент.ПолучитьТекст();
			УдалитьФайлы(ВременныйФайл);

			ДлинаСтрокиЦвета = 6;
			ДлинаОтступа = 2;
			СтрокаПоиска = "background-color:";          
			Позиция = СтрНайти(Стр, СтрокаПоиска);
			Если Позиция <> 0 Тогда
				Результат = ВРег(Сред(Стр, Позиция + СтрДлина(СтрокаПоиска) + ДлинаОтступа, ДлинаСтрокиЦвета));
			КонецЕсли;
			
			#КонецЕсли			
		КонецЕсли;
		
	Иначе
		
		Результат = "000000";
		
	КонецЕсли;
	
	Возврат "#" + Результат;
	
КонецФункции

// Возвращает из строки в HEX-виде ее цвет.
//
// Параметры:
//	Стр - Строка - вида #RRGGBB или #RGB - где R, RR - красный, G, GG - зеленый, B, BB - синий, 
//
// Возвращаемое значение:
//	Цвет - цвет.
//
Функция HexВЦвет(Знач Стр) Экспорт
	
	ДлинаСокращенногоЦвета 	= 4;
	ДлинаПолногоЦвета 		= 7;
	
    СтрЦвета = ВРег(Стр);
    ЦветОпределен = Истина;
	
	Попытка
		Если СтрДлина(СтрЦвета) = ДлинаСокращенногоЦвета Тогда
			// Цвет вида #RGB -> #RRGGBB (#F18 -> #FF1188).
			СтрЦвета = Лев(СтрЦвета, 1)
				+ Сред(СтрЦвета, 2, 1) + Сред(СтрЦвета, 2, 1)
				+ Сред(СтрЦвета, 3, 1) + Сред(СтрЦвета, 3, 1)
				+ Сред(СтрЦвета, 4, 1) + Сред(СтрЦвета, 4, 1);
		КонецЕсли;
		
		Если СтрДлина(СтрЦвета) = ДлинаПолногоЦвета Тогда
			// Цвет вида #RRGGBB (#FF1188 - FF - красный, 11 - зеленый, 88 - синий).
			Красный 		= HexToDecЧисло(Сред(СтрЦвета, 2, 2));
			Зеленый 		= HexToDecЧисло(Сред(СтрЦвета, 4, 2));
			Синий 			= HexToDecЧисло(Сред(СтрЦвета, 6, 2));
		Иначе
			ЦветОпределен	= Ложь;
		КонецЕсли;
	Исключение
		ЦветОпределен = Ложь;
	КонецПопытки;
	
	Если НЕ ЦветОпределен Тогда
		МаксимумЦвет	= 255;
		Красный 		= МаксимумЦвет;
		Зеленый 		= МаксимумЦвет;
		Синий 			= МаксимумЦвет;		
	КонецЕсли;
	
	Возврат КонструкторЦвета(Красный, Зеленый, Синий);
	
КонецФункции

#КонецОбласти

#Область ТрансформацияЦветов

// Функция "осветляет" цвет.
//
// Параметры:
//  Цвет	 - Цвет	 - исходный цвет
//  Процент	 - Число - процент изменения светлоты цвета. Значение 0 цвет не изменен, 100 - белый.
// 
// Возвращаемое значение:
//  Цвет - осветленный цвет.
//
Функция ОсветлитьЦвет(Знач Цвет, Знач Процент) Экспорт
	
	МаксимумЦвет	= 255;
	МаксимумПроцент	= 100;
	
    Цвет 	= АбсолютныйЦвет(Цвет);    
    Дельта 	= Макс(Мин(Процент, МаксимумЦвет), 0) / МаксимумПроцент;
	
	Красный = Мин(Цвет.Красный + Дельта * (МаксимумЦвет - Цвет.Красный), МаксимумЦвет);
	Зеленый	= Мин(Цвет.Зеленый + Дельта * (МаксимумЦвет - Цвет.Зеленый), МаксимумЦвет);
	Синий	= Мин(Цвет.Синий   + Дельта * (МаксимумЦвет - Цвет.Синий), МаксимумЦвет);
	
	Возврат КонструкторЦвета(Окр(Красный), Окр(Зеленый), Окр(Синий));
	
КонецФункции

// Функция "затемняет" цвет.
//
// Параметры:
//  Цвет	 - Цвет	 - исходный цвет
//  Процент	 - Число - процент изменения затемнения цвета. Значение 0 цвет не изменен, 100 - черный.
// 
// Возвращаемое значение:
//  Цвет - затемненный цвет.
//
Функция ЗатемнитьЦвет(Знач Цвет, Знач Процент) Экспорт
    
	МаксимумЦвет	= 255;
	МаксимумПроцент	= 100;

	Цвет = АбсолютныйЦвет(Цвет);    
    Дельта = Макс(Мин(Процент, МаксимумЦвет), 0) / МаксимумПроцент;
	
	Красный	= Макс(Цвет.Красный - Дельта * Цвет.Красный, 0);
	Зеленый	= Макс(Цвет.Зеленый - Дельта * Цвет.Зеленый, 0);
	Синий	= Макс(Цвет.Синий   - Дельта * Цвет.Синий, 0);
	
	Возврат КонструкторЦвета(Окр(Красный), Окр(Зеленый), Окр(Синий));    
    
КонецФункции

// Смешивание двух цветов с балансом.
//
// Параметры:
//	Цвет1 - Цвет, Строка - первый цвет.
//	Цвет2 - Цвет, Строка - второй цвет.
//  Баланс - Число - баланс смешивания двух цветов (от 0 до 100).
//
// Возвращаемое значение:
//	Цвет - цвет получившийся при смешивании.
//      Примеры:
//          (#38c120, #3ab5ba, 50) = #39BB6D
//          (#38c120, #3ab5ba, 80) = #3AB79B
//
//  Онлайн пример: https://pinetools.com/blend-colors но там небольшая ошибка с округлениями.
//
Функция СмешатьДваЦвета(Знач Цвет1, Знач Цвет2, Знач Баланс = 50) Экспорт
	
	МаксимумЦвет	= 255;
	МаксимумПроцент	= 100;
	
    Если Баланс > МаксимумПроцент Тогда
        Баланс = МаксимумПроцент;
    КонецЕсли;
    Если Баланс < 0 Тогда
        Баланс = 0;
    КонецЕсли;
    Баланс100 = Баланс / МаксимумПроцент;
    
    Ц1 = АбсолютныйЦвет(Цвет1);
    Ц2 = АбсолютныйЦвет(Цвет2);
    
    Красный = Макс(Мин(Окр((Ц2.Красный - Ц1.Красный) * Баланс100 + Ц1.Красный), МаксимумЦвет), 0);
    Зеленый = Макс(Мин(Окр((Ц2.Зеленый - Ц1.Зеленый) * Баланс100 + Ц1.Зеленый), МаксимумЦвет), 0);
    Синий   = Макс(Мин(Окр((Ц2.Синий - Ц1.Синий) * Баланс100 + Ц1.Синий), МаксимумЦвет), 0);
    
    Возврат КонструкторЦвета(Красный, Зеленый, Синий);
    
КонецФункции

// Конвертация цвета в градации серого по среднему методу.
//
// Параметры:
//	Цвет - Цвет, Строка - исходный цвет.
//
// Возвращаемое значение:
//	Цвет - цвет получившийся при градации при смешивании всех компонентов цвета и получении среднего.
//
//  Формула: (R + G + B) / 3
//  Подробнее на: https://www.johndcook.com/blog/2009/08/24/algorithms-convert-color-grayscale/
//
Функция ГрадацииСерогоAverage(Знач Цвет) Экспорт
	
	КомпонентыЦвета = 3;	
    Цвет  = АбсолютныйЦвет(Цвет);
    Серый = (Цвет.Красный + Цвет.Зеленый + Цвет.Синий) / КомпонентыЦвета;
    
    Возврат КонструкторЦвета(Серый, Серый, Серый);
    
КонецФункции

// Конвертация цвета в градации серого по осветленному методу. Метод имеет тенденцию уменьшать контраст.
//
// Параметры:
//	Цвет - Цвет, Строка - исходный цвет.
//
// Возвращаемое значение:
//	Цвет - цвет получившийся при градации при осветлении.
//
//  Формула: (max (R, G, B) + min (R, G, B)) / 2
//  Подробнее на: https://www.johndcook.com/blog/2009/08/24/algorithms-convert-color-grayscale/
//
Функция ГрадацииСерогоLightness(Знач Цвет) Экспорт
    
    Цвет  = АбсолютныйЦвет(Цвет);
    Серый = (Макс(Цвет.Красный, Цвет.Зеленый, Цвет.Синий) + Мин(Цвет.Красный, Цвет.Зеленый, Цвет.Синий)) / 2;
    
    Возврат КонструкторЦвета(Серый, Серый, Серый);
    
КонецФункции

// Конвертация цвета в градации серого по методу светимости. Рекомендуется по умолчанию. Используется в редакторе GIMP.
//
// Параметры:
//	Цвет - Цвет, Строка - исходный цвет.
//
// Возвращаемое значение:
//	Цвет - цвет получившийся при градации при светимости.
//
//  Формула: 0,21 * Red + 0,72 * Green + 0,07 * Blue
//  Этот метод работает лучше всего в целом и является методом по умолчанию, используемым в редакторе GIMP.
//  Подробнее на: https://www.johndcook.com/blog/2009/08/24/algorithms-convert-color-grayscale/
//
Функция ГрадацииСерогоLuminosity(Знач Цвет) Экспорт
	
	ЧислоКрасный	= 0.21;
	ЧислоЗеленый	= 0.72;
	ЧислоСиний		= 0.07;
	
    Цвет  = АбсолютныйЦвет(Цвет);
    Серый = ЧислоКрасный * Цвет.Красный + ЧислоЗеленый * Цвет.Зеленый + ЧислоСиний * Цвет.Синий;
    
    Возврат КонструкторЦвета(Серый, Серый, Серый);
    
КонецФункции

// Приводит цвет к абсолютному (ВидЦвета.Абсолютный)
//
// Параметры:
//	Цвет - Цвет, Строка - произвольный цвет, либо hex-цвет.
//
// Возвращаемое значение:
//	Цвет - цвет результат с видом ВидЦвета.Абсолютный.
//
Функция АбсолютныйЦвет(Знач Цвет) Экспорт
    
	Если ТипЗнч(Цвет) = Тип("Цвет") Тогда
		ИсходныйЦвет = Цвет;
	ИначеЕсли ТипЗнч(Цвет) = Тип("Строка") Тогда
		ИсходныйЦвет = HexВЦвет(Цвет);
	Иначе
		Возврат КонструкторЦвета(0, 0, 0);
	КонецЕсли;
	
	// Преобразования для не абсолютных цветов.
	Если ИсходныйЦвет.Вид <> ВидЦвета.Абсолютный Тогда
		ИсходныйЦвет = HexВЦвет(ЦветВHex(ИсходныйЦвет));
	КонецЕсли;
    
    Возврат ИсходныйЦвет;
    
КонецФункции

// Возвращает массив цветов, представляющих собой градиент - переход от начального цвета к конечному. 
// Возвращаемый массив начинается с начального и заканчивается конечным цветом.
// Автор: https://infostart.ru/public/978835/
//
// Параметры:
//	НачальныйЦвет - Цвет - начальный цвет градиента
//	КонечныйЦвет - Цвет - конечный цвет градиента
//	КоличествоГрадаций - Число - общее число цветов в возвращаемом массиве (включает начальный и конечный цвета), должно быть больше 2. По умолчанию 5.
//
// Возвращаемое значение:
//	Массив,Неопределено - массив с элементами типа Цвет или Неопределено (если градаций меньше 3 либо начальный и конечный цвета
//								заданы не абсолютными цветами
//
Функция ПолучитьГрадиент(Знач НачальныйЦвет, Знач КонечныйЦвет, Знач КоличествоГрадаций = 5) Экспорт
	
	мНачальныйЦвет = АбсолютныйЦвет(НачальныйЦвет);
	мКонечныйЦвет = АбсолютныйЦвет(КонечныйЦвет);
	
	МассивЦветов = Новый Массив;
	МассивЦветов.Добавить(НачальныйЦвет);
	
	Если КоличествоГрадаций > 2 Тогда
		ШагКрасного = (мКонечныйЦвет.Красный - мНачальныйЦвет.Красный) / КоличествоГрадаций;
		ШагЗеленого = (мКонечныйЦвет.Зеленый - мНачальныйЦвет.Зеленый) / КоличествоГрадаций;
		ШагСинего   = (мКонечныйЦвет.Синий - мНачальныйЦвет.Синий) / КоличествоГрадаций;
		
		ТекКрасный  = мНачальныйЦвет.Красный;
		ТекЗеленый  = мНачальныйЦвет.Зеленый;
		ТекСиний    = мНачальныйЦвет.Синий;
		
		Для Сч = 2 По КоличествоГрадаций Цикл
			ТекКрасный  = ТекКрасный + ШагКрасного;
			ТекЗеленый  = ТекЗеленый + ШагЗеленого;
			ТекСиний    = ТекСиний + ШагСинего;
			
			МассивЦветов.Добавить(КонструкторЦвета(Окр(ТекКрасный, 0), Окр(ТекЗеленый, 0), Окр(ТекСиний, 0)));
		КонецЦикла;
		
		МассивЦветов[МассивЦветов.ВГраница()] = мКонечныйЦвет;
		
		Возврат МассивЦветов;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

// Возвращает из строки в HEX-виде ее красную составляющую.
//
// Параметры:
//	СтрокаЦвета - Строка - вида #RRGGBB - где RR - красный, GG - зеленый, BB - синий
//
// Возвращаемое значение:
//	Число - составляющая.
//
Функция КрасныйИзHex(Знач СтрокаЦвета) Экспорт
	
	Цвет = HexВЦвет(СтрокаЦвета);
	Возврат Цвет.Красный;
	
КонецФункции

// Возвращает из строки в HEX-виде ее зеленую составляющую.
//
// Параметры:
//	СтрокаЦвета - Строка - вида #RRGGBB - где RR - красный, GG - зеленый, BB - синий
//
// Возвращаемое значение:
//	Число - составляющая.
//
Функция ЗеленыйИзHex(Знач СтрокаЦвета) Экспорт
	
	Цвет = HexВЦвет(СтрокаЦвета);
	Возврат Цвет.Зеленый;
	
КонецФункции

// Возвращает из строки в HEX-виде ее синюю составляющую.
//
// Параметры:
//	СтрокаЦвета - Строка - вида #RRGGBB - где RR - красный, GG - зеленый, BB - синий
//
// Возвращаемое значение:
//	Число - составляющая.
//
Функция СинийИзHex(Знач СтрокаЦвета) Экспорт
	
	Цвет = HexВЦвет(СтрокаЦвета);
	Возврат Цвет.Синий;
	
КонецФункции

// По переданному цвету возвращает контрастный белый или черный цвет.
// Позволяет получать для цвета фона цвет текста.
// Можно пользоваться в связке цвет фона получить из СлучайныйЦвет(),
// а цвет текста используя эту функцию. Позволяет подбирать фон для для шрифта.
//
// Параметры:
//	Цвет - Цвет - исходный цвет.
//
// Возвращаемое значение:
//	Цвет - цвет контраста.
// Пример: для цвета #FFFFFF вернет #000000
//
Функция КонтрастныйЦвет(Знач Цвет) Экспорт

	МаксимумЦвет 	= 255;
	ЧислоКрасный	= 0.299;
	ЧислоЗеленый	= 0.587;
	ЧислоСиний		= 0.114;
	ПоловинаЕдиницы	= 0.5;
	
    ИсходныйЦвет 	= АбсолютныйЦвет(Цвет);	
	Красный 		= ИсходныйЦвет.Красный;
	Зеленый 		= ИсходныйЦвет.Зеленый;
	Синий 			= ИсходныйЦвет.Синий;
		
 	Цветность 		= 1 - (ЧислоКрасный * Красный + ЧислоЗеленый * Зеленый + ЧислоСиний * Синий) / МаксимумЦвет;
	ЦветРезультата 	= ?(Цветность < ПоловинаЕдиницы, 0, МаксимумЦвет);
  	
  	Возврат КонструкторЦвета(ЦветРезультата, ЦветРезультата, ЦветРезультата);
	
КонецФункции

// По переданному цвету возвращает инвертированный (противоположный) цвет.
// Позволяет получать для цвета фона цвет текста.
// Можно пользоваться в связке цвет фона получить из СлучайныйЦвет(),
// а цвет текста используя эту функцию.
//
// Параметры:
//	Цвет - Цвет - исходный цвет.
//
// Возвращаемое значение:
//	Цвет - цвет контраста.
// Пример: для цвета #5200A3 вернет #ADFF5C
//
Функция ИнвертированныйЦвет(Знач Цвет) Экспорт
    
    ИсходныйЦвет 	= АбсолютныйЦвет(Цвет);
	
	Красный 		= ИсходныйЦвет.Красный;
	Зеленый 		= ИсходныйЦвет.Зеленый;
	Синий 			= ИсходныйЦвет.Синий;
	
	МаксимумЦвет 	= 255;
	  	
  	Возврат КонструкторЦвета(МаксимумЦвет - Красный, МаксимумЦвет - Зеленый, МаксимумЦвет - Синий);
	
КонецФункции

// Выполняет Hue Shift. Сдвиг компоненты Hue в цвете на нужное количество градусов.
//
// Параметры:
//	Цвет - Цвет - исходный цвет.
//  Оттенок - Число - градус сдвига. Имеет смысл -180 до 180, если не в диапазоне будет к нему приведен.
//
// Возвращаемое значение:
//	Цвет - цвет с Hue Shift.
//
Функция СдвигОттенкаЦвета(Знач Цвет, Знач Оттенок = 0) Экспорт
	
	МаксимумГрадусов = 360;
	
    ИсходныйЦвет = ЦветВHSV(Цвет);
    ИсходныйЦвет.h = ИсходныйЦвет.h + Оттенок;
    Пока ИсходныйЦвет.h >= МаксимумГрадусов Цикл
        ИсходныйЦвет.h = ИсходныйЦвет.h - МаксимумГрадусов;
    КонецЦикла;
    Пока ИсходныйЦвет.h < 0 Цикл 
        ИсходныйЦвет.h = ИсходныйЦвет.h + МаксимумГрадусов;
    КонецЦикла;
    
    Возврат HSVВЦвет(ИсходныйЦвет);
        
КонецФункции

#КонецОбласти

#Область CSS

// Возвращает абсолютный цвет по CSS-цвету.
//
// Параметры:
//	ИмяЦвета - Строка - имя цвета как он пишется в CSS
//
// Возвращаемое значение:
//	Цвет - абсолютный цвет или Неопределено, если цвет не найдет.
// Пример:
//	ЦветПоИмениВCSS("black") вернет Новый Цвет(0, 0, 0)
//  ЦветПоИмениВCSS("aqua") вернет Новый Цвет(0, 255, 255)
//
Функция ЦветПоИмениВCSS(Знач ИмяЦвета) Экспорт
	
	Возврат КаталогCSSЦветов().Получить(НРег(ИмяЦвета));
	
КонецФункции

#КонецОбласти

#Область HSV

// Возвращает цвет из цветовой модели HSV.
//
// Параметры:
//	Тон - Число - Hue от 0 до 360.
//	Насыщенность - Число - Saturation от 0 до 100.
//	Яркость - Число - Value/Brightness от 0 до 100.
//
// Возвращаемое значение:
//	Цвет - цвет.
//
Функция HSVВЦветПоКомпонентам(Знач Тон, Знач Насыщенность, Знач Яркость) Экспорт
	
	МаксимумЦвет	= 255;
	МаксимумПроцент = 100;
	Градус60		= 60;
	Градус120		= 120;
	Градус180		= 180;
	Градус240		= 240;
	Градус300		= 300;
	Основание		= 2;
	
	мТон 			= Тон;
	мНасыщенность 	= Насыщенность / МаксимумПроцент;
	мЯркость 		= Яркость / МаксимумПроцент;
	
	ЗначениеЦвета = мНасыщенность * мЯркость;
	
	МодульДвух = (мТон / Градус60) % Основание;
	
	НеизвестноеЗначение = ЗначениеЦвета * (1 - ?(МодульДвух - 1 >= 0, МодульДвух - 1, 1 - МодульДвух));
	Значение = мЯркость - ЗначениеЦвета;	

	Если мТон >= 0 И мТон < Градус60 Тогда
		КрасныйЦвет = ЗначениеЦвета;
		ЗеленыйЦвет = НеизвестноеЗначение;
		СинийЦвет 	= 0;	
	ИначеЕсли мТон >= Градус60 И мТон < Градус120 Тогда
		КрасныйЦвет = НеизвестноеЗначение;
		ЗеленыйЦвет = ЗначениеЦвета;
		СинийЦвет	= 0;	
	ИначеЕсли мТон >= Градус120 И мТон < Градус180 Тогда
		КрасныйЦвет = 0;
		ЗеленыйЦвет = ЗначениеЦвета;
		СинийЦвет	= НеизвестноеЗначение;	
	ИначеЕсли мТон >= Градус180 И мТон < Градус240 Тогда
		КрасныйЦвет = 0;
		ЗеленыйЦвет = НеизвестноеЗначение;
		СинийЦвет	= ЗначениеЦвета;	
	ИначеЕсли мТон >= Градус240 И мТон < Градус300 Тогда
		КрасныйЦвет = НеизвестноеЗначение;
		ЗеленыйЦвет = 0;
		СинийЦвет	= ЗначениеЦвета;	
	Иначе
		КрасныйЦвет = ЗначениеЦвета;
		ЗеленыйЦвет = 0;
		СинийЦвет	= НеизвестноеЗначение;	
	КонецЕсли;
	
	КрасныйЦвет		= Окр((КрасныйЦвет + Значение) * МаксимумЦвет, 0, РежимОкругления.Окр15как20);
	ЗеленыйЦвет 	= Окр((ЗеленыйЦвет + Значение) * МаксимумЦвет, 0, РежимОкругления.Окр15как20);
	СинийЦвет		= Окр((СинийЦвет + Значение) * МаксимумЦвет, 0, РежимОкругления.Окр15как20);
	
	Возврат КонструкторЦвета(КрасныйЦвет, ЗеленыйЦвет, СинийЦвет);
	
КонецФункции

// Возвращает цвет из цветовой модели HSV.
//
// Параметры:
//  СтруктураHSV - Структура
//		* h - Число - Hue от 0 до 360.
//		* s - Число - Saturation от 0 до 100.
//		* v - Число - Value/Brightness от 0 до 100.
//
// Возвращаемое значение:
//	Цвет - цвет.
//
Функция HSVВЦвет(Знач СтруктураHSV) Экспорт
    
    Возврат HSVВЦветПоКомпонентам(СтруктураHSV.h, СтруктураHSV.s, СтруктураHSV.v);
    
КонецФункции

// Конвертирует цвет в HSV-структуру.
//
// Параметры:
//  Цвет - Цвет	 - исходный цвет.
//
// Возвращаемое значение:
//  Структура
//	    * h - Число - Hue от 0 до 360.
//	    * s - Число - Saturation от 0 до 100.
//	    * v - Число - Value/Brightness от 0 до 100.
//
Функция ЦветВHSV(Знач Цвет) Экспорт

	МаксимумПроцент	= 100;
	МаксимумЦвет	= 255;
	МаксимумГрадус	= 360;
	Градус60		= 60;
	Тон2			= 2;
	Тон4			= 4;
	
    Цвет = АбсолютныйЦвет(Цвет);
    Красный = Цвет.Красный;
    Зеленый = Цвет.Зеленый;
    Синий 	= Цвет.Синий;
			
	Минимум 		= Мин(Красный, Зеленый, Синий);
	Максимум 		= Макс(Красный, Зеленый, Синий);
	Дельта 			= Максимум - Минимум;
	Тон 			= 0;
	Насыщенность	= 0;
	Яркость			= Максимум;
	
	Яркость = Окр(Максимум / МаксимумЦвет * МаксимумПроцент);
	Если Максимум <> 0 И Дельта <> 0 Тогда
	    Насыщенность = Окр(Дельта / Максимум * МаксимумПроцент);
	Иначе
	    // black
	    Возврат Новый Структура("h, s, v", 0, 0, Яркость);
	КонецЕсли;

	Если Красный = Максимум Тогда
	    Тон = (Зеленый - Синий) / Дельта;     		// between yellow & magenta
	ИначеЕсли Зеленый = Максимум Тогда
	    Тон = Тон2 + (Синий - Красный) / Дельта; 	// between cyan & yellow
	Иначе
	    Тон = Тон4 + (Красный - Зеленый) / Дельта;	// between magenta & cyan
	КонецЕсли;

	Тон = Окр(Тон * Градус60); // degrees
	Если Тон < 0 Тогда 
	    Тон = Тон + МаксимумГрадус; 
	КонецЕсли;

    Возврат Новый Структура("h, s, v", Тон, Насыщенность, Яркость);
    
КонецФункции

// Возвращает HEX-цвет вида #RRGGBB из цветовой модели HSV.
//
// Параметры:
//	Тон - Число - Hue от 0 до 360.
//	Насыщенность - Число - Saturation от 0 до 100.
//	Яркость - Число - Value/Brightness от 0 до 100.
//
// Возвращаемое значение:
//	Строка - строка в HEX-формате #RRGGBB (RR - красный, GG - зеленый, BB - синий).
//
Функция HSVВВHex(Знач Тон, Знач Насыщенность, Знач Яркость) Экспорт
	
	Возврат ЦветВHex(HSVВЦветПоКомпонентам(Тон, Насыщенность, Яркость));
	
КонецФункции

// Из HEX-цвета вида #RRGGBB возвращает цвет в цветовой модели HSV.
//
// Параметры:
//	СтрокаHex - строка в HEX-формате #RRGGBB (RR - красный, GG - зеленый, BB - синий).
//
// Возвращаемое значение:
//  Структура
//	    * h - Число - Hue от 0 до 360.
//	    * s - Число - Saturation от 0 до 100.
//	    * v - Число - Value/Brightness от 0 до 100.
//
Функция HexВHSV(Знач СтрокаHex) Экспорт
	
	Возврат ЦветВHSV(HexВЦвет(СтрокаHex));
	
КонецФункции

#КонецОбласти

#Область CMYK

// Возвращает цвет из цветовой модели CMYK.
//
// Параметры:
//	Голубой - Число - Cyan от 0 до 100
//	Пурпурный - Число - Magenta от 0 до 100
//	Желтый - Число - Yellow от 0 до 100
//	Черный - Число - Key или Black от 0 до 100
//
// Возвращаемое значение:
//	Цвет - цвет.
//
Функция CMYKВЦвет(Знач Голубой, Знач Пурпурный, Знач Желтый, Знач Черный) Экспорт
	
	МаксимумПроцент	= 100;
	МаксимумЦвет	= 255;
	
    Голубой 	= Голубой / МаксимумПроцент;
    Пурпурный 	= Пурпурный / МаксимумПроцент;
    Желтый 		= Желтый / МаксимумПроцент;
    Черный 		= Черный / МаксимумПроцент;

    Красный = 1 - Мин(1, Голубой * ( 1 - Черный ) + Черный);
    Зеленый = 1 - Мин(1, Пурпурный * ( 1 - Черный ) + Черный);
    Синий 	= 1 - Мин(1, Желтый * ( 1 - Черный ) + Черный);

    Красный = Окр(Красный * МаксимумЦвет);
    Зеленый = Окр(Зеленый * МаксимумЦвет);
    Синий 	= Окр(Синий * МаксимумЦвет);
    
    Возврат КонструкторЦвета(Красный, Зеленый, Синий);

КонецФункции

// Цвет в структуру CMYK вид.
//
// Параметры:
//  Цвет - Цвет	 - исходный цвет.
// 
// Возвращаемое значение:
//  Структура - структура с цветом в CMYK.
//	    * c - Число - Cyan от 0 до 100.
//	    * m - Число - Magenta от 0 до 100.
//	    * y - Число - Yellow от 0 до 100.
//	    * k - Число - Key или Black от 0 до 100.
//
Функция ЦветВCMYK(Знач Цвет) Экспорт
	
	МаксимумПроцент	= 100;
	МаксимумЦвет	= 255;
	
    АбсолютныйЦвет = ЦветВHex(Цвет);    
    Результат = Новый Структура();
    Результат.Вставить("c", 0);
    Результат.Вставить("m", 0);
    Результат.Вставить("y", 0);
    Результат.Вставить("k", 0);

    Красный = КрасныйИзHex(АбсолютныйЦвет) / МаксимумЦвет;
    Зеленый = ЗеленыйИзHex(АбсолютныйЦвет) / МаксимумЦвет;
    Синий	= СинийИзHex(АбсолютныйЦвет) / МаксимумЦвет;

    Результат.k = Мин( 1 - Красный, 1 - Зеленый, 1 - Синий );
	
	Если Результат.k = 1 Тогда
	    Результат.c = 0;
	    Результат.m = 0;
	    Результат.y = 0;
	Иначе
	    Результат.c = ( 1 - Красный - Результат.k ) / ( 1 - Результат.k );
	    Результат.m = ( 1 - Зеленый - Результат.k ) / ( 1 - Результат.k );
	    Результат.y = ( 1 - Синий - Результат.k ) / ( 1 - Результат.k );
		
	    Результат.c = Окр( Результат.c * МаксимумПроцент );
	    Результат.m = Окр( Результат.m * МаксимумПроцент );
	    Результат.y = Окр( Результат.y * МаксимумПроцент );
	    Результат.k = Окр( Результат.k * МаксимумПроцент );
	КонецЕсли;

    Возврат Результат;    
    
КонецФункции

// Возвращает HEX-цвет из цветовой модели CMYK.
//
// Параметры:
//	Голубой - Число - Cyan от 0 до 100
//	Пурпурный - Число - Magenta от 0 до 100
//	Желтый - Число - Yellow от 0 до 100
//	Черный - Число - Key или Black от 0 до 100
//
// Возвращаемое значение:
//	Строка - строка в HEX-формате #RRGGBB (RR - красный, GG - зеленый, BB - синий).
//
Функция CMYKВHex(Знач Голубой, Знач Пурпурный, Знач Желтый, Знач Черный) Экспорт

    Возврат ЦветВHex(CMYKВЦвет(Голубой, Пурпурный, Желтый, Черный));
    
КонецФункции

// Из HEX-цвета вида #RRGGBB возвращает цвет в цветовой модели CMYK.
//
// Параметры:
//	СтрокаHex - строка в HEX-формате #RRGGBB (RR - красный, GG - зеленый, BB - синий).
//
// Возвращаемое значение:
//  Структура - структура с цветом в CMYK.
//	    * c - Число - Cyan от 0 до 100.
//	    * m - Число - Magenta от 0 до 100.
//	    * y - Число - Yellow от 0 до 100.
//	    * k - Число - Key или Black от 0 до 100.
//
Функция HexВCMYK(Знач СтрокаHex) Экспорт
	
	Возврат ЦветВCMYK(HexВЦвет(СтрокаHex));
	
КонецФункции

#КонецОбласти

#Область HSL

// Конвертирует цвет в HSL-структуру.
//
// Параметры:
//  Цвет - Цвет	 - исходный цвет.
//
// Возвращаемое значение:
//  Структура
//	    * h - Число - Hue от 0 до 360.
//	    * s - Число - Saturation от 0 до 100.
//	    * l - Число - lightness от 0 до 100.
//
Функция ЦветВHSL(Знач Цвет) Экспорт
    
	МаксимумПроцент		= 100;
	МаксимумЦвет		= 255;
	Основание2			= 2;
	Основание4			= 4;
	Основание6			= 6;
	ОснованиеПоловина 	= 0.5;
	
	Цвет 	= АбсолютныйЦвет(Цвет);
    Красный = Цвет.Красный / МаксимумЦвет;
    Зеленый = Цвет.Зеленый / МаксимумЦвет;
    Синий 	= Цвет.Синий / МаксимумЦвет;
    
    МаксЗначение 	= Макс(Красный, Зеленый, Синий);
    МинЗначение 	= Мин(Красный, Зеленый, Синий);
    Тон 			= 0;
    Насыщенность 	= 0;
    Светлость 		= (МаксЗначение + МинЗначение) / Основание2;

    Если (МаксЗначение = МинЗначение) Тогда
        Тон = 0;
        Насыщенность = 0; // achromatic
    Иначе
        Значение = МаксЗначение - МинЗначение;
        Насыщенность = ?(Светлость > ОснованиеПоловина, 
			Значение / (Основание2 - МаксЗначение - МинЗначение), 
			Значение / (МаксЗначение + МинЗначение));
        Если (МаксЗначение = Красный) Тогда
            Тон = (Зеленый - Синий) / Значение + ?(Зеленый < Синий, Основание6, 0);
        ИначеЕсли МаксЗначение = Зеленый Тогда
            Тон = (Синий - Красный) / Значение + Основание2;
        Иначе
            Тон = (Красный - Зеленый) / Значение + Основание4;
        КонецЕсли;
        
        Тон = Тон / Основание6;
	КонецЕсли;
	
	Тон 			= Окр(Тон * МаксимумЦвет);
	Насыщенность 	= Окр(Насыщенность * МаксимумПроцент);
	Светлость		= Окр(Светлость * МаксимумПроцент);

    Возврат Новый Структура("h, s, l", Тон, Насыщенность, Светлость);
    
КонецФункции

// Конвертирует HSL-структура в абсолютный цвет.
//
// Параметры:
//  СтруктураHSL - исходная структура с представлением цвета.
//	    * h - Число - Hue от 0 до 360.
//	    * s - Число - Saturation от 0 до 100.
//	    * l - Число - Lightness от 0 до 100.
//
// Возвращаемое значение:
//	Цвет - абсолютный цвет.
//
Функция HSLВЦвет(Знач СтруктураHSL) Экспорт
	
	МаксимумЦвет	= 255;
	Два				= 2;
	Три				= 3;
	Половина		= 0.5;
	
    Тон 			= СтруктураHSL.h;
    Насыщенность 	= СтруктураHSL.s;
    Светлость 		= СтруктураHSL.l;
    
    Красный 		= 0;
    Зеленый 		= 0;
    Синий 			= 0;
    
    Если Насыщенность = 0 Тогда
        Красный = Светлость;
        Зеленый = Светлость;
        Синий 	= Светлость;
		
    Иначе
        
        НачальнаяСветлость = ?(Светлость < Половина, 
			Светлость * (1 + Насыщенность), 
			Светлость + Насыщенность - Светлость * Насыщенность);
        КонечнаяСветлость = Два * Светлость - НачальнаяСветлость;
        
        Красный = ТонВЦвет(КонечнаяСветлость, НачальнаяСветлость, Тон + 1 / Три);
        Зеленый = ТонВЦвет(КонечнаяСветлость, НачальнаяСветлость, Тон);
        Синий 	= ТонВЦвет(КонечнаяСветлость, НачальнаяСветлость, Тон - 1 / Три);
        
    КонецЕсли;
    
    Возврат КонструкторЦвета(Красный * МаксимумЦвет, Зеленый * МаксимумЦвет, Синий * МаксимумЦвет);
    
КонецФункции

// Конвертирует HSL-структура в цвет.
//
// Параметры:
//  СтруктураHSL - исходная структура с представлением цвета.
//	    * h - Число - Hue от 0 до 360.
//	    * s - Число - Saturation от 0 до 100.
//	    * l - Число - Lightness от 0 до 100.
//
// Возвращаемое значение:
//	Строка - цвет в формате HEX-строки.
//
Функция HSLВHex(Знач СтруктураHSL) Экспорт
    
    Возврат ЦветВHex(HSLВЦвет(СтруктураHSL));
    
КонецФункции

// Конвертирует цвет в HEX-формате в HSL-структуру.
//
// Параметры:
//  Hex - Строка - исходный цвет в HEX-формате.
//
// Возвращаемое значение:
//  Структура
//	    * h - Число - Hue от 0 до 360.
//	    * s - Число - Saturation от 0 до 100.
//	    * l - Число - lightness от 0 до 100.
//
Функция HexВHSL(Знач Hex) Экспорт
    
    Возврат ЦветВHSL(Hex);
    
КонецФункции

#КонецОбласти

#Область КаталогиЦветов

// Возвращает таблицу Web-цветов с абсолютными цветами.
//
// Возвращаемое значение:
//	Соответствие - Соответствие с цветами.
//
Функция КаталогWebЦветов() Экспорт
	
	Соответствие = Новый Соответствие;
    	
	Соответствие.Вставить(WebЦвета.Аквамарин,					КонструкторЦвета(127, 255, 212));
	Соответствие.Вставить(WebЦвета.АкварельноСиний,				КонструкторЦвета(240, 248, 255));
	Соответствие.Вставить(WebЦвета.АнтикБелый,					КонструкторЦвета(250, 235, 215));
	Соответствие.Вставить(WebЦвета.Бежевый,						КонструкторЦвета(245, 245, 220));
	Соответствие.Вставить(WebЦвета.Белоснежный,					КонструкторЦвета(255, 250, 250));
	Соответствие.Вставить(WebЦвета.Белый,						КонструкторЦвета(255, 255, 255));
	Соответствие.Вставить(WebЦвета.Бирюзовый,					КонструкторЦвета(064, 224, 208));
	Соответствие.Вставить(WebЦвета.БледноБирюзовый,				КонструкторЦвета(175, 238, 238));
	Соответствие.Вставить(WebЦвета.БледноЗеленый,				КонструкторЦвета(152, 251, 152));
	Соответствие.Вставить(WebЦвета.БледноЗолотистый,			КонструкторЦвета(238, 232, 170));
	Соответствие.Вставить(WebЦвета.БледноКрасноФиолетовый,		КонструкторЦвета(219, 112, 147));
	Соответствие.Вставить(WebЦвета.БледноЛиловый,				КонструкторЦвета(230, 230, 250));
	Соответствие.Вставить(WebЦвета.БледноМиндальный,			КонструкторЦвета(255, 235, 205));
	Соответствие.Вставить(WebЦвета.БледноСиреневый,				КонструкторЦвета(216, 191, 216));
	Соответствие.Вставить(WebЦвета.Васильковый,					КонструкторЦвета(100, 149, 237));
	Соответствие.Вставить(WebЦвета.ВесеннеЗеленый,				КонструкторЦвета(000, 255, 127));
	Соответствие.Вставить(WebЦвета.Голубой,						КонструкторЦвета(166, 202, 240));
	Соответствие.Вставить(WebЦвета.ГолубойСКраснымОттенком,		КонструкторЦвета(255, 240, 245));
	Соответствие.Вставить(WebЦвета.ГолубойСоСтальнымОттенком,	КонструкторЦвета(176, 196, 222));
	Соответствие.Вставить(WebЦвета.ГрифельноСерый,				КонструкторЦвета(112, 128, 144));
	Соответствие.Вставить(WebЦвета.ГрифельноСиний,				КонструкторЦвета(106, 090, 205));
	Соответствие.Вставить(WebЦвета.Древесный,					КонструкторЦвета(222, 184, 135));
	Соответствие.Вставить(WebЦвета.ДымчатоБелый,				КонструкторЦвета(245, 245, 245));
	Соответствие.Вставить(WebЦвета.ЖелтоЗеленый,				КонструкторЦвета(154, 205, 050));
	Соответствие.Вставить(WebЦвета.Желтый,						КонструкторЦвета(255, 255, 000));
	Соответствие.Вставить(WebЦвета.ЗамшаСветлый,				КонструкторЦвета(255, 228, 181));
	Соответствие.Вставить(WebЦвета.ЗеленаяЛужайка,				КонструкторЦвета(124, 252, 000));
	Соответствие.Вставить(WebЦвета.ЗеленоЖелтый,				КонструкторЦвета(173, 255, 047));
	Соответствие.Вставить(WebЦвета.ЗеленоватоЖелтый,			КонструкторЦвета(127, 255, 000));
	Соответствие.Вставить(WebЦвета.ЗеленоватоЛимонный,			КонструкторЦвета(000, 255, 000));
	Соответствие.Вставить(WebЦвета.Зеленый,						КонструкторЦвета(000, 128, 000));
	Соответствие.Вставить(WebЦвета.ЗеленыйЛес,					КонструкторЦвета(034, 139, 034));
	Соответствие.Вставить(WebЦвета.Золотистый,					КонструкторЦвета(218, 165, 032));
	Соответствие.Вставить(WebЦвета.Золотой,						КонструкторЦвета(255, 215, 000));
	Соответствие.Вставить(WebЦвета.Индиго,						КонструкторЦвета(075, 000, 130));
	Соответствие.Вставить(WebЦвета.Киноварь,					КонструкторЦвета(205, 092, 092));
	Соответствие.Вставить(WebЦвета.Кирпичный,					КонструкторЦвета(178, 034, 034));
	Соответствие.Вставить(WebЦвета.КожаноКоричневый,			КонструкторЦвета(139, 069, 019));
	Соответствие.Вставить(WebЦвета.Коралловый,					КонструкторЦвета(255, 127, 080));
	Соответствие.Вставить(WebЦвета.Коричневый,					КонструкторЦвета(165, 042, 042));
	Соответствие.Вставить(WebЦвета.КоролевскиГолубой,			КонструкторЦвета(065, 105, 225));
	Соответствие.Вставить(WebЦвета.КрасноФиолетовый,			КонструкторЦвета(208, 032, 144));
	Соответствие.Вставить(WebЦвета.Красный,						КонструкторЦвета(255, 000, 000));
	Соответствие.Вставить(WebЦвета.Кремовый,					КонструкторЦвета(255, 251, 240));
	Соответствие.Вставить(WebЦвета.Лазурный,					КонструкторЦвета(240, 255, 255));
	Соответствие.Вставить(WebЦвета.ЛимонноЗеленый,				КонструкторЦвета(050, 205, 050));
	Соответствие.Вставить(WebЦвета.Лимонный,					КонструкторЦвета(255, 250, 205));
	Соответствие.Вставить(WebЦвета.Лосось,						КонструкторЦвета(250, 128, 114));
	Соответствие.Вставить(WebЦвета.ЛососьСветлый,				КонструкторЦвета(255, 160, 122));
	Соответствие.Вставить(WebЦвета.ЛососьТемный,				КонструкторЦвета(233, 150, 122));
	Соответствие.Вставить(WebЦвета.Льняной,						КонструкторЦвета(250, 240, 230));
	Соответствие.Вставить(WebЦвета.Малиновый,					КонструкторЦвета(220, 020, 060));
	Соответствие.Вставить(WebЦвета.МятныйКрем,					КонструкторЦвета(245, 255, 250));
	Соответствие.Вставить(WebЦвета.НавахоБелый,					КонструкторЦвета(255, 222, 173));
	Соответствие.Вставить(WebЦвета.НасыщенноНебесноГолубой,		КонструкторЦвета(000, 191, 255));
	Соответствие.Вставить(WebЦвета.НасыщенноРозовый,			КонструкторЦвета(255, 020, 147));
	Соответствие.Вставить(WebЦвета.НебесноГолубой,				КонструкторЦвета(135, 206, 235));
	Соответствие.Вставить(WebЦвета.НейтральноАквамариновый,		КонструкторЦвета(102, 205, 170));
	Соответствие.Вставить(WebЦвета.НейтральноБирюзовый,			КонструкторЦвета(072, 209, 204));
	Соответствие.Вставить(WebЦвета.НейтральноВесеннеЗеленый,	КонструкторЦвета(000, 250, 154));
	Соответствие.Вставить(WebЦвета.НейтральноГрифельноСиний,	КонструкторЦвета(123, 104, 238));
	Соответствие.Вставить(WebЦвета.НейтральноЗеленый,			КонструкторЦвета(192, 220, 192));
	Соответствие.Вставить(WebЦвета.НейтральноКоричневый,		КонструкторЦвета(205, 133, 63));
	Соответствие.Вставить(WebЦвета.НейтральноПурпурный,			КонструкторЦвета(147, 112, 219));
	Соответствие.Вставить(WebЦвета.НейтральноСерый,				КонструкторЦвета(160, 160, 164));
	Соответствие.Вставить(WebЦвета.НейтральноСиний,				КонструкторЦвета(000, 000, 205));
	Соответствие.Вставить(WebЦвета.НейтральноФиолетовоКрасный,	КонструкторЦвета(199, 021, 133));
	Соответствие.Вставить(WebЦвета.Оливковый,					КонструкторЦвета(128, 128, 000));
	Соответствие.Вставить(WebЦвета.ОранжевоКрасный,				КонструкторЦвета(255, 069, 000));
	Соответствие.Вставить(WebЦвета.Оранжевый,					КонструкторЦвета(255, 165, 000));
	Соответствие.Вставить(WebЦвета.Орхидея,						КонструкторЦвета(218, 112, 214));
	Соответствие.Вставить(WebЦвета.ОрхидеяНейтральный,			КонструкторЦвета(186, 085, 211));
	Соответствие.Вставить(WebЦвета.ОрхидеяТемный,				КонструкторЦвета(153, 050, 204));
	Соответствие.Вставить(WebЦвета.Охра,						КонструкторЦвета(160, 082, 045));
	Соответствие.Вставить(WebЦвета.Перламутровый,				КонструкторЦвета(255, 245, 238));
	Соответствие.Вставить(WebЦвета.Персиковый,					КонструкторЦвета(255, 218, 185));
	Соответствие.Вставить(WebЦвета.ПесочноКоричневый,			КонструкторЦвета(244, 164, 096));
	Соответствие.Вставить(WebЦвета.ПолночноСиний,				КонструкторЦвета(025, 025, 112));
	Соответствие.Вставить(WebЦвета.ПризрачноБелый,				КонструкторЦвета(248, 248, 255));
	Соответствие.Вставить(WebЦвета.Пурпурный,					КонструкторЦвета(128, 000, 128));
	Соответствие.Вставить(WebЦвета.Пшеничный,					КонструкторЦвета(245, 222, 179));
	Соответствие.Вставить(WebЦвета.РозовоКоричневый,			КонструкторЦвета(188, 143, 143));
	Соответствие.Вставить(WebЦвета.Розовый,						КонструкторЦвета(255, 192, 203));
	Соответствие.Вставить(WebЦвета.Роса,						КонструкторЦвета(240, 255, 240));
	Соответствие.Вставить(WebЦвета.РыжеватоКоричневый,			КонструкторЦвета(210, 180, 140));
	Соответствие.Вставить(WebЦвета.СветлоГрифельноСерый,		КонструкторЦвета(119, 136, 153));
	Соответствие.Вставить(WebЦвета.СветлоГрифельноСиний,		КонструкторЦвета(132, 112, 255));
	Соответствие.Вставить(WebЦвета.СветлоЖелтый,				КонструкторЦвета(255, 255, 224));
	Соответствие.Вставить(WebЦвета.СветлоЖелтыйЗолотистый,		КонструкторЦвета(250, 250, 210));
	Соответствие.Вставить(WebЦвета.СветлоЗеленый,				КонструкторЦвета(144, 238, 144));
	Соответствие.Вставить(WebЦвета.СветлоЗолотистый,			КонструкторЦвета(255, 236, 139));
	Соответствие.Вставить(WebЦвета.СветлоКоралловый,			КонструкторЦвета(240, 128, 128));
	Соответствие.Вставить(WebЦвета.СветлоКоричневый,			КонструкторЦвета(255, 228, 196));
	Соответствие.Вставить(WebЦвета.СветлоНебесноГолубой,		КонструкторЦвета(135, 206, 250));
	Соответствие.Вставить(WebЦвета.СветлоРозовый,				КонструкторЦвета(255, 182, 193));
	Соответствие.Вставить(WebЦвета.СветлоСерый,					КонструкторЦвета(192, 192, 192));
	Соответствие.Вставить(WebЦвета.СеребристоСерый,				КонструкторЦвета(220, 220, 220));
	Соответствие.Вставить(WebЦвета.Серебряный,					КонструкторЦвета(192, 192, 192));
	Соответствие.Вставить(WebЦвета.СероСиний,					КонструкторЦвета(095, 158, 160));
	Соответствие.Вставить(WebЦвета.Серый,						КонструкторЦвета(128, 128, 128));
	Соответствие.Вставить(WebЦвета.СинеСерый,					КонструкторЦвета(030, 144, 255));
	Соответствие.Вставить(WebЦвета.СинеФиолетовый,				КонструкторЦвета(138, 043, 226));
	Соответствие.Вставить(WebЦвета.Синий,						КонструкторЦвета(000, 000, 255));
	Соответствие.Вставить(WebЦвета.СинийСПороховымОттенком,		КонструкторЦвета(176, 224, 230));
	Соответствие.Вставить(WebЦвета.СинийСоСтальнымОттенком,		КонструкторЦвета(070, 130, 180));
	Соответствие.Вставить(WebЦвета.Сливовый,					КонструкторЦвета(221, 160, 221));
	Соответствие.Вставить(WebЦвета.СлоноваяКость,				КонструкторЦвета(255, 255, 240));
	Соответствие.Вставить(WebЦвета.СтароеКружево,				КонструкторЦвета(253, 245, 230));
	Соответствие.Вставить(WebЦвета.ТемноБирюзовый,				КонструкторЦвета(000, 206, 209));
	Соответствие.Вставить(WebЦвета.ТемноБордовый,				КонструкторЦвета(128, 000, 000));
	Соответствие.Вставить(WebЦвета.ТемноГрифельноСерый,			КонструкторЦвета(047, 079, 079));
	Соответствие.Вставить(WebЦвета.ТемноГрифельноСиний,			КонструкторЦвета(072, 061, 139));
	Соответствие.Вставить(WebЦвета.ТемноЗеленый,				КонструкторЦвета(000, 100, 000));
	Соответствие.Вставить(WebЦвета.ТемноЗолотистый,				КонструкторЦвета(184, 134, 011));
	Соответствие.Вставить(WebЦвета.ТемноКрасный,				КонструкторЦвета(139, 000, 000));
	Соответствие.Вставить(WebЦвета.ТемноОливковоЗеленый,		КонструкторЦвета(085, 107, 47));
	Соответствие.Вставить(WebЦвета.ТемноОранжевый,				КонструкторЦвета(255, 140, 000));
	Соответствие.Вставить(WebЦвета.ТемноСерый,					КонструкторЦвета(169, 169, 169));
	Соответствие.Вставить(WebЦвета.ТемноСиний,					КонструкторЦвета(000, 000, 139));
	Соответствие.Вставить(WebЦвета.ТемноФиолетовый,				КонструкторЦвета(148, 000, 211));
	Соответствие.Вставить(WebЦвета.ТеплоРозовый,				КонструкторЦвета(255, 105, 180));
	Соответствие.Вставить(WebЦвета.Томатный,					КонструкторЦвета(255, 099, 071));
	Соответствие.Вставить(WebЦвета.ТопленоеМолоко,				КонструкторЦвета(255, 239, 213));
	Соответствие.Вставить(WebЦвета.ТусклоОливковый,				КонструкторЦвета(107, 142, 035));
	Соответствие.Вставить(WebЦвета.ТусклоРозовый,				КонструкторЦвета(255, 228, 225));
	Соответствие.Вставить(WebЦвета.ТусклоСерый,					КонструкторЦвета(105, 105, 105));
	Соответствие.Вставить(WebЦвета.Ультрамарин,					КонструкторЦвета(000, 000, 128));
	Соответствие.Вставить(WebЦвета.Фиолетовый,					КонструкторЦвета(238, 130, 238));
	Соответствие.Вставить(WebЦвета.Фуксин,						КонструкторЦвета(255, 000, 255));
	Соответствие.Вставить(WebЦвета.ФуксинТемный,				КонструкторЦвета(139, 000, 139));
	Соответствие.Вставить(WebЦвета.Фуксия,						КонструкторЦвета(255, 000, 255));
	Соответствие.Вставить(WebЦвета.Хаки,						КонструкторЦвета(240, 230, 140));
	Соответствие.Вставить(WebЦвета.ХакиТемный,					КонструкторЦвета(189, 183, 107));
	Соответствие.Вставить(WebЦвета.ЦветМорскойВолны,			КонструкторЦвета(046, 139, 087));
	Соответствие.Вставить(WebЦвета.ЦветМорскойВолныНейтральный,	КонструкторЦвета(060, 179, 113));
	Соответствие.Вставить(WebЦвета.ЦветМорскойВолныСветлый,		КонструкторЦвета(032, 178, 170));
	Соответствие.Вставить(WebЦвета.ЦветМорскойВолныТемный,		КонструкторЦвета(143, 188, 139));
	Соответствие.Вставить(WebЦвета.ЦветокБелый,					КонструкторЦвета(255, 250, 240));
	Соответствие.Вставить(WebЦвета.Циан,						КонструкторЦвета(000, 255, 255));
	Соответствие.Вставить(WebЦвета.ЦианАкварельный,				КонструкторЦвета(000, 255, 255));
	Соответствие.Вставить(WebЦвета.ЦианНейтральный,				КонструкторЦвета(000, 128, 128));
	Соответствие.Вставить(WebЦвета.ЦианСветлый,					КонструкторЦвета(224, 255, 255));
	Соответствие.Вставить(WebЦвета.ЦианТемный,					КонструкторЦвета(000, 139, 139));
	Соответствие.Вставить(WebЦвета.Черный,						КонструкторЦвета(000, 000, 000));
	Соответствие.Вставить(WebЦвета.ШелковыйОттенок,				КонструкторЦвета(255, 248, 220));
	Соответствие.Вставить(WebЦвета.Шоколадный,					КонструкторЦвета(210, 105, 30));
	
	Возврат Соответствие;
	
КонецФункции

// Возвращает соответствие каталога RAL Standart.
//
// Возвращаемое значение:
//	Соответствие
//      * Ключ - Строка- Цифровой цвет без префикса RAL. Пример "1001".
//      * Значение - Цвет - цвет.
//
Функция КаталогRALStandart() Экспорт
    
    Соответствие = Новый Соответствие;
    
    Соответствие.Вставить("1000", КонструкторЦвета(190, 189, 127));
    Соответствие.Вставить("1001", КонструкторЦвета(194, 176, 120));
    Соответствие.Вставить("1002", КонструкторЦвета(198, 166, 100));
    Соответствие.Вставить("1003", КонструкторЦвета(229, 190, 001));
    Соответствие.Вставить("1004", КонструкторЦвета(205, 164, 052));
    Соответствие.Вставить("1005", КонструкторЦвета(169, 131, 007));
    Соответствие.Вставить("1006", КонструкторЦвета(228, 160, 016));
    Соответствие.Вставить("1007", КонструкторЦвета(220, 156, 000));
    Соответствие.Вставить("1011", КонструкторЦвета(138, 102, 066));
    Соответствие.Вставить("1012", КонструкторЦвета(199, 180, 070));
    Соответствие.Вставить("1013", КонструкторЦвета(234, 230, 202));
    Соответствие.Вставить("1014", КонструкторЦвета(225, 204, 079));
    Соответствие.Вставить("1015", КонструкторЦвета(230, 214, 144));
    Соответствие.Вставить("1016", КонструкторЦвета(237, 255, 033));
    Соответствие.Вставить("1017", КонструкторЦвета(245, 208, 051));
    Соответствие.Вставить("1018", КонструкторЦвета(248, 243, 053));
    Соответствие.Вставить("1019", КонструкторЦвета(158, 151, 100));
    Соответствие.Вставить("1020", КонструкторЦвета(153, 153, 080));
    Соответствие.Вставить("1021", КонструкторЦвета(243, 218, 011));
    Соответствие.Вставить("1023", КонструкторЦвета(250, 210, 001));
    Соответствие.Вставить("1024", КонструкторЦвета(174, 160, 075));
    Соответствие.Вставить("1026", КонструкторЦвета(255, 255, 000));
    Соответствие.Вставить("1027", КонструкторЦвета(157, 145, 001));
    Соответствие.Вставить("1028", КонструкторЦвета(244, 169, 000));
    Соответствие.Вставить("1032", КонструкторЦвета(214, 174, 001));
    Соответствие.Вставить("1033", КонструкторЦвета(243, 165, 005));
    Соответствие.Вставить("1034", КонструкторЦвета(239, 169, 074));
    Соответствие.Вставить("1035", КонструкторЦвета(106, 093, 077));
    Соответствие.Вставить("1036", КонструкторЦвета(112, 083, 053));
    Соответствие.Вставить("1037", КонструкторЦвета(243, 159, 024));
    Соответствие.Вставить("2000", КонструкторЦвета(237, 118, 014));
    Соответствие.Вставить("2001", КонструкторЦвета(201, 060, 032));
    Соответствие.Вставить("2002", КонструкторЦвета(203, 040, 033));
    Соответствие.Вставить("2003", КонструкторЦвета(255, 117, 020));
    Соответствие.Вставить("2004", КонструкторЦвета(244, 070, 017));
    Соответствие.Вставить("2005", КонструкторЦвета(255, 035, 001));
    Соответствие.Вставить("2007", КонструкторЦвета(255, 164, 032));
    Соответствие.Вставить("2008", КонструкторЦвета(247, 094, 037));
    Соответствие.Вставить("2009", КонструкторЦвета(245, 064, 033));
    Соответствие.Вставить("2010", КонструкторЦвета(216, 075, 032));
    Соответствие.Вставить("2011", КонструкторЦвета(236, 124, 038));
    Соответствие.Вставить("2012", КонструкторЦвета(235, 106, 014));
    Соответствие.Вставить("2013", КонструкторЦвета(195, 088, 049));
    Соответствие.Вставить("3000", КонструкторЦвета(175, 043, 030));
    Соответствие.Вставить("3001", КонструкторЦвета(165, 032, 025));
    Соответствие.Вставить("3002", КонструкторЦвета(162, 035, 029));
    Соответствие.Вставить("3003", КонструкторЦвета(155, 017, 030));
    Соответствие.Вставить("3004", КонструкторЦвета(117, 021, 030));
    Соответствие.Вставить("3005", КонструкторЦвета(094, 033, 041));
    Соответствие.Вставить("3007", КонструкторЦвета(065, 034, 039));
    Соответствие.Вставить("3009", КонструкторЦвета(100, 036, 036));
    Соответствие.Вставить("3011", КонструкторЦвета(120, 031, 025));
    Соответствие.Вставить("3012", КонструкторЦвета(193, 135, 107));
    Соответствие.Вставить("3013", КонструкторЦвета(161, 035, 018));
    Соответствие.Вставить("3014", КонструкторЦвета(211, 110, 112));
    Соответствие.Вставить("3015", КонструкторЦвета(234, 137, 154));
    Соответствие.Вставить("3016", КонструкторЦвета(179, 040, 033));
    Соответствие.Вставить("3017", КонструкторЦвета(230, 050, 068));
    Соответствие.Вставить("3018", КонструкторЦвета(213, 048, 050));
    Соответствие.Вставить("3020", КонструкторЦвета(204, 006, 005));
    Соответствие.Вставить("3022", КонструкторЦвета(217, 080, 048));
    Соответствие.Вставить("3024", КонструкторЦвета(248, 000, 000));
    Соответствие.Вставить("3026", КонструкторЦвета(254, 000, 000));
    Соответствие.Вставить("3027", КонструкторЦвета(197, 029, 052));
    Соответствие.Вставить("3028", КонструкторЦвета(203, 050, 052));
    Соответствие.Вставить("3031", КонструкторЦвета(179, 036, 040));
    Соответствие.Вставить("3032", КонструкторЦвета(114, 020, 034));
    Соответствие.Вставить("3033", КонструкторЦвета(180, 076, 067));
    Соответствие.Вставить("4001", КонструкторЦвета(222, 076, 138));
    Соответствие.Вставить("4002", КонструкторЦвета(146, 043, 062));
    Соответствие.Вставить("4003", КонструкторЦвета(222, 076, 138));
    Соответствие.Вставить("4004", КонструкторЦвета(110, 028, 052));
    Соответствие.Вставить("4005", КонструкторЦвета(108, 070, 117));
    Соответствие.Вставить("4006", КонструкторЦвета(160, 052, 114));
    Соответствие.Вставить("4007", КонструкторЦвета(074, 025, 044));
    Соответствие.Вставить("4008", КонструкторЦвета(144, 070, 132));
    Соответствие.Вставить("4009", КонструкторЦвета(164, 125, 144));
    Соответствие.Вставить("4010", КонструкторЦвета(215, 045, 109));
    Соответствие.Вставить("4011", КонструкторЦвета(134, 115, 161));
    Соответствие.Вставить("4012", КонструкторЦвета(108, 104, 129));
    Соответствие.Вставить("5000", КонструкторЦвета(042, 046, 075));
    Соответствие.Вставить("5001", КонструкторЦвета(031, 052, 056));
    Соответствие.Вставить("5002", КонструкторЦвета(032, 033, 079));
    Соответствие.Вставить("5003", КонструкторЦвета(029, 030, 051));
    Соответствие.Вставить("5004", КонструкторЦвета(032, 033, 079));
    Соответствие.Вставить("5005", КонструкторЦвета(030, 045, 110));
    Соответствие.Вставить("5007", КонструкторЦвета(062, 095, 138));
    Соответствие.Вставить("5008", КонструкторЦвета(038, 037, 045));
    Соответствие.Вставить("5009", КонструкторЦвета(002, 086, 105));
    Соответствие.Вставить("5010", КонструкторЦвета(014, 041, 075));
    Соответствие.Вставить("5011", КонструкторЦвета(035, 026, 036));
    Соответствие.Вставить("5012", КонструкторЦвета(059, 131, 189));
    Соответствие.Вставить("5013", КонструкторЦвета(037, 041, 074));
    Соответствие.Вставить("5014", КонструкторЦвета(096, 111, 140));
    Соответствие.Вставить("5015", КонструкторЦвета(034, 113, 179));
    Соответствие.Вставить("5017", КонструкторЦвета(006, 057, 113));
    Соответствие.Вставить("5018", КонструкторЦвета(063, 136, 143));
    Соответствие.Вставить("5019", КонструкторЦвета(027, 085, 131));
    Соответствие.Вставить("5020", КонструкторЦвета(029, 051, 074));
    Соответствие.Вставить("5021", КонструкторЦвета(037, 109, 123));
    Соответствие.Вставить("5022", КонструкторЦвета(037, 040, 080));
    Соответствие.Вставить("5023", КонструкторЦвета(073, 103, 141));
    Соответствие.Вставить("5024", КонструкторЦвета(093, 155, 155));
    Соответствие.Вставить("5025", КонструкторЦвета(042, 100, 120));
    Соответствие.Вставить("5026", КонструкторЦвета(016, 044, 084));
    Соответствие.Вставить("6000", КонструкторЦвета(049, 102, 080));
    Соответствие.Вставить("6001", КонструкторЦвета(040, 114, 051));
    Соответствие.Вставить("6002", КонструкторЦвета(045, 087, 044));
    Соответствие.Вставить("6003", КонструкторЦвета(066, 070, 050));
    Соответствие.Вставить("6004", КонструкторЦвета(031, 058, 061));
    Соответствие.Вставить("6005", КонструкторЦвета(047, 069, 056));
    Соответствие.Вставить("6006", КонструкторЦвета(062, 059, 050));
    Соответствие.Вставить("6007", КонструкторЦвета(052, 059, 041));
    Соответствие.Вставить("6008", КонструкторЦвета(057, 053, 042));
    Соответствие.Вставить("6009", КонструкторЦвета(049, 055, 043));
    Соответствие.Вставить("6010", КонструкторЦвета(053, 104, 045));
    Соответствие.Вставить("6011", КонструкторЦвета(088, 114, 070));
    Соответствие.Вставить("6012", КонструкторЦвета(052, 062, 064));
    Соответствие.Вставить("6013", КонструкторЦвета(108, 113, 086));
    Соответствие.Вставить("6014", КонструкторЦвета(071, 064, 046));
    Соответствие.Вставить("6015", КонструкторЦвета(059, 060, 054));
    Соответствие.Вставить("6016", КонструкторЦвета(030, 089, 069));
    Соответствие.Вставить("6017", КонструкторЦвета(076, 145, 065));
    Соответствие.Вставить("6018", КонструкторЦвета(087, 166, 057));
    Соответствие.Вставить("6019", КонструкторЦвета(189, 236, 182));
    Соответствие.Вставить("6020", КонструкторЦвета(046, 058, 035));
    Соответствие.Вставить("6021", КонструкторЦвета(137, 172, 118));
    Соответствие.Вставить("6022", КонструкторЦвета(037, 034, 027));
    Соответствие.Вставить("6024", КонструкторЦвета(048, 132, 070));
    Соответствие.Вставить("6025", КонструкторЦвета(061, 100, 045));
    Соответствие.Вставить("6026", КонструкторЦвета(001, 093, 082));
    Соответствие.Вставить("6027", КонструкторЦвета(132, 195, 190));
    Соответствие.Вставить("6028", КонструкторЦвета(044, 085, 069));
    Соответствие.Вставить("6029", КонструкторЦвета(032, 096, 061));
    Соответствие.Вставить("6032", КонструкторЦвета(049, 127, 067));
    Соответствие.Вставить("6033", КонструкторЦвета(073, 126, 118));
    Соответствие.Вставить("6034", КонструкторЦвета(127, 181, 181));
    Соответствие.Вставить("6035", КонструкторЦвета(028, 084, 045));
    Соответствие.Вставить("6036", КонструкторЦвета(022, 053, 055));
    Соответствие.Вставить("6037", КонструкторЦвета(000, 143, 057));
    Соответствие.Вставить("6038", КонструкторЦвета(000, 187, 045));
    Соответствие.Вставить("7000", КонструкторЦвета(120, 133, 139));
    Соответствие.Вставить("7001", КонструкторЦвета(138, 149, 151));
    Соответствие.Вставить("7002", КонструкторЦвета(126, 123, 082));
    Соответствие.Вставить("7003", КонструкторЦвета(108, 112, 089));
    Соответствие.Вставить("7004", КонструкторЦвета(150, 153, 146));
    Соответствие.Вставить("7005", КонструкторЦвета(100, 107, 099));
    Соответствие.Вставить("7006", КонструкторЦвета(109, 101, 082));
    Соответствие.Вставить("7008", КонструкторЦвета(106, 095, 049));
    Соответствие.Вставить("7009", КонструкторЦвета(077, 086, 069));
    Соответствие.Вставить("7010", КонструкторЦвета(076, 081, 074));
    Соответствие.Вставить("7011", КонструкторЦвета(067, 075, 077));
    Соответствие.Вставить("7012", КонструкторЦвета(078, 087, 084));
    Соответствие.Вставить("7013", КонструкторЦвета(070, 069, 049));
    Соответствие.Вставить("7015", КонструкторЦвета(067, 071, 080));
    Соответствие.Вставить("7016", КонструкторЦвета(041, 049, 051));
    Соответствие.Вставить("7021", КонструкторЦвета(035, 040, 043));
    Соответствие.Вставить("7022", КонструкторЦвета(051, 047, 044));
    Соответствие.Вставить("7023", КонструкторЦвета(104, 108, 094));
    Соответствие.Вставить("7024", КонструкторЦвета(071, 074, 081));
    Соответствие.Вставить("7026", КонструкторЦвета(047, 053, 059));
    Соответствие.Вставить("7030", КонструкторЦвета(139, 140, 122));
    Соответствие.Вставить("7031", КонструкторЦвета(071, 075, 078));
    Соответствие.Вставить("7032", КонструкторЦвета(184, 183, 153));
    Соответствие.Вставить("7033", КонструкторЦвета(125, 132, 113));
    Соответствие.Вставить("7034", КонструкторЦвета(143, 139, 102));
    Соответствие.Вставить("7035", КонструкторЦвета(215, 215, 215));
    Соответствие.Вставить("7036", КонструкторЦвета(127, 118, 121));
    Соответствие.Вставить("7037", КонструкторЦвета(125, 127, 120));
    Соответствие.Вставить("7038", КонструкторЦвета(195, 195, 195));
    Соответствие.Вставить("7039", КонструкторЦвета(108, 105, 096));
    Соответствие.Вставить("7040", КонструкторЦвета(157, 161, 170));
    Соответствие.Вставить("7042", КонструкторЦвета(141, 148, 141));
    Соответствие.Вставить("7043", КонструкторЦвета(078, 084, 082));
    Соответствие.Вставить("7044", КонструкторЦвета(202, 196, 176));
    Соответствие.Вставить("7045", КонструкторЦвета(144, 144, 144));
    Соответствие.Вставить("7046", КонструкторЦвета(130, 137, 143));
    Соответствие.Вставить("7047", КонструкторЦвета(208, 208, 208));
    Соответствие.Вставить("7048", КонструкторЦвета(137, 129, 118));
    Соответствие.Вставить("8000", КонструкторЦвета(130, 108, 052));
    Соответствие.Вставить("8001", КонструкторЦвета(149, 095, 032));
    Соответствие.Вставить("8002", КонструкторЦвета(108, 059, 042));
    Соответствие.Вставить("8003", КонструкторЦвета(115, 066, 034));
    Соответствие.Вставить("8004", КонструкторЦвета(142, 064, 042));
    Соответствие.Вставить("8007", КонструкторЦвета(089, 053, 031));
    Соответствие.Вставить("8008", КонструкторЦвета(111, 079, 040));
    Соответствие.Вставить("8011", КонструкторЦвета(091, 058, 041));
    Соответствие.Вставить("8012", КонструкторЦвета(089, 035, 033));
    Соответствие.Вставить("8014", КонструкторЦвета(056, 044, 030));
    Соответствие.Вставить("8015", КонструкторЦвета(099, 058, 052));
    Соответствие.Вставить("8016", КонструкторЦвета(076, 047, 039));
    Соответствие.Вставить("8017", КонструкторЦвета(069, 050, 046));
    Соответствие.Вставить("8019", КонструкторЦвета(064, 058, 058));
    Соответствие.Вставить("8022", КонструкторЦвета(033, 033, 033));
    Соответствие.Вставить("8023", КонструкторЦвета(166, 094, 046));
    Соответствие.Вставить("8024", КонструкторЦвета(121, 085, 061));
    Соответствие.Вставить("8025", КонструкторЦвета(117, 092, 072));
    Соответствие.Вставить("8028", КонструкторЦвета(078, 059, 049));
    Соответствие.Вставить("8029", КонструкторЦвета(118, 060, 040));
    Соответствие.Вставить("9001", КонструкторЦвета(250, 244, 227));
    Соответствие.Вставить("9002", КонструкторЦвета(231, 235, 218));
    Соответствие.Вставить("9003", КонструкторЦвета(244, 244, 244));
    Соответствие.Вставить("9004", КонструкторЦвета(040, 040, 040));
    Соответствие.Вставить("9005", КонструкторЦвета(010, 010, 013));
    Соответствие.Вставить("9006", КонструкторЦвета(165, 165, 165));
    Соответствие.Вставить("9007", КонструкторЦвета(143, 143, 143));
    Соответствие.Вставить("9010", КонструкторЦвета(255, 255, 255));
    Соответствие.Вставить("9011", КонструкторЦвета(028, 028, 028));
    Соответствие.Вставить("9016", КонструкторЦвета(246, 246, 246));
    Соответствие.Вставить("9017", КонструкторЦвета(030, 030, 030));
    Соответствие.Вставить("9018", КонструкторЦвета(215, 215, 215));
    Соответствие.Вставить("9022", КонструкторЦвета(156, 156, 156));
    Соответствие.Вставить("9023", КонструкторЦвета(130, 130, 130));    
    
    Возврат Соответствие;
    
КонецФункции

// Возвращает соответствие каталога RAL Design.
//
// Возвращаемое значение:
//	Соответствие
//		* Ключ - Строка- Цифровой цвет без префикса RAL. Пример "000 20 00" = "RAL 000 20 00".
//      * Значение - Цвет - цвет.
//
Функция КаталогRALDesign() Экспорт
    
    Соответствие = Новый Соответствие;
    
    Соответствие.Вставить("000 15 00", КонструкторЦвета(046, 048, 050));
    Соответствие.Вставить("000 20 00", КонструкторЦвета(55, 57, 59));
    Соответствие.Вставить("000 25 00", КонструкторЦвета(65, 67, 69));
    Соответствие.Вставить("000 30 00", КонструкторЦвета(74, 75, 76));
    Соответствие.Вставить("000 35 00", КонструкторЦвета(86, 87, 88));
    Соответствие.Вставить("000 40 00", КонструкторЦвета(96, 97, 98));
    Соответствие.Вставить("000 45 00", КонструкторЦвета(11, 11, 112));
    Соответствие.Вставить("000 50 00", КонструкторЦвета(12, 12, 122));
    Соответствие.Вставить("000 55 00", КонструкторЦвета(13, 13, 133));
    Соответствие.Вставить("000 60 00", КонструкторЦвета(14, 14, 147));
    Соответствие.Вставить("000 65 00", КонструкторЦвета(15, 16, 162));
    Соответствие.Вставить("000 70 00", КонструкторЦвета(17, 17, 175));
    Соответствие.Вставить("000 75 00", КонструкторЦвета(18, 18, 190));
    Соответствие.Вставить("000 80 00", КонструкторЦвета(20, 20, 204));
    Соответствие.Вставить("000 85 00", КонструкторЦвета(21, 21, 214));
    Соответствие.Вставить("000 90 00", КонструкторЦвета(22, 22, 226));
    Соответствие.Вставить("010 20 15", КонструкторЦвета(74, 46, 53));
    Соответствие.Вставить("010 20 20", КонструкторЦвета(81, 45, 53));
    Соответствие.Вставить("010 20 25", КонструкторЦвета(87, 42, 54));
    Соответствие.Вставить("010 30 15", КонструкторЦвета(99, 68, 75));
    Соответствие.Вставить("010 30 20", КонструкторЦвета(107, 64, 74));
    Соответствие.Вставить("010 30 25", КонструкторЦвета(115, 62, 74));
    Соответствие.Вставить("010 30 30", КонструкторЦвета(122, 57, 72));
    Соответствие.Вставить("010 30 35", КонструкторЦвета(124, 50, 68));
    Соответствие.Вставить("010 30 40", КонструкторЦвета(132, 42, 66));
    Соответствие.Вставить("010 30 44", КонструкторЦвета(140, 33, 67));
    Соответствие.Вставить("010 40 10", КонструкторЦвета(117, 95, 98));
    Соответствие.Вставить("010 40 15", КонструкторЦвета(125, 90, 96));
    Соответствие.Вставить("010 40 20", КонструкторЦвета(132, 85, 94));
    Соответствие.Вставить("010 40 25", КонструкторЦвета(141, 83, 95));
    Соответствие.Вставить("010 40 30", КонструкторЦвета(148, 78, 92));
    Соответствие.Вставить("010 40 35", КонструкторЦвета(152, 72, 89));
    Соответствие.Вставить("010 40 40", КонструкторЦвета(161, 67, 91));
    Соответствие.Вставить("010 40 45", КонструкторЦвета(168, 61, 89));
    Соответствие.Вставить("010 40 50", КонструкторЦвета(174, 53, 88));
    Соответствие.Вставить("010 40 53", КонструкторЦвета(178, 44, 84));
    Соответствие.Вставить("010 50 10", КонструкторЦвета(14, 11, 123));
    Соответствие.Вставить("010 50 15", КонструкторЦвета(14, 11, 121));
    Соответствие.Вставить("010 50 20", КонструкторЦвета(15, 10, 119));
    Соответствие.Вставить("010 50 25", КонструкторЦвета(16, 10, 118));
    Соответствие.Вставить("010 50 30", КонструкторЦвета(17, 10, 115));
    Соответствие.Вставить("010 50 35", КонструкторЦвета(180, 9, 114));
    Соответствие.Вставить("010 50 40", КонструкторЦвета(186, 9, 112));
    Соответствие.Вставить("010 50 45", КонструкторЦвета(193, 8, 111));
    Соответствие.Вставить("010 50 50", КонструкторЦвета(204, 7, 110));
    Соответствие.Вставить("010 60 10", КонструкторЦвета(16, 14, 145));
    Соответствие.Вставить("010 60 15", КонструкторЦвета(17, 13, 145));
    Соответствие.Вставить("010 60 20", КонструкторЦвета(18, 13, 144));
    Соответствие.Вставить("010 60 25", КонструкторЦвета(19, 12, 143));
    Соответствие.Вставить("010 60 30", КонструкторЦвета(20, 12, 141));
    Соответствие.Вставить("010 60 35", КонструкторЦвета(21, 12, 140));
    Соответствие.Вставить("010 60 40", КонструкторЦвета(22, 11, 139));
    Соответствие.Вставить("010 60 45", КонструкторЦвета(23, 10, 137));
    Соответствие.Вставить("010 70 10", КонструкторЦвета(19, 16, 174));
    Соответствие.Вставить("010 70 15", КонструкторЦвета(20, 16, 170));
    Соответствие.Вставить("010 70 20", КонструкторЦвета(21, 16, 170));
    Соответствие.Вставить("010 70 25", КонструкторЦвета(22, 15, 168));
    Соответствие.Вставить("010 70 30", КонструкторЦвета(23, 15, 167));
    Соответствие.Вставить("010 70 35", КонструкторЦвета(24, 14, 166));
    Соответствие.Вставить("010 80 10", КонструкторЦвета(22, 19, 199));
    Соответствие.Вставить("010 80 15", КонструкторЦвета(23, 19, 197));
    Соответствие.Вставить("010 80 20", КонструкторЦвета(24, 18, 195));
    Соответствие.Вставить("010 90 05", КонструкторЦвета(24, 22, 227));
    Соответствие.Вставить("010 90 10", КонструкторЦвета(24, 22, 220));
    Соответствие.Вставить("010 92 05", КонструкторЦвета(24, 23, 234));
    Соответствие.Вставить("020 20 05", КонструкторЦвета(61, 53, 55));
    Соответствие.Вставить("020 20 10", КонструкторЦвета(71, 52, 54));
    Соответствие.Вставить("020 20 20", КонструкторЦвета(83, 48, 52));
    Соответствие.Вставить("020 20 29", КонструкторЦвета(92, 37, 45));
    Соответствие.Вставить("020 30 05", КонструкторЦвета(83, 73, 75));
    Соответствие.Вставить("020 30 10", КонструкторЦвета(92, 70, 72));
    Соответствие.Вставить("020 30 20", КонструкторЦвета(105, 63, 67));
    Соответствие.Вставить("020 30 30", КонструкторЦвета(120, 58, 65));
    Соответствие.Вставить("020 30 40", КонструкторЦвета(133, 46, 61));
    Соответствие.Вставить("020 30 48", КонструкторЦвета(138, 32, 54));
    Соответствие.Вставить("020 40 05", КонструкторЦвета(107, 97, 97));
    Соответствие.Вставить("020 40 10", КонструкторЦвета(114, 94, 95));
    Соответствие.Вставить("020 40 20", КонструкторЦвета(131, 87, 89));
    Соответствие.Вставить("020 40 30", КонструкторЦвета(145, 78, 84));
    Соответствие.Вставить("020 40 40", КонструкторЦвета(156, 68, 78));
    Соответствие.Вставить("020 40 50", КонструкторЦвета(171, 51, 72));
    Соответствие.Вставить("020 50 05", КонструкторЦвета(13, 12, 120));
    Соответствие.Вставить("020 50 10", КонструкторЦвета(14, 11, 116));
    Соответствие.Вставить("020 50 20", КонструкторЦвета(15, 10, 112));
    Соответствие.Вставить("020 50 30", КонструкторЦвета(17, 10, 107));
    Соответствие.Вставить("020 50 40", КонструкторЦвета(184, 9, 101));
    Соответствие.Вставить("020 50 50", КонструкторЦвета(198, 79, 95));
    Соответствие.Вставить("020 50 58", КонструкторЦвета(216, 67, 90));
    Соответствие.Вставить("020 60 05", КонструкторЦвета(15, 14, 144));
    Соответствие.Вставить("020 60 10", КонструкторЦвета(16, 14, 144));
    Соответствие.Вставить("020 60 20", КонструкторЦвета(18, 13, 137));
    Соответствие.Вставить("020 60 30", КонструкторЦвета(20, 12, 132));
    Соответствие.Вставить("020 60 40", КонструкторЦвета(21, 11, 126));
    Соответствие.Вставить("020 70 05", КонструкторЦвета(18, 17, 172));
    Соответствие.Вставить("020 70 10", КонструкторЦвета(19, 16, 169));
    Соответствие.Вставить("020 70 20", КонструкторЦвета(21, 16, 165));
    Соответствие.Вставить("020 70 30", КонструкторЦвета(23, 15, 160));
    Соответствие.Вставить("020 80 05", КонструкторЦвета(21, 20, 199));
    Соответствие.Вставить("020 80 10", КонструкторЦвета(22, 19, 195));
    Соответствие.Вставить("020 80 20", КонструкторЦвета(24, 18, 192));
    Соответствие.Вставить("020 90 05", КонструкторЦвета(24, 22, 224));
    Соответствие.Вставить("020 90 10", КонструкторЦвета(24, 22, 221));
    Соответствие.Вставить("030 30 20", КонструкторЦвета(104, 67, 66));
    Соответствие.Вставить("030 30 30", КонструкторЦвета(116, 60, 58));
    Соответствие.Вставить("030 30 40", КонструкторЦвета(127, 52, 54));
    Соответствие.Вставить("030 30 45", КонструкторЦвета(133, 42, 48));
    Соответствие.Вставить("030 40 10", КонструкторЦвета(113, 94, 93));
    Соответствие.Вставить("030 40 20", КонструкторЦвета(131, 90, 88));
    Соответствие.Вставить("030 40 30", КонструкторЦвета(144, 82, 79));
    Соответствие.Вставить("030 40 40", КонструкторЦвета(158, 72, 71));
    Соответствие.Вставить("030 40 50", КонструкторЦвета(172, 63, 68));
    Соответствие.Вставить("030 40 60", КонструкторЦвета(181, 49, 61));
    Соответствие.Вставить("030 50 10", КонструкторЦвета(14, 11, 115));
    Соответствие.Вставить("030 50 20", КонструкторЦвета(15, 11, 108));
    Соответствие.Вставить("030 50 30", КонструкторЦвета(17, 103, 98));
    Соответствие.Вставить("030 50 40", КонструкторЦвета(186, 97, 94));
    Соответствие.Вставить("030 50 50", КонструкторЦвета(198, 86, 85));
    Соответствие.Вставить("030 50 60", КонструкторЦвета(213, 73, 76));
    Соответствие.Вставить("030 60 10", КонструкторЦвета(16, 14, 141));
    Соответствие.Вставить("030 60 20", КонструкторЦвета(18, 13, 131));
    Соответствие.Вставить("030 60 30", КонструкторЦвета(20, 13, 125));
    Соответствие.Вставить("030 60 40", КонструкторЦвета(21, 12, 117));
    Соответствие.Вставить("030 60 50", КонструкторЦвета(23, 11, 108));
    Соответствие.Вставить("030 70 10", КонструкторЦвета(19, 17, 167));
    Соответствие.Вставить("030 70 20", КонструкторЦвета(21, 16, 155));
    Соответствие.Вставить("030 70 30", КонструкторЦвета(23, 15, 147));
    Соответствие.Вставить("030 70 40", КонструкторЦвета(24, 14, 141));
    Соответствие.Вставить("030 80 10", КонструкторЦвета(22, 19, 191));
    Соответствие.Вставить("030 80 20", КонструкторЦвета(24, 18, 182));
    Соответствие.Вставить("030 90 05", КонструкторЦвета(24, 22, 224));
    Соответствие.Вставить("030 90 10", КонструкторЦвета(24, 22, 219));
    Соответствие.Вставить("040 20 19", КонструкторЦвета(79, 50, 44));
    Соответствие.Вставить("040 30 05", КонструкторЦвета(82, 74, 72));
    Соответствие.Вставить("040 30 10", КонструкторЦвета(89, 72, 67));
    Соответствие.Вставить("040 30 20", КонструкторЦвета(100, 67, 58));
    Соответствие.Вставить("040 30 30", КонструкторЦвета(115, 63, 54));
    Соответствие.Вставить("040 30 40", КонструкторЦвета(125, 58, 49));
    Соответствие.Вставить("040 40 05", КонструкторЦвета(108, 98, 97));
    Соответствие.Вставить("040 40 10", КонструкторЦвета(113, 95, 90));
    Соответствие.Вставить("040 40 20", КонструкторЦвета(125, 90, 80));
    Соответствие.Вставить("040 40 30", КонструкторЦвета(139, 85, 71));
    Соответствие.Вставить("040 40 40", КонструкторЦвета(151, 77, 59));
    Соответствие.Вставить("040 40 50", КонструкторЦвета(161, 70, 51));
    Соответствие.Вставить("040 40 60", КонструкторЦвета(171, 60, 43));
    Соответствие.Вставить("040 40 67", КонструкторЦвета(180, 52, 38));
    Соответствие.Вставить("040 50 05", КонструкторЦвета(12, 12, 118));
    Соответствие.Вставить("040 50 10", КонструкторЦвета(13, 11, 111));
    Соответствие.Вставить("040 50 20", КонструкторЦвета(15, 11, 102));
    Соответствие.Вставить("040 50 30", КонструкторЦвета(16, 109, 92));
    Соответствие.Вставить("040 50 40", КонструкторЦвета(18, 101, 80));
    Соответствие.Вставить("040 50 50", КонструкторЦвета(195, 95, 71));
    Соответствие.Вставить("040 50 60", КонструкторЦвета(206, 86, 61));
    Соответствие.Вставить("040 50 70", КонструкторЦвета(218, 76, 55));
    Соответствие.Вставить("040 60 05", КонструкторЦвета(15, 14, 144));
    Соответствие.Вставить("040 60 10", КонструкторЦвета(16, 14, 136));
    Соответствие.Вставить("040 60 20", КонструкторЦвета(17, 13, 126));
    Соответствие.Вставить("040 60 30", КонструкторЦвета(19, 13, 114));
    Соответствие.Вставить("040 60 40", КонструкторЦвета(20, 12, 103));
    Соответствие.Вставить("040 60 50", КонструкторЦвета(22, 120, 93));
    Соответствие.Вставить("040 60 60", КонструкторЦвета(23, 113, 82));
    Соответствие.Вставить("040 70 05", КонструкторЦвета(18, 17, 169));
    Соответствие.Вставить("040 70 10", КонструкторЦвета(19, 16, 163));
    Соответствие.Вставить("040 70 20", КонструкторЦвета(21, 16, 151));
    Соответствие.Вставить("040 70 30", КонструкторЦвета(22, 15, 139));
    Соответствие.Вставить("040 70 40", КонструкторЦвета(23, 15, 129));
    Соответствие.Вставить("040 70 50", КонструкторЦвета(25, 14, 115));
    Соответствие.Вставить("040 80 05", КонструкторЦвета(21, 20, 196));
    Соответствие.Вставить("040 80 10", КонструкторЦвета(22, 20, 190));
    Соответствие.Вставить("040 80 20", КонструкторЦвета(24, 19, 179));
    Соответствие.Вставить("040 80 30", КонструкторЦвета(24, 18, 166));
    Соответствие.Вставить("040 90 05", КонструкторЦвета(23, 22, 221));
    Соответствие.Вставить("040 90 10", КонструкторЦвета(24, 22, 216));
    Соответствие.Вставить("050 20 10", КонструкторЦвета(68, 58, 54));
    Соответствие.Вставить("050 20 16", КонструкторЦвета(72, 51, 42));
    Соответствие.Вставить("050 30 20", КонструкторЦвета(98, 70, 55));
    Соответствие.Вставить("050 30 30", КонструкторЦвета(111, 67, 50));
    Соответствие.Вставить("050 30 36", КонструкторЦвета(116, 65, 43));
    Соответствие.Вставить("050 40 10", КонструкторЦвета(109, 95, 86));
    Соответствие.Вставить("050 40 20", КонструкторЦвета(122, 92, 75));
    Соответствие.Вставить("050 40 30", КонструкторЦвета(131, 86, 62));
    Соответствие.Вставить("050 40 40", КонструкторЦвета(143, 82, 49));
    Соответствие.Вставить("050 40 50", КонструкторЦвета(153, 76, 43));
    Соответствие.Вставить("050 50 10", КонструкторЦвета(13, 12, 111));
    Соответствие.Вставить("050 50 20", КонструкторЦвета(14, 117, 97));
    Соответствие.Вставить("050 50 30", КонструкторЦвета(16, 113, 84));
    Соответствие.Вставить("050 50 40", КонструкторЦвета(17, 107, 73));
    Соответствие.Вставить("050 50 50", КонструкторЦвета(18, 103, 61));
    Соответствие.Вставить("050 50 60", КонструкторЦвета(192, 97, 49));
    Соответствие.Вставить("050 50 70", КонструкторЦвета(204, 94, 40));
    Соответствие.Вставить("050 50 78", КонструкторЦвета(212, 96, 37));
    Соответствие.Вставить("050 60 10", КонструкторЦвета(16, 14, 132));
    Соответствие.Вставить("050 60 20", КонструкторЦвета(17, 13, 119));
    Соответствие.Вставить("050 60 30", КонструкторЦвета(19, 13, 107));
    Соответствие.Вставить("050 60 40", КонструкторЦвета(20, 133, 96));
    Соответствие.Вставить("050 60 50", КонструкторЦвета(21, 129, 81));
    Соответствие.Вставить("050 60 60", КонструкторЦвета(22, 123, 66));
    Соответствие.Вставить("050 60 70", КонструкторЦвета(23, 116, 54));
    Соответствие.Вставить("050 60 80", КонструкторЦвета(24, 106, 35));
    Соответствие.Вставить("050 70 10", КонструкторЦвета(18, 17, 162));
    Соответствие.Вставить("050 70 20", КонструкторЦвета(20, 16, 148));
    Соответствие.Вставить("050 70 30", КонструкторЦвета(22, 16, 132));
    Соответствие.Вставить("050 70 40", КонструкторЦвета(23, 15, 120));
    Соответствие.Вставить("050 70 50", КонструкторЦвета(24, 15, 107));
    Соответствие.Вставить("050 70 60", КонструкторЦвета(25, 147, 90));
    Соответствие.Вставить("050 80 10", КонструкторЦвета(21, 20, 188));
    Соответствие.Вставить("050 80 20", КонструкторЦвета(23, 19, 170));
    Соответствие.Вставить("050 80 30", КонструкторЦвета(24, 18, 157));
    Соответствие.Вставить("050 90 05", КонструкторЦвета(24, 22, 220));
    Соответствие.Вставить("050 90 10", КонструкторЦвета(24, 22, 213));
    Соответствие.Вставить("050 92 05", КонструкторЦвета(23, 23, 226));
    Соответствие.Вставить("060 20 05", КонструкторЦвета(59, 56, 53));
    Соответствие.Вставить("060 30 05", КонструкторЦвета(80, 75, 71));
    Соответствие.Вставить("060 30 10", КонструкторЦвета(85, 73, 64));
    Соответствие.Вставить("060 30 20", КонструкторЦвета(93, 74, 56));
    Соответствие.Вставить("060 30 27", КонструкторЦвета(100, 70, 43));
    Соответствие.Вставить("060 40 05", КонструкторЦвета(104, 98, 92));
    Соответствие.Вставить("060 40 10", КонструкторЦвета(109, 96, 84));
    Соответствие.Вставить("060 40 20", КонструкторЦвета(121, 96, 74));
    Соответствие.Вставить("060 40 30", КонструкторЦвета(128, 93, 59));
    Соответствие.Вставить("060 40 40", КонструкторЦвета(138, 91, 49));
    Соответствие.Вставить("060 50 05", КонструкторЦвета(12, 12, 116));
    Соответствие.Вставить("060 50 10", КонструкторЦвета(13, 12, 109));
    Соответствие.Вставить("060 50 20", КонструкторЦвета(14, 119, 93));
    Соответствие.Вставить("060 50 30", КонструкторЦвета(15, 118, 81));
    Соответствие.Вставить("060 50 40", КонструкторЦвета(16, 114, 67));
    Соответствие.Вставить("060 50 50", КонструкторЦвета(17, 110, 55));
    Соответствие.Вставить("060 50 60", КонструкторЦвета(18, 103, 33));
    Соответствие.Вставить("060 50 70", КонструкторЦвета(18, 102, 24));
    Соответствие.Вставить("060 60 05", КонструкторЦвета(15, 14, 141));
    Соответствие.Вставить("060 60 10", КонструкторЦвета(16, 14, 132));
    Соответствие.Вставить("060 60 20", КонструкторЦвета(17, 14, 117));
    Соответствие.Вставить("060 60 30", КонструкторЦвета(18, 14, 104));
    Соответствие.Вставить("060 60 40", КонструкторЦвета(19, 140, 87));
    Соответствие.Вставить("060 60 50", КонструкторЦвета(20, 134, 71));
    Соответствие.Вставить("060 60 60", КонструкторЦвета(21, 132, 53));
    Соответствие.Вставить("060 60 70", КонструкторЦвета(22, 127, 36));
    Соответствие.Вставить("060 60 80", КонструкторЦвета(23, 123, 25));
    Соответствие.Вставить("060 70 05", КонструкторЦвета(18, 17, 167));
    Соответствие.Вставить("060 70 10", КонструкторЦвета(18, 17, 160));
    Соответствие.Вставить("060 70 20", КонструкторЦвета(19, 17, 144));
    Соответствие.Вставить("060 70 30", КонструкторЦвета(21, 16, 128));
    Соответствие.Вставить("060 70 40", КонструкторЦвета(22, 16, 112));
    Соответствие.Вставить("060 70 50", КонструкторЦвета(23, 162, 97));
    Соответствие.Вставить("060 70 60", КонструкторЦвета(24, 157, 78));
    Соответствие.Вставить("060 70 70", КонструкторЦвета(25, 154, 57));
    Соответствие.Вставить("060 80 10", КонструкторЦвета(21, 20, 184));
    Соответствие.Вставить("060 80 20", КонструкторЦвета(22, 20, 170));
    Соответствие.Вставить("060 80 30", КонструкторЦвета(24, 19, 150));
    Соответствие.Вставить("060 80 40", КонструкторЦвета(24, 19, 131));
    Соответствие.Вставить("060 90 05", КонструкторЦвета(23, 23, 218));
    Соответствие.Вставить("060 90 10", КонструкторЦвета(24, 22, 211));
    Соответствие.Вставить("060 90 15", КонструкторЦвета(24, 22, 202));
    Соответствие.Вставить("070 30 20", КонструкторЦвета(90, 76, 55));
    Соответствие.Вставить("070 40 10", КонструкторЦвета(104, 98, 85));
    Соответствие.Вставить("070 40 20", КонструкторЦвета(113, 97, 68));
    Соответствие.Вставить("070 40 30", КонструкторЦвета(122, 95, 55));
    Соответствие.Вставить("070 40 40", КонструкторЦвета(127, 94, 40));
    Соответствие.Вставить("070 50 10", КонструкторЦвета(13, 12, 107));
    Соответствие.Вставить("070 50 20", КонструкторЦвета(13, 120, 91));
    Соответствие.Вставить("070 50 30", КонструкторЦвета(14, 118, 73));
    Соответствие.Вставить("070 50 40", КонструкторЦвета(15, 118, 57));
    Соответствие.Вставить("070 50 50", КонструкторЦвета(15, 118, 51));
    Соответствие.Вставить("070 50 55", КонструкторЦвета(16, 118, 43));
    Соответствие.Вставить("070 60 10", КонструкторЦвета(15, 14, 130));
    Соответствие.Вставить("070 60 20", КонструкторЦвета(16, 14, 116));
    Соответствие.Вставить("070 60 30", КонструкторЦвета(17, 143, 97));
    Соответствие.Вставить("070 60 40", КонструкторЦвета(17, 142, 78));
    Соответствие.Вставить("070 60 50", КонструкторЦвета(18, 143, 63));
    Соответствие.Вставить("070 60 60", КонструкторЦвета(19, 141, 46));
    Соответствие.Вставить("070 60 70", КонструкторЦвета(20, 138, 33));
    Соответствие.Вставить("070 60 75", КонструкторЦвета(20, 139, 19));
    Соответствие.Вставить("070 70 10", КонструкторЦвета(18, 17, 157));
    Соответствие.Вставить("070 70 20", КонструкторЦвета(19, 17, 138));
    Соответствие.Вставить("070 70 30", КонструкторЦвета(20, 17, 121));
    Соответствие.Вставить("070 70 40", КонструкторЦвета(21, 17, 102));
    Соответствие.Вставить("070 70 50", КонструкторЦвета(21, 169, 87));
    Соответствие.Вставить("070 70 60", КонструкторЦвета(22, 165, 65));
    Соответствие.Вставить("070 70 70", КонструкторЦвета(23, 161, 43));
    Соответствие.Вставить("070 70 80", КонструкторЦвета(23, 158 , 8));
    Соответствие.Вставить("070 80 10", КонструкторЦвета(21, 20, 182));
    Соответствие.Вставить("070 80 20", КонструкторЦвета(22, 20, 163));
    Соответствие.Вставить("070 80 30", КонструкторЦвета(23, 20, 148));
    Соответствие.Вставить("070 80 40", КонструкторЦвета(24, 20, 133));
    Соответствие.Вставить("070 80 50", КонструкторЦвета(24, 19, 111));
    Соответствие.Вставить("070 80 60", КонструкторЦвета(25, 197, 90));
    Соответствие.Вставить("070 90 05", КонструкторЦвета(23, 23, 222));
    Соответствие.Вставить("070 90 10", КонструкторЦвета(23, 23, 211));
    Соответствие.Вставить("070 90 20", КонструкторЦвета(24, 23, 193));
    Соответствие.Вставить("075 40 20", КонструкторЦвета(107, 96, 67));
    Соответствие.Вставить("075 40 30", КонструкторЦвета(113, 94, 52));
    Соответствие.Вставить("075 40 38", КонструкторЦвета(117, 94, 39));
    Соответствие.Вставить("075 50 20", КонструкторЦвета(13, 121, 90));
    Соответствие.Вставить("075 50 30", КонструкторЦвета(14, 122, 74));
    Соответствие.Вставить("075 50 40", КонструкторЦвета(14, 119, 58));
    Соответствие.Вставить("075 50 50", КонструкторЦвета(15, 118, 39));
    Соответствие.Вставить("075 50 58", КонструкторЦвета(15, 115, 14));
    Соответствие.Вставить("075 60 10", КонструкторЦвета(15, 14, 131));
    Соответствие.Вставить("075 60 20", КонструкторЦвета(16, 14, 112));
    Соответствие.Вставить("075 60 30", КонструкторЦвета(17, 147, 98));
    Соответствие.Вставить("075 60 40", КонструкторЦвета(17, 148, 83));
    Соответствие.Вставить("075 60 50", КонструкторЦвета(18, 145, 61));
    Соответствие.Вставить("075 60 60", КонструкторЦвета(18, 142, 37));
    Соответствие.Вставить("075 60 70", КонструкторЦвета(19, 143 , 2));
    Соответствие.Вставить("075 70 10", КонструкторЦвета(17, 17, 157));
    Соответствие.Вставить("075 70 20", КонструкторЦвета(18, 17, 136));
    Соответствие.Вставить("075 70 30", КонструкторЦвета(19, 17, 120));
    Соответствие.Вставить("075 70 40", КонструкторЦвета(20, 17, 101));
    Соответствие.Вставить("075 70 50", КонструкторЦвета(21, 171, 84));
    Соответствие.Вставить("075 70 60", КонструкторЦвета(21, 170, 63));
    Соответствие.Вставить("075 70 70", КонструкторЦвета(22, 170, 39));
    Соответствие.Вставить("075 70 80", КонструкторЦвета(22, 168 , 0));
    Соответствие.Вставить("075 80 10", КонструкторЦвета(21, 20, 183));
    Соответствие.Вставить("075 80 20", КонструкторЦвета(21, 20, 163));
    Соответствие.Вставить("075 80 30", КонструкторЦвета(22, 20, 145));
    Соответствие.Вставить("075 80 40", КонструкторЦвета(23, 19, 129));
    Соответствие.Вставить("075 80 50", КонструкторЦвета(24, 19, 111));
    Соответствие.Вставить("075 80 60", КонструкторЦвета(24, 197, 92));
    Соответствие.Вставить("075 90 10", КонструкторЦвета(24, 23, 210));
    Соответствие.Вставить("075 90 20", КонструкторЦвета(24, 23, 190));
    Соответствие.Вставить("075 92 05", КонструкторЦвета(23, 23, 223));
    Соответствие.Вставить("080 20 10", КонструкторЦвета(59, 56, 45));
    Соответствие.Вставить("080 30 05", КонструкторЦвета(77, 75, 69));
    Соответствие.Вставить("080 30 10", КонструкторЦвета(77, 74, 60));
    Соответствие.Вставить("080 30 20", КонструкторЦвета(84, 76, 48));
    Соответствие.Вставить("080 30 26", КонструкторЦвета(87, 74, 40));
    Соответствие.Вставить("080 40 05", КонструкторЦвета(102, 98, 91));
    Соответствие.Вставить("080 40 10", КонструкторЦвета(10, 101, 86));
    Соответствие.Вставить("080 40 20", КонструкторЦвета(107, 97, 66));
    Соответствие.Вставить("080 40 30", КонструкторЦвета(113, 98, 54));
    Соответствие.Вставить("080 40 40", КонструкторЦвета(118, 97, 32));
    Соответствие.Вставить("080 50 05", КонструкторЦвета(12, 12, 114));
    Соответствие.Вставить("080 50 10", КонструкторЦвета(12, 12, 107));
    Соответствие.Вставить("080 50 20", КонструкторЦвета(13, 125, 92));
    Соответствие.Вставить("080 50 30", КонструкторЦвета(13, 125, 75));
    Соответствие.Вставить("080 50 40", КонструкторЦвета(14, 122, 58));
    Соответствие.Вставить("080 50 50", КонструкторЦвета(14, 124, 43));
    Соответствие.Вставить("080 60 05", КонструкторЦвета(15, 14, 140));
    Соответствие.Вставить("080 60 10", КонструкторЦвета(15, 14, 130));
    Соответствие.Вставить("080 60 20", КонструкторЦвета(15, 14, 111));
    Соответствие.Вставить("080 60 30", КонструкторЦвета(16, 149, 94));
    Соответствие.Вставить("080 60 40", КонструкторЦвета(16, 148, 82));
    Соответствие.Вставить("080 60 50", КонструкторЦвета(17, 150, 61));
    Соответствие.Вставить("080 60 60", КонструкторЦвета(17, 148, 33));
    Соответствие.Вставить("080 60 70", КонструкторЦвета(18, 147 , 4));
    Соответствие.Вставить("080 70 10", КонструкторЦвета(18, 17, 157));
    Соответствие.Вставить("080 70 20", КонструкторЦвета(18, 17, 137));
    Соответствие.Вставить("080 70 30", КонструкторЦвета(19, 17, 121));
    Соответствие.Вставить("080 70 40", КонструкторЦвета(20, 17, 103));
    Соответствие.Вставить("080 70 50", КонструкторЦвета(20, 175, 82));
    Соответствие.Вставить("080 70 60", КонструкторЦвета(21, 177, 61));
    Соответствие.Вставить("080 70 70", КонструкторЦвета(21, 176, 41));
    Соответствие.Вставить("080 70 80", КонструкторЦвета(21, 173 , 0));
    Соответствие.Вставить("080 70 88", КонструкторЦвета(21, 172 , 0));
    Соответствие.Вставить("080 80 05", КонструкторЦвета(20, 20, 192));
    Соответствие.Вставить("080 80 10", КонструкторЦвета(21, 20, 183));
    Соответствие.Вставить("080 80 20", КонструкторЦвета(21, 20, 162));
    Соответствие.Вставить("080 80 30", КонструкторЦвета(21, 20, 143));
    Соответствие.Вставить("080 80 40", КонструкторЦвета(22, 20, 127));
    Соответствие.Вставить("080 80 50", КонструкторЦвета(23, 20, 106));
    Соответствие.Вставить("080 80 60", КонструкторЦвета(23, 202, 82));
    Соответствие.Вставить("080 80 70", КонструкторЦвета(24, 201, 60));
    Соответствие.Вставить("080 80 80", КонструкторЦвета(24, 200, 33));
    Соответствие.Вставить("080 80 90", КонструкторЦвета(25, 202 , 0));
    Соответствие.Вставить("080 90 05", КонструкторЦвета(23, 23, 220));
    Соответствие.Вставить("080 90 10", КонструкторЦвета(23, 22, 207));
    Соответствие.Вставить("080 90 20", КонструкторЦвета(24, 22, 188));
    Соответствие.Вставить("085 40 20", КонструкторЦвета(103, 97, 64));
    Соответствие.Вставить("085 40 30", КонструкторЦвета(10, 101, 56));
    Соответствие.Вставить("085 50 20", КонструкторЦвета(13, 123, 88));
    Соответствие.Вставить("085 50 30", КонструкторЦвета(13, 123, 70));
    Соответствие.Вставить("085 50 40", КонструкторЦвета(13, 124, 55));
    Соответствие.Вставить("085 50 50", КонструкторЦвета(13, 125, 35));
    Соответствие.Вставить("085 60 10", КонструкторЦвета(15, 14, 131));
    Соответствие.Вставить("085 60 20", КонструкторЦвета(15, 14, 113));
    Соответствие.Вставить("085 60 30", КонструкторЦвета(16, 151, 96));
    Соответствие.Вставить("085 60 40", КонструкторЦвета(16, 150, 78));
    Соответствие.Вставить("085 60 50", КонструкторЦвета(16, 151, 58));
    Соответствие.Вставить("085 60 60", КонструкторЦвета(17, 152, 32));
    Соответствие.Вставить("085 70 10", КонструкторЦвета(17, 17, 153));
    Соответствие.Вставить("085 70 20", КонструкторЦвета(18, 17, 138));
    Соответствие.Вставить("085 70 30", КонструкторЦвета(18, 17, 116));
    Соответствие.Вставить("085 70 40", КонструкторЦвета(18, 17, 100));
    Соответствие.Вставить("085 70 50", КонструкторЦвета(19, 177, 78));
    Соответствие.Вставить("085 70 60", КонструкторЦвета(19, 176, 55));
    Соответствие.Вставить("085 70 70", КонструкторЦвета(20, 175, 34));
    Соответствие.Вставить("085 70 75", КонструкторЦвета(20, 177, 11));
    Соответствие.Вставить("085 80 10", КонструкторЦвета(20, 20, 179));
    Соответствие.Вставить("085 80 20", КонструкторЦвета(21, 20, 164));
    Соответствие.Вставить("085 80 30", КонструкторЦвета(21, 20, 142));
    Соответствие.Вставить("085 80 40", КонструкторЦвета(21, 20, 124));
    Соответствие.Вставить("085 80 50", КонструкторЦвета(22, 20, 104));
    Соответствие.Вставить("085 80 60", КонструкторЦвета(22, 204, 82));
    Соответствие.Вставить("085 80 70", КонструкторЦвета(23, 203, 57));
    Соответствие.Вставить("085 80 80", КонструкторЦвета(23, 202, 17));
    Соответствие.Вставить("085 80 85", КонструкторЦвета(23, 202 , 5));
    Соответствие.Вставить("085 90 10", КонструкторЦвета(23, 23, 211));
    Соответствие.Вставить("085 90 20", КонструкторЦвета(24, 23, 189));
    Соответствие.Вставить("085 90 30", КонструкторЦвета(24, 23, 168));
    Соответствие.Вставить("090 30 20", КонструкторЦвета(81, 77, 46));
    Соответствие.Вставить("090 40 10", КонструкторЦвета(10, 101, 86));
    Соответствие.Вставить("090 40 20", КонструкторЦвета(103, 99, 67));
    Соответствие.Вставить("090 40 30", КонструкторЦвета(10, 102, 55));
    Соответствие.Вставить("090 50 10", КонструкторЦвета(12, 12, 108));
    Соответствие.Вставить("090 50 20", КонструкторЦвета(12, 124, 91));
    Соответствие.Вставить("090 50 30", КонструкторЦвета(13, 127, 72));
    Соответствие.Вставить("090 50 40", КонструкторЦвета(13, 126, 56));
    Соответствие.Вставить("090 60 10", КонструкторЦвета(14, 14, 132));
    Соответствие.Вставить("090 60 20", КонструкторЦвета(15, 14, 114));
    Соответствие.Вставить("090 60 30", КонструкторЦвета(15, 15, 100));
    Соответствие.Вставить("090 60 40", КонструкторЦвета(15, 151, 79));
    Соответствие.Вставить("090 60 50", КонструкторЦвета(16, 153, 59));
    Соответствие.Вставить("090 60 60", КонструкторЦвета(16, 155, 37));
    Соответствие.Вставить("090 70 10", КонструкторЦвета(17, 17, 156));
    Соответствие.Вставить("090 70 20", КонструкторЦвета(18, 17, 136));
    Соответствие.Вставить("090 70 30", КонструкторЦвета(18, 17, 123));
    Соответствие.Вставить("090 70 40", КонструкторЦвета(18, 178, 99));
    Соответствие.Вставить("090 70 50", КонструкторЦвета(19, 180, 83));
    Соответствие.Вставить("090 70 60", КонструкторЦвета(19, 181, 60));
    Соответствие.Вставить("090 70 70", КонструкторЦвета(19, 182, 29));
    Соответствие.Вставить("090 70 80", КонструкторЦвета(19, 181 , 3));
    Соответствие.Вставить("090 80 10", КонструкторЦвета(20, 20, 181));
    Соответствие.Вставить("090 80 20", КонструкторЦвета(20, 20, 163));
    Соответствие.Вставить("090 80 30", КонструкторЦвета(21, 20, 147));
    Соответствие.Вставить("090 80 40", КонструкторЦвета(21, 20, 132));
    Соответствие.Вставить("090 80 50", КонструкторЦвета(22, 20, 104));
    Соответствие.Вставить("090 80 60", КонструкторЦвета(22, 207, 79));
    Соответствие.Вставить("090 80 70", КонструкторЦвета(22, 210, 63));
    Соответствие.Вставить("090 80 80", КонструкторЦвета(22, 209, 19));
    Соответствие.Вставить("090 80 90", КонструкторЦвета(22, 212 , 0));
    Соответствие.Вставить("090 90 05", КонструкторЦвета(23, 23, 221));
    Соответствие.Вставить("090 90 10", КонструкторЦвета(23, 23, 211));
    Соответствие.Вставить("090 90 20", КонструкторЦвета(23, 23, 190));
    Соответствие.Вставить("090 90 30", КонструкторЦвета(24, 23, 172));
    Соответствие.Вставить("095 40 20", КонструкторЦвета(102, 99, 68));
    Соответствие.Вставить("095 40 30", КонструкторЦвета(10, 102, 53));
    Соответствие.Вставить("095 50 20", КонструкторЦвета(12, 123, 91));
    Соответствие.Вставить("095 50 30", КонструкторЦвета(12, 124, 73));
    Соответствие.Вставить("095 50 40", КонструкторЦвета(13, 128, 57));
    Соответствие.Вставить("095 50 50", КонструкторЦвета(12, 131, 33));
    Соответствие.Вставить("095 60 10", КонструкторЦвета(15, 14, 133));
    Соответствие.Вставить("095 60 20", КонструкторЦвета(15, 15, 115));
    Соответствие.Вставить("095 60 30", КонструкторЦвета(15, 150, 93));
    Соответствие.Вставить("095 60 40", КонструкторЦвета(15, 153, 77));
    Соответствие.Вставить("095 60 50", КонструкторЦвета(15, 153, 57));
    Соответствие.Вставить("095 60 60", КонструкторЦвета(15, 155, 32));
    Соответствие.Вставить("095 60 70", КонструкторЦвета(14, 158 , 3));
    Соответствие.Вставить("095 70 10", КонструкторЦвета(17, 17, 156));
    Соответствие.Вставить("095 70 20", КонструкторЦвета(17, 17, 140));
    Соответствие.Вставить("095 70 30", КонструкторЦвета(18, 17, 122));
    Соответствие.Вставить("095 70 40", КонструкторЦвета(17, 17, 100));
    Соответствие.Вставить("095 70 50", КонструкторЦвета(18, 178, 84));
    Соответствие.Вставить("095 70 60", КонструкторЦвета(18, 178, 65));
    Соответствие.Вставить("095 70 70", КонструкторЦвета(17, 182, 30));
    Соответствие.Вставить("095 80 10", КонструкторЦвета(20, 20, 183));
    Соответствие.Вставить("095 80 20", КонструкторЦвета(20, 20, 165));
    Соответствие.Вставить("095 80 30", КонструкторЦвета(21, 20, 147));
    Соответствие.Вставить("095 80 40", КонструкторЦвета(21, 20, 126));
    Соответствие.Вставить("095 80 50", КонструкторЦвета(21, 20, 109));
    Соответствие.Вставить("095 80 60", КонструкторЦвета(20, 207, 89));
    Соответствие.Вставить("095 80 70", КонструкторЦвета(20, 207, 57));
    Соответствие.Вставить("095 80 80", КонструкторЦвета(20, 206, 32));
    Соответствие.Вставить("095 90 10", КонструкторЦвета(23, 23, 210));
    Соответствие.Вставить("095 90 20", КонструкторЦвета(23, 23, 190));
    Соответствие.Вставить("095 90 30", КонструкторЦвета(23, 23, 167));
    Соответствие.Вставить("095 90 40", КонструкторЦвета(23, 23, 148));
    Соответствие.Вставить("095 90 50", КонструкторЦвета(24, 23, 132));
    Соответствие.Вставить("095 90 59", КонструкторЦвета(24, 24, 113));
    Соответствие.Вставить("100 20 05", КонструкторЦвета(55, 59, 52));
    Соответствие.Вставить("100 30 05", КонструкторЦвета(74, 75, 69));
    Соответствие.Вставить("100 30 10", КонструкторЦвета(75, 76, 61));
    Соответствие.Вставить("100 30 20", КонструкторЦвета(77, 82, 51));
    Соответствие.Вставить("100 40 05", КонструкторЦвета(96, 97, 91));
    Соответствие.Вставить("100 40 10", КонструкторЦвета(10, 101, 86));
    Соответствие.Вставить("100 40 20", КонструкторЦвета(9, 103, 72));
    Соответствие.Вставить("100 40 30", КонструкторЦвета(9, 103, 53));
    Соответствие.Вставить("100 40 40", КонструкторЦвета(9, 106, 34));
    Соответствие.Вставить("100 50 05", КонструкторЦвета(12, 12, 115));
    Соответствие.Вставить("100 50 10", КонструкторЦвета(12, 12, 105));
    Соответствие.Вставить("100 50 20", КонструкторЦвета(12, 127, 91));
    Соответствие.Вставить("100 50 30", КонструкторЦвета(12, 128, 76));
    Соответствие.Вставить("100 50 40", КонструкторЦвета(12, 130, 55));
    Соответствие.Вставить("100 50 50", КонструкторЦвета(11, 132, 35));
    Соответствие.Вставить("100 60 05", КонструкторЦвета(14, 14, 140));
    Соответствие.Вставить("100 60 10", КонструкторЦвета(14, 14, 131));
    Соответствие.Вставить("100 60 20", КонструкторЦвета(14, 15, 116));
    Соответствие.Вставить("100 60 30", КонструкторЦвета(14, 153, 96));
    Соответствие.Вставить("100 60 40", КонструкторЦвета(15, 156, 82));
    Соответствие.Вставить("100 60 50", КонструкторЦвета(14, 158, 63));
    Соответствие.Вставить("100 60 60", КонструкторЦвета(13, 159, 29));
    Соответствие.Вставить("100 70 05", КонструкторЦвета(17, 17, 167));
    Соответствие.Вставить("100 70 10", КонструкторЦвета(17, 17, 157));
    Соответствие.Вставить("100 70 20", КонструкторЦвета(17, 17, 139));
    Соответствие.Вставить("100 70 30", КонструкторЦвета(17, 18, 121));
    Соответствие.Вставить("100 70 40", КонструкторЦвета(17, 18, 106));
    Соответствие.Вставить("100 70 50", КонструкторЦвета(17, 182, 85));
    Соответствие.Вставить("100 70 60", КонструкторЦвета(17, 184, 64));
    Соответствие.Вставить("100 80 05", КонструкторЦвета(20, 20, 191));
    Соответствие.Вставить("100 80 10", КонструкторЦвета(20, 20, 180));
    Соответствие.Вставить("100 80 20", КонструкторЦвета(20, 20, 163));
    Соответствие.Вставить("100 80 30", КонструкторЦвета(20, 20, 146));
    Соответствие.Вставить("100 80 40", КонструкторЦвета(20, 20, 127));
    Соответствие.Вставить("100 80 50", КонструкторЦвета(20, 21, 110));
    Соответствие.Вставить("100 80 60", КонструкторЦвета(19, 215, 84));
    Соответствие.Вставить("100 80 70", КонструкторЦвета(19, 216, 65));
    Соответствие.Вставить("100 80 80", КонструкторЦвета(19, 217, 25));
    Соответствие.Вставить("100 90 05", КонструкторЦвета(23, 23, 219));
    Соответствие.Вставить("100 90 10", КонструкторЦвета(23, 23, 210));
    Соответствие.Вставить("100 90 20", КонструкторЦвета(23, 23, 190));
    Соответствие.Вставить("100 90 30", КонструкторЦвета(23, 23, 173));
    Соответствие.Вставить("100 90 40", КонструкторЦвета(23, 24, 151));
    Соответствие.Вставить("100 90 50", КонструкторЦвета(22, 23, 131));
    Соответствие.Вставить("110 20 10", КонструкторЦвета(52, 58, 46));
    Соответствие.Вставить("110 30 20", КонструкторЦвета(68, 81, 51));
    Соответствие.Вставить("110 40 10", КонструкторЦвета(9, 102, 87));
    Соответствие.Вставить("110 40 20", КонструкторЦвета(9, 103, 71));
    Соответствие.Вставить("110 40 30", КонструкторЦвета(8, 106, 55));
    Соответствие.Вставить("110 40 40", КонструкторЦвета(8, 109, 40));
    Соответствие.Вставить("110 50 10", КонструкторЦвета(11, 12, 107));
    Соответствие.Вставить("110 50 20", КонструкторЦвета(11, 128, 94));
    Соответствие.Вставить("110 50 30", КонструкторЦвета(11, 130, 78));
    Соответствие.Вставить("110 50 40", КонструкторЦвета(10, 133, 60));
    Соответствие.Вставить("110 50 50", КонструкторЦвета(9, 134, 35));
    Соответствие.Вставить("110 50 55", КонструкторЦвета(9, 139, 24));
    Соответствие.Вставить("110 60 10", КонструкторЦвета(14, 15, 132));
    Соответствие.Вставить("110 60 20", КонструкторЦвета(14, 15, 120));
    Соответствие.Вставить("110 60 30", КонструкторЦвета(14, 15, 103));
    Соответствие.Вставить("110 60 40", КонструкторЦвета(13, 158, 87));
    Соответствие.Вставить("110 60 50", КонструкторЦвета(12, 163, 66));
    Соответствие.Вставить("110 60 60", КонструкторЦвета(11, 166, 37));
    Соответствие.Вставить("110 60 65", КонструкторЦвета(11, 168, 21));
    Соответствие.Вставить("110 70 10", КонструкторЦвета(17, 17, 158));
    Соответствие.Вставить("110 70 20", КонструкторЦвета(16, 17, 141));
    Соответствие.Вставить("110 70 30", КонструкторЦвета(16, 18, 124));
    Соответствие.Вставить("110 70 40", КонструкторЦвета(15, 18, 107));
    Соответствие.Вставить("110 70 50", КонструкторЦвета(15, 186, 87));
    Соответствие.Вставить("110 70 60", КонструкторЦвета(14, 188, 66));
    Соответствие.Вставить("110 70 70", КонструкторЦвета(13, 189, 35));
    Соответствие.Вставить("110 70 77", КонструкторЦвета(13, 191 , 4));
    Соответствие.Вставить("110 80 10", КонструкторЦвета(19, 20, 182));
    Соответствие.Вставить("110 80 20", КонструкторЦвета(19, 21, 164));
    Соответствие.Вставить("110 80 30", КонструкторЦвета(19, 20, 148));
    Соответствие.Вставить("110 80 40", КонструкторЦвета(18, 21, 131));
    Соответствие.Вставить("110 80 50", КонструкторЦвета(18, 21, 113));
    Соответствие.Вставить("110 80 60", КонструкторЦвета(17, 220, 95));
    Соответствие.Вставить("110 80 70", КонструкторЦвета(17, 220, 69));
    Соответствие.Вставить("110 90 05", КонструкторЦвета(22, 23, 221));
    Соответствие.Вставить("110 90 10", КонструкторЦвета(22, 23, 210));
    Соответствие.Вставить("110 90 20", КонструкторЦвета(22, 23, 190));
    Соответствие.Вставить("110 90 30", КонструкторЦвета(22, 23, 172));
    Соответствие.Вставить("110 90 35", КонструкторЦвета(21, 24, 163));
    Соответствие.Вставить("110 90 40", КонструкторЦвета(21, 24, 155));
    Соответствие.Вставить("110 92 05", КонструкторЦвета(23, 23, 225));
    Соответствие.Вставить("120 30 05", КонструкторЦвета(70, 75, 68));
    Соответствие.Вставить("120 30 10", КонструкторЦвета(72, 80, 67));
    Соответствие.Вставить("120 30 20", КонструкторЦвета(66, 84, 56));
    Соответствие.Вставить("120 40 05", КонструкторЦвета(93, 99, 92));
    Соответствие.Вставить("120 40 10", КонструкторЦвета(9, 102, 86));
    Соответствие.Вставить("120 40 20", КонструкторЦвета(8, 104, 74));
    Соответствие.Вставить("120 40 30", КонструкторЦвета(8, 107, 60));
    Соответствие.Вставить("120 40 40", КонструкторЦвета(6, 112, 41));
    Соответствие.Вставить("120 50 05", КонструкторЦвета(11, 12, 115));
    Соответствие.Вставить("120 50 10", КонструкторЦвета(11, 12, 109));
    Соответствие.Вставить("120 50 20", КонструкторЦвета(11, 131, 95));
    Соответствие.Вставить("120 50 30", КонструкторЦвета(10, 133, 79));
    Соответствие.Вставить("120 50 40", КонструкторЦвета(9, 135, 61));
    Соответствие.Вставить("120 50 50", КонструкторЦвета(8, 137, 48));
    Соответствие.Вставить("120 60 05", КонструкторЦвета(14, 15, 144));
    Соответствие.Вставить("120 60 10", КонструкторЦвета(14, 15, 134));
    Соответствие.Вставить("120 60 20", КонструкторЦвета(13, 15, 119));
    Соответствие.Вставить("120 60 30", КонструкторЦвета(12, 15, 104));
    Соответствие.Вставить("120 60 40", КонструкторЦвета(12, 162, 89));
    Соответствие.Вставить("120 60 50", КонструкторЦвета(11, 165, 72));
    Соответствие.Вставить("120 60 60", КонструкторЦвета(9, 167, 52));
    Соответствие.Вставить("120 60 63", КонструкторЦвета(9, 168, 43));
    Соответствие.Вставить("120 70 05", КонструкторЦвета(16, 17, 167));
    Соответствие.Вставить("120 70 10", КонструкторЦвета(16, 17, 157));
    Соответствие.Вставить("120 70 20", КонструкторЦвета(16, 18, 143));
    Соответствие.Вставить("120 70 30", КонструкторЦвета(15, 18, 129));
    Соответствие.Вставить("120 70 40", КонструкторЦвета(14, 19, 112));
    Соответствие.Вставить("120 70 50", КонструкторЦвета(13, 192, 95));
    Соответствие.Вставить("120 70 60", КонструкторЦвета(12, 194, 79));
    Соответствие.Вставить("120 70 70", КонструкторЦвета(11, 193, 56));
    Соответствие.Вставить("120 70 75", КонструкторЦвета(10, 193, 39));
    Соответствие.Вставить("120 80 05", КонструкторЦвета(19, 20, 193));
    Соответствие.Вставить("120 80 10", КонструкторЦвета(19, 20, 183));
    Соответствие.Вставить("120 80 20", КонструкторЦвета(18, 21, 171));
    Соответствие.Вставить("120 80 30", КонструкторЦвета(17, 21, 152));
    Соответствие.Вставить("120 80 40", КонструкторЦвета(17, 21, 136));
    Соответствие.Вставить("120 80 50", КонструкторЦвета(16, 22, 118));
    Соответствие.Вставить("120 80 60", КонструкторЦвета(15, 22, 103));
    Соответствие.Вставить("120 90 05", КонструкторЦвета(22, 22, 218));
    Соответствие.Вставить("120 90 10", КонструкторЦвета(22, 23, 212));
    Соответствие.Вставить("120 90 20", КонструкторЦвета(21, 23, 194));
    Соответствие.Вставить("120 90 30", КонструкторЦвета(20, 24, 177));
    Соответствие.Вставить("130 30 20", КонструкторЦвета(57, 80, 54));
    Соответствие.Вставить("130 40 10", КонструкторЦвета(9, 104, 89));
    Соответствие.Вставить("130 40 20", КонструкторЦвета(7, 103, 73));
    Соответствие.Вставить("130 40 30", КонструкторЦвета(7, 107, 64));
    Соответствие.Вставить("130 50 10", КонструкторЦвета(11, 12, 109));
    Соответствие.Вставить("130 50 20", КонструкторЦвета(10, 129, 97));
    Соответствие.Вставить("130 50 30", КонструкторЦвета(9, 132, 82));
    Соответствие.Вставить("130 50 40", КонструкторЦвета(7, 135, 68));
    Соответствие.Вставить("130 50 50", КонструкторЦвета(5, 138, 58));
    Соответствие.Вставить("130 60 10", КонструкторЦвета(13, 15, 135));
    Соответствие.Вставить("130 60 20", КонструкторЦвета(12, 15, 122));
    Соответствие.Вставить("130 60 30", КонструкторЦвета(11, 15, 108));
    Соответствие.Вставить("130 60 40", КонструкторЦвета(10, 161, 93));
    Соответствие.Вставить("130 60 50", КонструкторЦвета(8, 164, 76));
    Соответствие.Вставить("130 60 60", КонструкторЦвета(6, 168, 64));
    Соответствие.Вставить("130 70 10", КонструкторЦвета(16, 17, 162));
    Соответствие.Вставить("130 70 20", КонструкторЦвета(15, 18, 148));
    Соответствие.Вставить("130 70 30", КонструкторЦвета(14, 18, 135));
    Соответствие.Вставить("130 70 40", КонструкторЦвета(13, 18, 117));
    Соответствие.Вставить("130 70 50", КонструкторЦвета(11, 19, 106));
    Соответствие.Вставить("130 70 60", КонструкторЦвета(10, 196, 88));
    Соответствие.Вставить("130 80 10", КонструкторЦвета(19, 20, 188));
    Соответствие.Вставить("130 80 20", КонструкторЦвета(18, 21, 174));
    Соответствие.Вставить("130 80 30", КонструкторЦвета(17, 21, 160));
    Соответствие.Вставить("130 80 40", КонструкторЦвета(15, 21, 145));
    Соответствие.Вставить("130 80 50", КонструкторЦвета(14, 22, 129));
    Соответствие.Вставить("130 90 05", КонструкторЦвета(22, 23, 222));
    Соответствие.Вставить("130 90 10", КонструкторЦвета(22, 23, 215));
    Соответствие.Вставить("130 90 20", КонструкторЦвета(20, 23, 198));
    Соответствие.Вставить("130 92 05", КонструкторЦвета(22, 23, 227));
    Соответствие.Вставить("140 20 05", КонструкторЦвета(47, 55, 51));
    Соответствие.Вставить("140 20 10", КонструкторЦвета(49, 63, 52));
    Соответствие.Вставить("140 20 20", КонструкторЦвета(44, 67, 50));
    Соответствие.Вставить("140 30 05", КонструкторЦвета(69, 78, 73));
    Соответствие.Вставить("140 30 10", КонструкторЦвета(64, 82, 69));
    Соответствие.Вставить("140 30 20", КонструкторЦвета(55, 86, 61));
    Соответствие.Вставить("140 30 30", КонструкторЦвета(39, 89, 54));
    Соответствие.Вставить("140 30 40", КонструкторЦвета(21, 91, 51));
    Соответствие.Вставить("140 40 05", КонструкторЦвета(9, 101, 94));
    Соответствие.Вставить("140 40 10", КонструкторЦвета(8, 102, 88));
    Соответствие.Вставить("140 40 20", КонструкторЦвета(7, 105, 77));
    Соответствие.Вставить("140 40 30", КонструкторЦвета(5, 110, 68));
    Соответствие.Вставить("140 40 40", КонструкторЦвета(3, 115, 58));
    Соответствие.Вставить("140 40 50", КонструкторЦвета(1, 118, 51));
    Соответствие.Вставить("140 50 05", КонструкторЦвета(11, 12, 116));
    Соответствие.Вставить("140 50 10", КонструкторЦвета(10, 12, 111));
    Соответствие.Вставить("140 50 20", КонструкторЦвета(9, 13, 101));
    Соответствие.Вставить("140 50 30", КонструкторЦвета(8, 135, 89));
    Соответствие.Вставить("140 50 40", КонструкторЦвета(5, 138, 77));
    Соответствие.Вставить("140 50 50", КонструкторЦвета(3, 142, 66));
    Соответствие.Вставить("140 50 60", КонструкторЦвета(1, 146, 56));
    Соответствие.Вставить("140 60 05", КонструкторЦвета(13, 14, 144));
    Соответствие.Вставить("140 60 10", КонструкторЦвета(13, 15, 136));
    Соответствие.Вставить("140 60 20", КонструкторЦвета(12, 15, 128));
    Соответствие.Вставить("140 60 30", КонструкторЦвета(10, 16, 115));
    Соответствие.Вставить("140 60 40", КонструкторЦвета(9, 16, 103));
    Соответствие.Вставить("140 60 50", КонструкторЦвета(6, 167, 89));
    Соответствие.Вставить("140 60 60", КонструкторЦвета(3, 172, 80));
    Соответствие.Вставить("140 60 70", КонструкторЦвета(, 172, 69));
    Соответствие.Вставить("140 70 05", КонструкторЦвета(16, 17, 168));
    Соответствие.Вставить("140 70 10", КонструкторЦвета(15, 17, 164));
    Соответствие.Вставить("140 70 20", КонструкторЦвета(14, 18, 151));
    Соответствие.Вставить("140 70 30", КонструкторЦвета(12, 18, 140));
    Соответствие.Вставить("140 70 40", КонструкторЦвета(11, 19, 128));
    Соответствие.Вставить("140 70 50", КонструкторЦвета(9, 19, 113));
    Соответствие.Вставить("140 70 60", КонструкторЦвета(6, 19, 100));
    Соответствие.Вставить("140 80 10", КонструкторЦвета(18, 20, 190));
    Соответствие.Вставить("140 80 20", КонструкторЦвета(17, 21, 176));
    Соответствие.Вставить("140 80 30", КонструкторЦвета(15, 21, 164));
    Соответствие.Вставить("140 80 40", КонструкторЦвета(13, 22, 152));
    Соответствие.Вставить("140 90 05", КонструкторЦвета(22, 23, 222));
    Соответствие.Вставить("140 90 10", КонструкторЦвета(21, 23, 217));
    Соответствие.Вставить("150 30 20", КонструкторЦвета(45, 85, 64));
    Соответствие.Вставить("150 30 30", КонструкторЦвета(29, 88, 59));
    Соответствие.Вставить("150 40 10", КонструкторЦвета(8, 102, 91));
    Соответствие.Вставить("150 40 20", КонструкторЦвета(6, 107, 83));
    Соответствие.Вставить("150 40 30", КонструкторЦвета(3, 109, 75));
    Соответствие.Вставить("150 40 40", КонструкторЦвета(1, 113, 64));
    Соответствие.Вставить("150 40 50", КонструкторЦвета(, 114, 59));
    Соответствие.Вставить("150 50 10", КонструкторЦвета(10, 12, 114));
    Соответствие.Вставить("150 50 20", КонструкторЦвета(8, 13, 105));
    Соответствие.Вставить("150 50 30", КонструкторЦвета(6, 136, 97));
    Соответствие.Вставить("150 50 40", КонструкторЦвета(4, 138, 91));
    Соответствие.Вставить("150 50 50", КонструкторЦвета(, 142, 80));
    Соответствие.Вставить("150 50 60", КонструкторЦвета(, 144, 71));
    Соответствие.Вставить("150 60 10", КонструкторЦвета(13, 15, 141));
    Соответствие.Вставить("150 60 20", КонструкторЦвета(11, 15, 131));
    Соответствие.Вставить("150 60 30", КонструкторЦвета(9, 16, 123));
    Соответствие.Вставить("150 60 40", КонструкторЦвета(7, 16, 113));
    Соответствие.Вставить("150 60 50", КонструкторЦвета(3, 16, 107));
    Соответствие.Вставить("150 60 60", КонструкторЦвета(, 170, 92));
    Соответствие.Вставить("150 70 10", КонструкторЦвета(15, 17, 165));
    Соответствие.Вставить("150 70 20", КонструкторЦвета(14, 18, 158));
    Соответствие.Вставить("150 70 30", КонструкторЦвета(12, 19, 149));
    Соответствие.Вставить("150 70 40", КонструкторЦвета(9, 19, 138));
    Соответствие.Вставить("150 70 50", КонструкторЦвета(7, 19, 127));
    Соответствие.Вставить("150 80 10", КонструкторЦвета(18, 20, 193));
    Соответствие.Вставить("150 80 20", КонструкторЦвета(16, 21, 183));
    Соответствие.Вставить("150 80 30", КонструкторЦвета(14, 21, 176));
    Соответствие.Вставить("150 80 40", КонструкторЦвета(12, 22, 163));
    Соответствие.Вставить("150 90 05", КонструкторЦвета(22, 23, 222));
    Соответствие.Вставить("150 90 10", КонструкторЦвета(21, 23, 218));
    Соответствие.Вставить("160 20 15", КонструкторЦвета(35, 65, 53));
    Соответствие.Вставить("160 20 20", КонструкторЦвета(28, 59, 51));
    Соответствие.Вставить("160 30 05", КонструкторЦвета(66, 78, 74));
    Соответствие.Вставить("160 30 10", КонструкторЦвета(62, 82, 73));
    Соответствие.Вставить("160 30 15", КонструкторЦвета(51, 80, 68));
    Соответствие.Вставить("160 30 20", КонструкторЦвета(39, 83, 67));
    Соответствие.Вставить("160 30 25", КонструкторЦвета(30, 84, 63));
    Соответствие.Вставить("160 30 30", КонструкторЦвета(17, 85, 61));
    Соответствие.Вставить("160 30 35", КонструкторЦвета(3, 90, 62));
    Соответствие.Вставить("160 30 40", КонструкторЦвета(2, 89, 59));
    Соответствие.Вставить("160 40 05", КонструкторЦвета(8, 100, 96));
    Соответствие.Вставить("160 40 10", КонструкторЦвета(8, 104, 96));
    Соответствие.Вставить("160 40 15", КонструкторЦвета(7, 106, 93));
    Соответствие.Вставить("160 40 20", КонструкторЦвета(5, 106, 89));
    Соответствие.Вставить("160 40 25", КонструкторЦвета(4, 107, 84));
    Соответствие.Вставить("160 40 30", КонструкторЦвета(3, 110, 82));
    Соответствие.Вставить("160 40 35", КонструкторЦвета(2, 112, 80));
    Соответствие.Вставить("160 40 40", КонструкторЦвета(1, 112, 78));
    Соответствие.Вставить("160 40 45", КонструкторЦвета(, 113, 75));
    Соответствие.Вставить("160 40 50", КонструкторЦвета(, 113, 70));
    Соответствие.Вставить("160 40 55", КонструкторЦвета(, 117, 69));
    Соответствие.Вставить("160 50 05", КонструкторЦвета(11, 12, 120));
    Соответствие.Вставить("160 50 10", КонструкторЦвета(10, 12, 118));
    Соответствие.Вставить("160 50 15", КонструкторЦвета(9, 13, 116));
    Соответствие.Вставить("160 50 20", КонструкторЦвета(8, 13, 114));
    Соответствие.Вставить("160 50 25", КонструкторЦвета(7, 13, 108));
    Соответствие.Вставить("160 50 30", КонструкторЦвета(5, 13, 106));
    Соответствие.Вставить("160 50 35", КонструкторЦвета(4, 13, 104));
    Соответствие.Вставить("160 50 40", КонструкторЦвета(1, 14, 101));
    Соответствие.Вставить("160 50 45", КонструкторЦвета(1, 141, 98));
    Соответствие.Вставить("160 50 50", КонструкторЦвета(, 141, 95));
    Соответствие.Вставить("160 50 55", КонструкторЦвета(, 143, 92));
    Соответствие.Вставить("160 50 60", КонструкторЦвета(, 143, 89));
    Соответствие.Вставить("160 60 05", КонструкторЦвета(13, 15, 145));
    Соответствие.Вставить("160 60 10", КонструкторЦвета(12, 15, 143));
    Соответствие.Вставить("160 60 15", КонструкторЦвета(12, 15, 141));
    Соответствие.Вставить("160 60 20", КонструкторЦвета(10, 15, 137));
    Соответствие.Вставить("160 60 25", КонструкторЦвета(9, 16, 134));
    Соответствие.Вставить("160 60 30", КонструкторЦвета(8, 16, 132));
    Соответствие.Вставить("160 60 35", КонструкторЦвета(7, 16, 129));
    Соответствие.Вставить("160 60 40", КонструкторЦвета(5, 16, 125));
    Соответствие.Вставить("160 60 45", КонструкторЦвета(3, 16, 123));
    Соответствие.Вставить("160 60 50", КонструкторЦвета(, 16, 119));
    Соответствие.Вставить("160 60 55", КонструкторЦвета(, 16, 114));
    Соответствие.Вставить("160 60 58", КонструкторЦвета(, 16, 110));
    Соответствие.Вставить("160 70 05", КонструкторЦвета(16, 17, 172));
    Соответствие.Вставить("160 70 10", КонструкторЦвета(15, 17, 167));
    Соответствие.Вставить("160 70 15", КонструкторЦвета(14, 18, 164));
    Соответствие.Вставить("160 70 20", КонструкторЦвета(13, 18, 163));
    Соответствие.Вставить("160 70 25", КонструкторЦвета(12, 18, 159));
    Соответствие.Вставить("160 70 30", КонструкторЦвета(10, 18, 156));
    Соответствие.Вставить("160 70 35", КонструкторЦвета(9, 18, 153));
    Соответствие.Вставить("160 70 40", КонструкторЦвета(7, 19, 150));
    Соответствие.Вставить("160 70 45", КонструкторЦвета(5, 19, 146));
    Соответствие.Вставить("160 70 50", КонструкторЦвета(4, 19, 146));
    Соответствие.Вставить("160 80 05", КонструкторЦвета(18, 20, 197));
    Соответствие.Вставить("160 80 10", КонструкторЦвета(18, 20, 194));
    Соответствие.Вставить("160 80 15", КонструкторЦвета(16, 21, 190));
    Соответствие.Вставить("160 80 20", КонструкторЦвета(15, 21, 188));
    Соответствие.Вставить("160 80 25", КонструкторЦвета(15, 21, 187));
    Соответствие.Вставить("160 80 30", КонструкторЦвета(14, 21, 184));
    Соответствие.Вставить("160 90 05", КонструкторЦвета(21, 23, 223));
    Соответствие.Вставить("160 90 10", КонструкторЦвета(20, 23, 220));
    Соответствие.Вставить("170 20 10", КонструкторЦвета(38, 60, 57));
    Соответствие.Вставить("170 20 20", КонструкторЦвета(19, 62, 53));
    Соответствие.Вставить("170 20 25", КонструкторЦвета(8, 65, 52));
    Соответствие.Вставить("170 30 15", КонструкторЦвета(48, 84, 74));
    Соответствие.Вставить("170 30 20", КонструкторЦвета(34, 81, 70));
    Соответствие.Вставить("170 30 25", КонструкторЦвета(17, 85, 70));
    Соответствие.Вставить("170 30 30", КонструкторЦвета(12, 85, 69));
    Соответствие.Вставить("170 30 35", КонструкторЦвета(0, 87, 69));
    Соответствие.Вставить("170 30 40", КонструкторЦвета(0, 89, 68));
    Соответствие.Вставить("170 40 10", КонструкторЦвета(7, 103, 97));
    Соответствие.Вставить("170 40 15", КонструкторЦвета(6, 103, 93));
    Соответствие.Вставить("170 40 20", КонструкторЦвета(5, 108, 95));
    Соответствие.Вставить("170 40 25", КонструкторЦвета(4, 107, 91));
    Соответствие.Вставить("170 40 30", КонструкторЦвета(2, 111, 91));
    Соответствие.Вставить("170 40 35", КонструкторЦвета(1, 111, 88));
    Соответствие.Вставить("170 40 40", КонструкторЦвета(, 112, 88));
    Соответствие.Вставить("170 40 45", КонструкторЦвета(, 111, 85));
    Соответствие.Вставить("170 40 50", КонструкторЦвета(, 111, 82));
    Соответствие.Вставить("170 50 10", КонструкторЦвета(10, 12, 119));
    Соответствие.Вставить("170 50 15", КонструкторЦвета(8, 12, 117));
    Соответствие.Вставить("170 50 20", КонструкторЦвета(7, 13, 117));
    Соответствие.Вставить("170 50 25", КонструкторЦвета(6, 13, 114));
    Соответствие.Вставить("170 50 30", КонструкторЦвета(4, 13, 113));
    Соответствие.Вставить("170 50 35", КонструкторЦвета(2, 13, 111));
    Соответствие.Вставить("170 50 40", КонструкторЦвета(, 13, 109));
    Соответствие.Вставить("170 50 45", КонструкторЦвета(, 13, 109));
    Соответствие.Вставить("170 50 50", КонструкторЦвета(, 14, 108));
    Соответствие.Вставить("170 50 55", КонструкторЦвета(, 14, 105));
    Соответствие.Вставить("170 60 10", КонструкторЦвета(12, 15, 144));
    Соответствие.Вставить("170 60 15", КонструкторЦвета(11, 15, 143));
    Соответствие.Вставить("170 60 20", КонструкторЦвета(10, 15, 140));
    Соответствие.Вставить("170 60 25", КонструкторЦвета(9, 15, 141));
    Соответствие.Вставить("170 60 30", КонструкторЦвета(7, 16, 139));
    Соответствие.Вставить("170 60 35", КонструкторЦвета(4, 16, 138));
    Соответствие.Вставить("170 60 40", КонструкторЦвета(3, 16, 136));
    Соответствие.Вставить("170 60 45", КонструкторЦвета(1, 16, 134));
    Соответствие.Вставить("170 60 50", КонструкторЦвета(, 16, 135));
    Соответствие.Вставить("170 70 10", КонструкторЦвета(15, 18, 172));
    Соответствие.Вставить("170 70 15", КонструкторЦвета(14, 18, 169));
    Соответствие.Вставить("170 70 20", КонструкторЦвета(12, 18, 168));
    Соответствие.Вставить("170 70 25", КонструкторЦвета(11, 18, 166));
    Соответствие.Вставить("170 70 30", КонструкторЦвета(10, 19, 166));
    Соответствие.Вставить("170 70 35", КонструкторЦвета(8, 19, 162));
    Соответствие.Вставить("170 70 40", КонструкторЦвета(6, 19, 159));
    Соответствие.Вставить("170 80 10", КонструкторЦвета(17, 20, 198));
    Соответствие.Вставить("170 80 15", КонструкторЦвета(16, 21, 197));
    Соответствие.Вставить("170 80 20", КонструкторЦвета(15, 21, 195));
    Соответствие.Вставить("170 80 25", КонструкторЦвета(14, 21, 193));
    Соответствие.Вставить("170 90 05", КонструкторЦвета(21, 23, 225));
    Соответствие.Вставить("170 90 10", КонструкторЦвета(20, 23, 224));
    Соответствие.Вставить("170 92 05", КонструкторЦвета(22, 23, 233));
    Соответствие.Вставить("180 20 05", КонструкторЦвета(47, 60, 59));
    Соответствие.Вставить("180 20 15", КонструкторЦвета(24, 59, 55));
    Соответствие.Вставить("180 20 20", КонструкторЦвета(17, 61, 58));
    Соответствие.Вставить("180 30 05", КонструкторЦвета(67, 80, 79));
    Соответствие.Вставить("180 30 10", КонструкторЦвета(54, 80, 78));
    Соответствие.Вставить("180 30 15", КонструкторЦвета(46, 82, 78));
    Соответствие.Вставить("180 30 20", КонструкторЦвета(32, 83, 77));
    Соответствие.Вставить("180 30 25", КонструкторЦвета(20, 86, 78));
    Соответствие.Вставить("180 30 30", КонструкторЦвета(11, 85, 78));
    Соответствие.Вставить("180 30 35", КонструкторЦвета(9, 87, 79));
    Соответствие.Вставить("180 40 05", КонструкторЦвета(8, 100, 98));
    Соответствие.Вставить("180 40 10", КонструкторЦвета(7, 10, 100));
    Соответствие.Вставить("180 40 15", КонструкторЦвета(6, 105, 99));
    Соответствие.Вставить("180 40 20", КонструкторЦвета(5, 10, 100));
    Соответствие.Вставить("180 40 25", КонструкторЦвета(3, 10, 101));
    Соответствие.Вставить("180 40 30", КонструкторЦвета(, 109, 99));
    Соответствие.Вставить("180 40 35", КонструкторЦвета(, 109, 98));
    Соответствие.Вставить("180 40 40", КонструкторЦвета(, 111, 98));
    Соответствие.Вставить("180 40 45", КонструкторЦвета(, 111, 99));
    Соответствие.Вставить("180 50 05", КонструкторЦвета(11, 12, 125));
    Соответствие.Вставить("180 50 10", КонструкторЦвета(9, 12, 123));
    Соответствие.Вставить("180 50 15", КонструкторЦвета(8, 12, 123));
    Соответствие.Вставить("180 50 20", КонструкторЦвета(7, 13, 122));
    Соответствие.Вставить("180 50 25", КонструкторЦвета(4, 13, 124));
    Соответствие.Вставить("180 50 30", КонструкторЦвета(3, 13, 122));
    Соответствие.Вставить("180 50 35", КонструкторЦвета(1, 13, 122));
    Соответствие.Вставить("180 50 40", КонструкторЦвета(, 13, 121));
    Соответствие.Вставить("180 50 45", КонструкторЦвета(, 13, 121));
    Соответствие.Вставить("180 50 50", КонструкторЦвета(, 13, 120));
    Соответствие.Вставить("180 60 05", КонструкторЦвета(13, 15, 149));
    Соответствие.Вставить("180 60 10", КонструкторЦвета(12, 15, 148));
    Соответствие.Вставить("180 60 15", КонструкторЦвета(11, 15, 148));
    Соответствие.Вставить("180 60 20", КонструкторЦвета(9, 15, 148));
    Соответствие.Вставить("180 60 25", КонструкторЦвета(8, 15, 146));
    Соответствие.Вставить("180 60 30", КонструкторЦвета(6, 16, 148));
    Соответствие.Вставить("180 60 35", КонструкторЦвета(3, 16, 148));
    Соответствие.Вставить("180 60 40", КонструкторЦвета(1, 16, 150));
    Соответствие.Вставить("180 60 45", КонструкторЦвета(, 16, 150));
    Соответствие.Вставить("180 60 50", КонструкторЦвета(, 16, 149));
    Соответствие.Вставить("180 70 05", КонструкторЦвета(16, 17, 175));
    Соответствие.Вставить("180 70 10", КонструкторЦвета(14, 17, 174));
    Соответствие.Вставить("180 70 15", КонструкторЦвета(13, 18, 175));
    Соответствие.Вставить("180 70 20", КонструкторЦвета(12, 18, 175));
    Соответствие.Вставить("180 70 25", КонструкторЦвета(10, 18, 173));
    Соответствие.Вставить("180 70 30", КонструкторЦвета(9, 18, 174));
    Соответствие.Вставить("180 70 35", КонструкторЦвета(6, 19, 174));
    Соответствие.Вставить("180 70 40", КонструкторЦвета(5, 19, 176));
    Соответствие.Вставить("180 80 05", КонструкторЦвета(18, 20, 199));
    Соответствие.Вставить("180 80 10", КонструкторЦвета(17, 20, 202));
    Соответствие.Вставить("180 80 15", КонструкторЦвета(16, 21, 203));
    Соответствие.Вставить("180 80 20", КонструкторЦвета(14, 21, 200));
    Соответствие.Вставить("180 80 25", КонструкторЦвета(13, 21, 201));
    Соответствие.Вставить("180 80 30", КонструкторЦвета(12, 21, 203));
    Соответствие.Вставить("180 90 05", КонструкторЦвета(21, 23, 229));
    Соответствие.Вставить("180 90 10", КонструкторЦвета(20, 23, 229));
    Соответствие.Вставить("190 20 20", КонструкторЦвета(19, 65, 64));
    Соответствие.Вставить("190 30 15", КонструкторЦвета(47, 83, 82));
    Соответствие.Вставить("190 30 20", КонструкторЦвета(27, 83, 83));
    Соответствие.Вставить("190 30 25", КонструкторЦвета(14, 85, 85));
    Соответствие.Вставить("190 30 30", КонструкторЦвета(1, 86, 87));
    Соответствие.Вставить("190 30 35", КонструкторЦвета(0, 86, 88));
    Соответствие.Вставить("190 40 10", КонструкторЦвета(7, 10, 102));
    Соответствие.Вставить("190 40 15", КонструкторЦвета(6, 10, 105));
    Соответствие.Вставить("190 40 20", КонструкторЦвета(5, 10, 106));
    Соответствие.Вставить("190 40 25", КонструкторЦвета(2, 10, 108));
    Соответствие.Вставить("190 40 30", КонструкторЦвета(1, 10, 108));
    Соответствие.Вставить("190 40 35", КонструкторЦвета(, 10, 110));
    Соответствие.Вставить("190 40 40", КонструкторЦвета(, 11, 111));
    Соответствие.Вставить("190 40 45", КонструкторЦвета(, 11, 112));
    Соответствие.Вставить("190 50 10", КонструкторЦвета(9, 12, 125));
    Соответствие.Вставить("190 50 15", КонструкторЦвета(8, 13, 129));
    Соответствие.Вставить("190 50 20", КонструкторЦвета(7, 13, 129));
    Соответствие.Вставить("190 50 25", КонструкторЦвета(5, 13, 131));
    Соответствие.Вставить("190 50 30", КонструкторЦвета(1, 13, 131));
    Соответствие.Вставить("190 50 35", КонструкторЦвета(, 13, 133));
    Соответствие.Вставить("190 50 40", КонструкторЦвета(, 13, 136));
    Соответствие.Вставить("190 50 45", КонструкторЦвета(, 13, 137));
    Соответствие.Вставить("190 60 10", КонструкторЦвета(12, 15, 153));
    Соответствие.Вставить("190 60 15", КонструкторЦвета(11, 15, 154));
    Соответствие.Вставить("190 60 20", КонструкторЦвета(9, 15, 153));
    Соответствие.Вставить("190 60 25", КонструкторЦвета(8, 15, 156));
    Соответствие.Вставить("190 60 30", КонструкторЦвета(6, 16, 160));
    Соответствие.Вставить("190 60 35", КонструкторЦвета(4, 16, 162));
    Соответствие.Вставить("190 60 40", КонструкторЦвета(1, 16, 161));
    Соответствие.Вставить("190 60 45", КонструкторЦвета(, 16, 161));
    Соответствие.Вставить("190 70 10", КонструкторЦвета(14, 17, 178));
    Соответствие.Вставить("190 70 15", КонструкторЦвета(14, 18, 179));
    Соответствие.Вставить("190 70 20", КонструкторЦвета(12, 18, 181));
    Соответствие.Вставить("190 70 25", КонструкторЦвета(11, 18, 183));
    Соответствие.Вставить("190 70 30", КонструкторЦвета(9, 18, 186));
    Соответствие.Вставить("190 70 35", КонструкторЦвета(7, 18, 186));
    Соответствие.Вставить("190 80 10", КонструкторЦвета(17, 20, 203));
    Соответствие.Вставить("190 80 15", КонструкторЦвета(16, 21, 208));
    Соответствие.Вставить("190 80 20", КонструкторЦвета(15, 21, 208));
    Соответствие.Вставить("190 80 25", КонструкторЦвета(13, 21, 209));
    Соответствие.Вставить("190 90 05", КонструкторЦвета(21, 23, 230));
    Соответствие.Вставить("190 90 10", КонструкторЦвета(20, 23, 232));
    Соответствие.Вставить("200 20 10", КонструкторЦвета(39, 59, 62));
    Соответствие.Вставить("200 20 15", КонструкторЦвета(25, 57, 62));
    Соответствие.Вставить("200 20 20", КонструкторЦвета(10, 59, 63));
    Соответствие.Вставить("200 20 23", КонструкторЦвета(8, 61, 70));
    Соответствие.Вставить("200 30 05", КонструкторЦвета(63, 77, 78));
    Соответствие.Вставить("200 30 10", КонструкторЦвета(58, 81, 84));
    Соответствие.Вставить("200 30 15", КонструкторЦвета(46, 83, 87));
    Соответствие.Вставить("200 30 20", КонструкторЦвета(34, 84, 88));
    Соответствие.Вставить("200 30 25", КонструкторЦвета(14, 82, 87));
    Соответствие.Вставить("200 30 30", КонструкторЦвета(3, 85, 92));
    Соответствие.Вставить("200 30 33", КонструкторЦвета(0, 85, 96));
    Соответствие.Вставить("200 40 05", КонструкторЦвета(8, 10, 101));
    Соответствие.Вставить("200 40 10", КонструкторЦвета(7, 10, 104));
    Соответствие.Вставить("200 40 15", КонструкторЦвета(6, 10, 108));
    Соответствие.Вставить("200 40 20", КонструкторЦвета(5, 10, 112));
    Соответствие.Вставить("200 40 25", КонструкторЦвета(2, 10, 114));
    Соответствие.Вставить("200 40 30", КонструкторЦвета(1, 10, 116));
    Соответствие.Вставить("200 40 35", КонструкторЦвета(, 10, 117));
    Соответствие.Вставить("200 40 40", КонструкторЦвета(, 10, 122));
    Соответствие.Вставить("200 50 05", КонструкторЦвета(10, 12, 124));
    Соответствие.Вставить("200 50 10", КонструкторЦвета(9, 12, 130));
    Соответствие.Вставить("200 50 15", КонструкторЦвета(8, 12, 132));
    Соответствие.Вставить("200 50 20", КонструкторЦвета(7, 13, 134));
    Соответствие.Вставить("200 50 25", КонструкторЦвета(5, 13, 138));
    Соответствие.Вставить("200 50 30", КонструкторЦвета(2, 13, 142));
    Соответствие.Вставить("200 50 35", КонструкторЦвета(, 13, 144));
    Соответствие.Вставить("200 50 40", КонструкторЦвета(, 13, 148));
    Соответствие.Вставить("200 50 45", КонструкторЦвета(, 13, 150));
    Соответствие.Вставить("200 60 05", КонструкторЦвета(13, 14, 150));
    Соответствие.Вставить("200 60 10", КонструкторЦвета(12, 15, 154));
    Соответствие.Вставить("200 60 15", КонструкторЦвета(11, 15, 158));
    Соответствие.Вставить("200 60 20", КонструкторЦвета(9, 15, 160));
    Соответствие.Вставить("200 60 25", КонструкторЦвета(8, 15, 163));
    Соответствие.Вставить("200 60 30", КонструкторЦвета(5, 15, 165));
    Соответствие.Вставить("200 60 35", КонструкторЦвета(3, 16, 171));
    Соответствие.Вставить("200 60 40", КонструкторЦвета(2, 16, 175));
    Соответствие.Вставить("200 70 05", КонструкторЦвета(16, 17, 176));
    Соответствие.Вставить("200 70 10", КонструкторЦвета(14, 17, 183));
    Соответствие.Вставить("200 70 15", КонструкторЦвета(13, 18, 183));
    Соответствие.Вставить("200 70 20", КонструкторЦвета(12, 18, 185));
    Соответствие.Вставить("200 70 25", КонструкторЦвета(11, 18, 193));
    Соответствие.Вставить("200 80 05", КонструкторЦвета(18, 20, 203));
    Соответствие.Вставить("200 80 10", КонструкторЦвета(17, 20, 207));
    Соответствие.Вставить("200 80 15", КонструкторЦвета(16, 20, 207));
    Соответствие.Вставить("200 80 20", КонструкторЦвета(15, 21, 214));
    Соответствие.Вставить("200 80 25", КонструкторЦвета(13, 21, 217));
    Соответствие.Вставить("200 90 05", КонструкторЦвета(21, 23, 232));
    Соответствие.Вставить("200 90 10", КонструкторЦвета(20, 23, 233));
    Соответствие.Вставить("200 92 05", КонструкторЦвета(21, 23, 239));
    Соответствие.Вставить("210 30 15", КонструкторЦвета(40, 79, 86));
    Соответствие.Вставить("210 30 20", КонструкторЦвета(27, 83, 93));
    Соответствие.Вставить("210 30 25", КонструкторЦвета(14, 81, 95));
    Соответствие.Вставить("210 30 30", КонструкторЦвета(7, 80, 98));
    Соответствие.Вставить("210 40 10", КонструкторЦвета(7, 10, 105));
    Соответствие.Вставить("210 40 15", КонструкторЦвета(6, 10, 112));
    Соответствие.Вставить("210 40 20", КонструкторЦвета(4, 10, 114));
    Соответствие.Вставить("210 40 25", КонструкторЦвета(2, 10, 116));
    Соответствие.Вставить("210 40 30", КонструкторЦвета(, 10, 121));
    Соответствие.Вставить("210 40 35", КонструкторЦвета(, 10, 124));
    Соответствие.Вставить("210 40 38", КонструкторЦвета(, 10, 128));
    Соответствие.Вставить("210 50 10", КонструкторЦвета(9, 12, 131));
    Соответствие.Вставить("210 50 15", КонструкторЦвета(8, 12, 132));
    Соответствие.Вставить("210 50 20", КонструкторЦвета(7, 12, 138));
    Соответствие.Вставить("210 50 25", КонструкторЦвета(5, 13, 141));
    Соответствие.Вставить("210 50 30", КонструкторЦвета(3, 12, 146));
    Соответствие.Вставить("210 50 35", КонструкторЦвета(2, 13, 149));
    Соответствие.Вставить("210 50 40", КонструкторЦвета(, 13, 155));
    Соответствие.Вставить("210 50 45", КонструкторЦвета(, 13, 160));
    Соответствие.Вставить("210 60 10", КонструкторЦвета(12, 15, 157));
    Соответствие.Вставить("210 60 15", КонструкторЦвета(11, 15, 159));
    Соответствие.Вставить("210 60 20", КонструкторЦвета(9, 15, 167));
    Соответствие.Вставить("210 60 25", КонструкторЦвета(8, 15, 172));
    Соответствие.Вставить("210 60 30", КонструкторЦвета(6, 16, 177));
    Соответствие.Вставить("210 60 35", КонструкторЦвета(3, 15, 179));
    Соответствие.Вставить("210 60 40", КонструкторЦвета(1, 15, 184));
    Соответствие.Вставить("210 70 10", КонструкторЦвета(14, 17, 182));
    Соответствие.Вставить("210 70 15", КонструкторЦвета(14, 18, 188));
    Соответствие.Вставить("210 70 20", КонструкторЦвета(12, 18, 192));
    Соответствие.Вставить("210 70 25", КонструкторЦвета(11, 18, 198));
    Соответствие.Вставить("210 70 30", КонструкторЦвета(9, 18, 204));
    Соответствие.Вставить("210 70 35", КонструкторЦвета(7, 18, 206));
    Соответствие.Вставить("210 80 10", КонструкторЦвета(18, 20, 211));
    Соответствие.Вставить("210 80 15", КонструкторЦвета(16, 21, 214));
    Соответствие.Вставить("210 80 20", КонструкторЦвета(15, 21, 219));
    Соответствие.Вставить("210 80 25", КонструкторЦвета(14, 21, 223));
    Соответствие.Вставить("210 90 05", КонструкторЦвета(21, 23, 235));
    Соответствие.Вставить("210 90 10", КонструкторЦвета(20, 23, 235));
    Соответствие.Вставить("220 20 05", КонструкторЦвета(46, 56, 60));
    Соответствие.Вставить("220 20 15", КонструкторЦвета(29, 58, 70));
    Соответствие.Вставить("220 20 20", КонструкторЦвета(22, 58, 73));
    Соответствие.Вставить("220 30 05", КонструкторЦвета(65, 75, 79));
    Соответствие.Вставить("220 30 10", КонструкторЦвета(57, 79, 85));
    Соответствие.Вставить("220 30 15", КонструкторЦвета(42, 81, 92));
    Соответствие.Вставить("220 30 20", КонструкторЦвета(30, 80, 95));
    Соответствие.Вставить("220 30 25", КонструкторЦвета(14, 81, 99));
    Соответствие.Вставить("220 30 30", КонструкторЦвета(6, 8, 105));
    Соответствие.Вставить("220 40 05", КонструкторЦвета(8, 10, 103));
    Соответствие.Вставить("220 40 10", КонструкторЦвета(8, 10, 109));
    Соответствие.Вставить("220 40 15", КонструкторЦвета(6, 10, 115));
    Соответствие.Вставить("220 40 20", КонструкторЦвета(5, 10, 119));
    Соответствие.Вставить("220 40 25", КонструкторЦвета(4, 10, 123));
    Соответствие.Вставить("220 40 30", КонструкторЦвета(2, 10, 131));
    Соответствие.Вставить("220 40 35", КонструкторЦвета(1, 10, 136));
    Соответствие.Вставить("220 40 40", КонструкторЦвета(, 10, 140));
    Соответствие.Вставить("220 50 05", КонструкторЦвета(11, 12, 129));
    Соответствие.Вставить("220 50 10", КонструкторЦвета(10, 12, 133));
    Соответствие.Вставить("220 50 15", КонструкторЦвета(8, 12, 139));
    Соответствие.Вставить("220 50 20", КонструкторЦвета(7, 12, 143));
    Соответствие.Вставить("220 50 25", КонструкторЦвета(6, 12, 146));
    Соответствие.Вставить("220 50 30", КонструкторЦвета(3, 13, 154));
    Соответствие.Вставить("220 50 35", КонструкторЦвета(1, 12, 159));
    Соответствие.Вставить("220 50 40", КонструкторЦвета(, 13, 165));
    Соответствие.Вставить("220 60 05", КонструкторЦвета(13, 14, 152));
    Соответствие.Вставить("220 60 10", КонструкторЦвета(12, 15, 159));
    Соответствие.Вставить("220 60 15", КонструкторЦвета(11, 15, 165));
    Соответствие.Вставить("220 60 20", КонструкторЦвета(10, 15, 169));
    Соответствие.Вставить("220 60 25", КонструкторЦвета(8, 15, 176));
    Соответствие.Вставить("220 60 30", КонструкторЦвета(7, 15, 183));
    Соответствие.Вставить("220 60 35", КонструкторЦвета(5, 15, 185));
    Соответствие.Вставить("220 60 40", КонструкторЦвета(2, 15, 191));
    Соответствие.Вставить("220 70 05", КонструкторЦвета(16, 17, 180));
    Соответствие.Вставить("220 70 10", КонструкторЦвета(15, 17, 188));
    Соответствие.Вставить("220 70 15", КонструкторЦвета(14, 18, 193));
    Соответствие.Вставить("220 70 20", КонструкторЦвета(12, 18, 198));
    Соответствие.Вставить("220 70 25", КонструкторЦвета(11, 18, 202));
    Соответствие.Вставить("220 70 30", КонструкторЦвета(9, 18, 205));
    Соответствие.Вставить("220 70 35", КонструкторЦвета(8, 18, 215));
    Соответствие.Вставить("220 80 05", КонструкторЦвета(18, 20, 205));
    Соответствие.Вставить("220 80 10", КонструкторЦвета(17, 20, 214));
    Соответствие.Вставить("220 80 15", КонструкторЦвета(16, 21, 222));
    Соответствие.Вставить("220 80 20", КонструкторЦвета(16, 21, 227));
    Соответствие.Вставить("220 80 25", КонструкторЦвета(14, 21, 230));
    Соответствие.Вставить("220 90 05", КонструкторЦвета(21, 23, 233));
    Соответствие.Вставить("220 92 05", КонструкторЦвета(22, 23, 241));
    Соответствие.Вставить("230 20 10", КонструкторЦвета(41, 58, 67));
    Соответствие.Вставить("230 20 20", КонструкторЦвета(23, 55, 76));
    Соответствие.Вставить("230 30 15", КонструкторЦвета(48, 79, 92));
    Соответствие.Вставить("230 30 20", КонструкторЦвета(40, 79, 98));
    Соответствие.Вставить("230 30 25", КонструкторЦвета(24, 8, 105));
    Соответствие.Вставить("230 40 10", КонструкторЦвета(79, 9, 109));
    Соответствие.Вставить("230 40 15", КонструкторЦвета(7, 10, 115));
    Соответствие.Вставить("230 40 20", КонструкторЦвета(5, 10, 122));
    Соответствие.Вставить("230 40 25", КонструкторЦвета(3, 10, 128));
    Соответствие.Вставить("230 40 30", КонструкторЦвета(2, 10, 134));
    Соответствие.Вставить("230 40 35", КонструкторЦвета(, 10, 142));
    Соответствие.Вставить("230 40 40", КонструкторЦвета(, 10, 145));
    Соответствие.Вставить("230 50 10", КонструкторЦвета(10, 12, 134));
    Соответствие.Вставить("230 50 15", КонструкторЦвета(9, 12, 141));
    Соответствие.Вставить("230 50 20", КонструкторЦвета(8, 12, 148));
    Соответствие.Вставить("230 50 25", КонструкторЦвета(6, 12, 153));
    Соответствие.Вставить("230 50 30", КонструкторЦвета(5, 12, 157));
    Соответствие.Вставить("230 50 35", КонструкторЦвета(3, 12, 166));
    Соответствие.Вставить("230 50 40", КонструкторЦвета(1, 12, 172));
    Соответствие.Вставить("230 60 10", КонструкторЦвета(12, 15, 162));
    Соответствие.Вставить("230 60 15", КонструкторЦвета(11, 15, 167));
    Соответствие.Вставить("230 60 20", КонструкторЦвета(10, 15, 175));
    Соответствие.Вставить("230 60 25", КонструкторЦвета(9, 15, 179));
    Соответствие.Вставить("230 60 30", КонструкторЦвета(8, 15, 186));
    Соответствие.Вставить("230 60 35", КонструкторЦвета(6, 15, 193));
    Соответствие.Вставить("230 60 40", КонструкторЦвета(4, 15, 200));
    Соответствие.Вставить("230 70 10", КонструкторЦвета(15, 17, 190));
    Соответствие.Вставить("230 70 15", КонструкторЦвета(14, 17, 193));
    Соответствие.Вставить("230 70 20", КонструкторЦвета(12, 17, 201));
    Соответствие.Вставить("230 70 25", КонструкторЦвета(12, 18, 209));
    Соответствие.Вставить("230 70 30", КонструкторЦвета(10, 18, 214));
    Соответствие.Вставить("230 80 10", КонструкторЦвета(18, 20, 217));
    Соответствие.Вставить("230 80 15", КонструкторЦвета(17, 20, 220));
    Соответствие.Вставить("230 80 20", КонструкторЦвета(16, 20, 228));
    Соответствие.Вставить("230 90 05", КонструкторЦвета(21, 23, 233));
    Соответствие.Вставить("240 20 15", КонструкторЦвета(34, 57, 73));
    Соответствие.Вставить("240 20 20", КонструкторЦвета(26, 55, 79));
    Соответствие.Вставить("240 20 22", КонструкторЦвета(21, 54, 81));
    Соответствие.Вставить("240 30 05", КонструкторЦвета(67, 76, 82));
    Соответствие.Вставить("240 30 10", КонструкторЦвета(62, 80, 92));
    Соответствие.Вставить("240 30 15", КонструкторЦвета(54, 79, 97));
    Соответствие.Вставить("240 30 20", КонструкторЦвета(44, 7, 102));
    Соответствие.Вставить("240 30 25", КонструкторЦвета(33, 7, 108));
    Соответствие.Вставить("240 30 30", КонструкторЦвета(18, 7, 115));
    Соответствие.Вставить("240 30 35", КонструкторЦвета(2, 7, 119));
    Соответствие.Вставить("240 40 05", КонструкторЦвета(88, 9, 105));
    Соответствие.Вставить("240 40 10", КонструкторЦвета(8, 10, 112));
    Соответствие.Вставить("240 40 15", КонструкторЦвета(7, 10, 121));
    Соответствие.Вставить("240 40 20", КонструкторЦвета(6, 10, 126));
    Соответствие.Вставить("240 40 25", КонструкторЦвета(5, 10, 134));
    Соответствие.Вставить("240 40 30", КонструкторЦвета(35, 9, 141));
    Соответствие.Вставить("240 40 35", КонструкторЦвета(23, 9, 145));
    Соответствие.Вставить("240 40 40", КонструкторЦвета(13, 9, 153));
    Соответствие.Вставить("240 50 05", КонструкторЦвета(11, 12, 128));
    Соответствие.Вставить("240 50 10", КонструкторЦвета(10, 12, 139));
    Соответствие.Вставить("240 50 15", КонструкторЦвета(9, 12, 145));
    Соответствие.Вставить("240 50 20", КонструкторЦвета(8, 12, 151));
    Соответствие.Вставить("240 50 25", КонструкторЦвета(7, 12, 160));
    Соответствие.Вставить("240 50 30", КонструкторЦвета(5, 12, 165));
    Соответствие.Вставить("240 50 35", КонструкторЦвета(3, 12, 172));
    Соответствие.Вставить("240 50 40", КонструкторЦвета(3, 12, 179));
    Соответствие.Вставить("240 60 05", КонструкторЦвета(13, 14, 157));
    Соответствие.Вставить("240 60 10", КонструкторЦвета(12, 14, 163));
    Соответствие.Вставить("240 60 15", КонструкторЦвета(11, 15, 171));
    Соответствие.Вставить("240 60 20", КонструкторЦвета(11, 15, 179));
    Соответствие.Вставить("240 60 25", КонструкторЦвета(9, 15, 187));
    Соответствие.Вставить("240 60 30", КонструкторЦвета(8, 15, 194));
    Соответствие.Вставить("240 60 35", КонструкторЦвета(6, 15, 202));
    Соответствие.Вставить("240 60 40", КонструкторЦвета(5, 15, 205));
    Соответствие.Вставить("240 70 05", КонструкторЦвета(16, 17, 182));
    Соответствие.Вставить("240 70 10", КонструкторЦвета(15, 17, 189));
    Соответствие.Вставить("240 70 15", КонструкторЦвета(14, 17, 197));
    Соответствие.Вставить("240 70 20", КонструкторЦвета(13, 17, 205));
    Соответствие.Вставить("240 70 25", КонструкторЦвета(12, 17, 212));
    Соответствие.Вставить("240 70 30", КонструкторЦвета(11, 17, 219));
    Соответствие.Вставить("240 80 05", КонструкторЦвета(18, 20, 208));
    Соответствие.Вставить("240 80 10", КонструкторЦвета(18, 20, 218));
    Соответствие.Вставить("240 80 15", КонструкторЦвета(17, 20, 225));
    Соответствие.Вставить("240 80 20", КонструкторЦвета(16, 20, 235));
    Соответствие.Вставить("240 90 05", КонструкторЦвета(22, 23, 239));
    Соответствие.Вставить("250 20 20", КонструкторЦвета(27, 55, 82));
    Соответствие.Вставить("250 20 25", КонструкторЦвета(29, 55, 90));
    Соответствие.Вставить("250 30 15", КонструкторЦвета(57, 78, 98));
    Соответствие.Вставить("250 30 20", КонструкторЦвета(42, 7, 104));
    Соответствие.Вставить("250 30 25", КонструкторЦвета(42, 7, 112));
    Соответствие.Вставить("250 30 30", КонструкторЦвета(30, 7, 122));
    Соответствие.Вставить("250 40 10", КонструкторЦвета(8, 10, 115));
    Соответствие.Вставить("250 40 15", КонструкторЦвета(78, 9, 122));
    Соответствие.Вставить("250 40 20", КонструкторЦвета(67, 9, 127));
    Соответствие.Вставить("250 40 25", КонструкторЦвета(56, 9, 136));
    Соответствие.Вставить("250 40 30", КонструкторЦвета(47, 9, 141));
    Соответствие.Вставить("250 40 35", КонструкторЦвета(32, 9, 148));
    Соответствие.Вставить("250 40 40", КонструкторЦвета(17, 9, 155));
    Соответствие.Вставить("250 50 10", КонструкторЦвета(10, 12, 139));
    Соответствие.Вставить("250 50 15", КонструкторЦвета(10, 12, 146));
    Соответствие.Вставить("250 50 20", КонструкторЦвета(9, 12, 154));
    Соответствие.Вставить("250 50 25", КонструкторЦвета(8, 12, 160));
    Соответствие.Вставить("250 50 30", КонструкторЦвета(7, 12, 169));
    Соответствие.Вставить("250 50 35", КонструкторЦвета(5, 12, 177));
    Соответствие.Вставить("250 50 40", КонструкторЦвета(4, 12, 185));
    Соответствие.Вставить("250 60 10", КонструкторЦвета(13, 14, 165));
    Соответствие.Вставить("250 60 15", КонструкторЦвета(12, 14, 174));
    Соответствие.Вставить("250 60 20", КонструкторЦвета(11, 14, 181));
    Соответствие.Вставить("250 60 25", КонструкторЦвета(10, 14, 189));
    Соответствие.Вставить("250 60 30", КонструкторЦвета(9, 14, 195));
    Соответствие.Вставить("250 60 35", КонструкторЦвета(9, 14, 205));
    Соответствие.Вставить("250 60 40", КонструкторЦвета(8, 14, 215));
    Соответствие.Вставить("250 70 10", КонструкторЦвета(15, 17, 191));
    Соответствие.Вставить("250 70 15", КонструкторЦвета(15, 17, 200));
    Соответствие.Вставить("250 70 20", КонструкторЦвета(14, 17, 208));
    Соответствие.Вставить("250 70 25", КонструкторЦвета(13, 17, 217));
    Соответствие.Вставить("250 70 30", КонструкторЦвета(12, 17, 224));
    Соответствие.Вставить("250 80 10", КонструкторЦвета(18, 20, 218));
    Соответствие.Вставить("250 80 15", КонструкторЦвета(18, 20, 226));
    Соответствие.Вставить("250 80 20", КонструкторЦвета(16, 20, 232));
    Соответствие.Вставить("250 90 05", КонструкторЦвета(22, 22, 236));
    Соответствие.Вставить("250 92 05", КонструкторЦвета(22, 23, 243));
    Соответствие.Вставить("260 20 05", КонструкторЦвета(50, 55, 62));
    Соответствие.Вставить("260 20 10", КонструкторЦвета(48, 56, 69));
    Соответствие.Вставить("260 20 15", КонструкторЦвета(42, 55, 75));
    Соответствие.Вставить("260 20 20", КонструкторЦвета(37, 55, 82));
    Соответствие.Вставить("260 30 05", КонструкторЦвета(70, 75, 83));
    Соответствие.Вставить("260 30 10", КонструкторЦвета(66, 75, 90));
    Соответствие.Вставить("260 30 15", КонструкторЦвета(61, 74, 98));
    Соответствие.Вставить("260 30 20", КонструкторЦвета(55, 7, 106));
    Соответствие.Вставить("260 30 25", КонструкторЦвета(48, 7, 113));
    Соответствие.Вставить("260 30 30", КонструкторЦвета(44, 7, 121));
    Соответствие.Вставить("260 30 35", КонструкторЦвета(22, 7, 128));
    Соответствие.Вставить("260 40 05", КонструкторЦвета(91, 9, 105));
    Соответствие.Вставить("260 40 10", КонструкторЦвета(87, 9, 114));
    Соответствие.Вставить("260 40 15", КонструкторЦвета(85, 9, 122));
    Соответствие.Вставить("260 40 20", КонструкторЦвета(77, 9, 130));
    Соответствие.Вставить("260 40 25", КонструкторЦвета(71, 9, 136));
    Соответствие.Вставить("260 40 30", КонструкторЦвета(62, 9, 142));
    Соответствие.Вставить("260 40 35", КонструкторЦвета(56, 9, 151));
    Соответствие.Вставить("260 40 40", КонструкторЦвета(35, 9, 159));
    Соответствие.Вставить("260 40 45", КонструкторЦвета(19, 9, 167));
    Соответствие.Вставить("260 50 05", КонструкторЦвета(11, 12, 128));
    Соответствие.Вставить("260 50 10", КонструкторЦвета(11, 12, 137));
    Соответствие.Вставить("260 50 15", КонструкторЦвета(10, 12, 145));
    Соответствие.Вставить("260 50 20", КонструкторЦвета(10, 12, 154));
    Соответствие.Вставить("260 50 25", КонструкторЦвета(9, 12, 163));
    Соответствие.Вставить("260 50 30", КонструкторЦвета(8, 12, 173));
    Соответствие.Вставить("260 50 35", КонструкторЦвета(7, 11, 177));
    Соответствие.Вставить("260 50 40", КонструкторЦвета(6, 11, 187));
    Соответствие.Вставить("260 60 05", КонструкторЦвета(14, 14, 154));
    Соответствие.Вставить("260 60 10", КонструкторЦвета(13, 14, 163));
    Соответствие.Вставить("260 60 15", КонструкторЦвета(13, 14, 172));
    Соответствие.Вставить("260 60 20", КонструкторЦвета(12, 14, 180));
    Соответствие.Вставить("260 60 25", КонструкторЦвета(12, 14, 188));
    Соответствие.Вставить("260 60 30", КонструкторЦвета(11, 14, 196));
    Соответствие.Вставить("260 60 35", КонструкторЦвета(10, 14, 206));
    Соответствие.Вставить("260 70 05", КонструкторЦвета(16, 17, 183));
    Соответствие.Вставить("260 70 10", КонструкторЦвета(16, 17, 192));
    Соответствие.Вставить("260 70 15", КонструкторЦвета(15, 17, 200));
    Соответствие.Вставить("260 70 20", КонструкторЦвета(15, 17, 207));
    Соответствие.Вставить("260 70 25", КонструкторЦвета(14, 17, 217));
    Соответствие.Вставить("260 80 05", КонструкторЦвета(19, 20, 208));
    Соответствие.Вставить("260 80 10", КонструкторЦвета(18, 20, 219));
    Соответствие.Вставить("260 80 15", КонструкторЦвета(18, 20, 225));
    Соответствие.Вставить("260 90 05", КонструкторЦвета(22, 22, 233));
    Соответствие.Вставить("270 20 20", КонструкторЦвета(42, 52, 84));
    Соответствие.Вставить("270 20 25", КонструкторЦвета(40, 53, 90));
    Соответствие.Вставить("270 20 29", КонструкторЦвета(37, 52, 98));
    Соответствие.Вставить("270 30 15", КонструкторЦвета(70, 7, 101));
    Соответствие.Вставить("270 30 20", КонструкторЦвета(65, 7, 106));
    Соответствие.Вставить("270 30 25", КонструкторЦвета(62, 7, 114));
    Соответствие.Вставить("270 30 30", КонструкторЦвета(57, 7, 122));
    Соответствие.Вставить("270 30 35", КонструкторЦвета(51, 7, 128));
    Соответствие.Вставить("270 30 40", КонструкторЦвета(43, 6, 138));
    Соответствие.Вставить("270 40 15", КонструкторЦвета(90, 9, 124));
    Соответствие.Вставить("270 40 20", КонструкторЦвета(85, 9, 132));
    Соответствие.Вставить("270 40 25", КонструкторЦвета(83, 9, 139));
    Соответствие.Вставить("270 40 30", КонструкторЦвета(79, 9, 147));
    Соответствие.Вставить("270 40 35", КонструкторЦвета(70, 9, 155));
    Соответствие.Вставить("270 40 40", КонструкторЦвета(67, 9, 162));
    Соответствие.Вставить("270 50 10", КонструкторЦвета(11, 12, 142));
    Соответствие.Вставить("270 50 15", КонструкторЦвета(11, 12, 150));
    Соответствие.Вставить("270 50 20", КонструкторЦвета(10, 12, 157));
    Соответствие.Вставить("270 50 25", КонструкторЦвета(10, 11, 165));
    Соответствие.Вставить("270 50 30", КонструкторЦвета(10, 11, 173));
    Соответствие.Вставить("270 50 35", КонструкторЦвета(9, 11, 179));
    Соответствие.Вставить("270 50 40", КонструкторЦвета(9, 11, 189));
    Соответствие.Вставить("270 60 10", КонструкторЦвета(13, 14, 167));
    Соответствие.Вставить("270 60 15", КонструкторЦвета(13, 14, 176));
    Соответствие.Вставить("270 60 20", КонструкторЦвета(13, 14, 184));
    Соответствие.Вставить("270 60 25", КонструкторЦвета(12, 14, 191));
    Соответствие.Вставить("270 60 30", КонструкторЦвета(12, 14, 201));
    Соответствие.Вставить("270 60 35", КонструкторЦвета(11, 14, 208));
    Соответствие.Вставить("270 70 10", КонструкторЦвета(16, 17, 195));
    Соответствие.Вставить("270 70 15", КонструкторЦвета(16, 17, 202));
    Соответствие.Вставить("270 70 20", КонструкторЦвета(16, 17, 213));
    Соответствие.Вставить("270 70 25", КонструкторЦвета(15, 16, 219));
    Соответствие.Вставить("270 80 10", КонструкторЦвета(19, 20, 221));
    Соответствие.Вставить("270 80 15", КонструкторЦвета(19, 20, 228));
    Соответствие.Вставить("270 90 05", КонструкторЦвета(22, 22, 237));
    Соответствие.Вставить("280 20 15", КонструкторЦвета(50, 53, 76));
    Соответствие.Вставить("280 20 20", КонструкторЦвета(49, 52, 81));
    Соответствие.Вставить("280 20 25", КонструкторЦвета(50, 52, 90));
    Соответствие.Вставить("280 20 30", КонструкторЦвета(45, 49, 95));
    Соответствие.Вставить("280 30 05", КонструкторЦвета(72, 75, 83));
    Соответствие.Вставить("280 30 10", КонструкторЦвета(73, 74, 92));
    Соответствие.Вставить("280 30 15", КонструкторЦвета(73, 7, 100));
    Соответствие.Вставить("280 30 20", КонструкторЦвета(69, 7, 106));
    Соответствие.Вставить("280 30 25", КонструкторЦвета(68, 7, 114));
    Соответствие.Вставить("280 30 30", КонструкторЦвета(64, 6, 120));
    Соответствие.Вставить("280 30 35", КонструкторЦвета(62, 6, 126));
    Соответствие.Вставить("280 30 40", КонструкторЦвета(60, 6, 133));
    Соответствие.Вставить("280 40 05", КонструкторЦвета(95, 9, 106));
    Соответствие.Вставить("280 40 10", КонструкторЦвета(93, 9, 113));
    Соответствие.Вставить("280 40 15", КонструкторЦвета(92, 9, 120));
    Соответствие.Вставить("280 40 20", КонструкторЦвета(90, 9, 129));
    Соответствие.Вставить("280 40 25", КонструкторЦвета(91, 9, 139));
    Соответствие.Вставить("280 40 30", КонструкторЦвета(87, 9, 143));
    Соответствие.Вставить("280 40 35", КонструкторЦвета(84, 8, 151));
    Соответствие.Вставить("280 40 40", КонструкторЦвета(79, 8, 160));
    Соответствие.Вставить("280 40 45", КонструкторЦвета(75, 8, 169));
    Соответствие.Вставить("280 50 05", КонструкторЦвета(11, 12, 130));
    Соответствие.Вставить("280 50 10", КонструкторЦвета(11, 11, 138));
    Соответствие.Вставить("280 50 15", КонструкторЦвета(11, 11, 146));
    Соответствие.Вставить("280 50 20", КонструкторЦвета(11, 11, 156));
    Соответствие.Вставить("280 50 25", КонструкторЦвета(11, 11, 163));
    Соответствие.Вставить("280 50 30", КонструкторЦвета(11, 11, 171));
    Соответствие.Вставить("280 50 35", КонструкторЦвета(10, 11, 178));
    Соответствие.Вставить("280 50 40", КонструкторЦвета(10, 11, 189));
    Соответствие.Вставить("280 60 05", КонструкторЦвета(14, 14, 156));
    Соответствие.Вставить("280 60 10", КонструкторЦвета(14, 14, 164));
    Соответствие.Вставить("280 60 15", КонструкторЦвета(14, 14, 172));
    Соответствие.Вставить("280 60 20", КонструкторЦвета(14, 14, 181));
    Соответствие.Вставить("280 60 25", КонструкторЦвета(14, 14, 190));
    Соответствие.Вставить("280 60 30", КонструкторЦвета(13, 13, 196));
    Соответствие.Вставить("280 60 35", КонструкторЦвета(13, 13, 207));
    Соответствие.Вставить("280 70 05", КонструкторЦвета(17, 17, 180));
    Соответствие.Вставить("280 70 10", КонструкторЦвета(17, 17, 191));
    Соответствие.Вставить("280 70 15", КонструкторЦвета(17, 17, 200));
    Соответствие.Вставить("280 70 20", КонструкторЦвета(16, 16, 209));
    Соответствие.Вставить("280 70 25", КонструкторЦвета(16, 16, 218));
    Соответствие.Вставить("280 80 05", КонструкторЦвета(20, 20, 211));
    Соответствие.Вставить("280 80 10", КонструкторЦвета(19, 20, 218));
    Соответствие.Вставить("280 80 15", КонструкторЦвета(19, 19, 225));
    Соответствие.Вставить("280 90 05", КонструкторЦвета(22, 22, 235));
    Соответствие.Вставить("290 20 10", КонструкторЦвета(52, 52, 69));
    Соответствие.Вставить("290 20 20", КонструкторЦвета(58, 52, 82));
    Соответствие.Вставить("290 20 25", КонструкторЦвета(57, 51, 90));
    Соответствие.Вставить("290 20 30", КонструкторЦвета(53, 48, 95));
    Соответствие.Вставить("290 20 35", КонструкторЦвета(55, 4, 101));
    Соответствие.Вставить("290 30 15", КонструкторЦвета(75, 71, 96));
    Соответствие.Вставить("290 30 20", КонструкторЦвета(77, 6, 104));
    Соответствие.Вставить("290 30 25", КонструкторЦвета(76, 6, 111));
    Соответствие.Вставить("290 30 30", КонструкторЦвета(76, 6, 120));
    Соответствие.Вставить("290 30 35", КонструкторЦвета(76, 6, 127));
    Соответствие.Вставить("290 30 40", КонструкторЦвета(76, 6, 135));
    Соответствие.Вставить("290 40 10", КонструкторЦвета(98, 9, 115));
    Соответствие.Вставить("290 40 15", КонструкторЦвета(100, 9, 120));
    Соответствие.Вставить("290 40 20", КонструкторЦвета(99, 9, 129));
    Соответствие.Вставить("290 40 25", КонструкторЦвета(98, 8, 136));
    Соответствие.Вставить("290 40 30", КонструкторЦвета(98, 8, 143));
    Соответствие.Вставить("290 40 35", КонструкторЦвета(97, 8, 149));
    Соответствие.Вставить("290 40 40", КонструкторЦвета(97, 8, 159));
    Соответствие.Вставить("290 40 45", КонструкторЦвета(95, 8, 164));
    Соответствие.Вставить("290 50 10", КонструкторЦвета(12, 11, 139));
    Соответствие.Вставить("290 50 15", КонструкторЦвета(12, 11, 143));
    Соответствие.Вставить("290 50 20", КонструкторЦвета(12, 11, 154));
    Соответствие.Вставить("290 50 25", КонструкторЦвета(12, 11, 161));
    Соответствие.Вставить("290 50 30", КонструкторЦвета(12, 10, 168));
    Соответствие.Вставить("290 50 35", КонструкторЦвета(12, 10, 176));
    Соответствие.Вставить("290 50 40", КонструкторЦвета(12, 10, 184));
    Соответствие.Вставить("290 60 10", КонструкторЦвета(14, 14, 165));
    Соответствие.Вставить("290 60 15", КонструкторЦвета(14, 14, 173));
    Соответствие.Вставить("290 60 20", КонструкторЦвета(15, 13, 181));
    Соответствие.Вставить("290 60 25", КонструкторЦвета(14, 13, 188));
    Соответствие.Вставить("290 60 30", КонструкторЦвета(14, 13, 196));
    Соответствие.Вставить("290 60 35", КонструкторЦвета(14, 13, 202));
    Соответствие.Вставить("290 70 10", КонструкторЦвета(17, 17, 192));
    Соответствие.Вставить("290 70 15", КонструкторЦвета(17, 16, 201));
    Соответствие.Вставить("290 70 20", КонструкторЦвета(17, 16, 207));
    Соответствие.Вставить("290 70 25", КонструкторЦвета(17, 16, 216));
    Соответствие.Вставить("290 80 10", КонструкторЦвета(20, 19, 217));
    Соответствие.Вставить("290 80 15", КонструкторЦвета(20, 19, 224));
    Соответствие.Вставить("290 90 05", КонструкторЦвета(22, 22, 236));
    Соответствие.Вставить("290 92 05", КонструкторЦвета(23, 23, 244));
    Соответствие.Вставить("300 20 05", КонструкторЦвета(56, 54, 62));
    Соответствие.Вставить("300 20 15", КонструкторЦвета(61, 51, 74));
    Соответствие.Вставить("300 20 20", КонструкторЦвета(62, 48, 78));
    Соответствие.Вставить("300 20 25", КонструкторЦвета(61, 48, 83));
    Соответствие.Вставить("300 20 30", КонструкторЦвета(60, 44, 92));
    Соответствие.Вставить("300 30 05", КонструкторЦвета(76, 73, 81));
    Соответствие.Вставить("300 30 10", КонструкторЦвета(80, 72, 90));
    Соответствие.Вставить("300 30 15", КонструкторЦвета(81, 69, 95));
    Соответствие.Вставить("300 30 20", КонструкторЦвета(82, 6, 100));
    Соответствие.Вставить("300 30 25", КонструкторЦвета(85, 6, 110));
    Соответствие.Вставить("300 30 30", КонструкторЦвета(86, 6, 115));
    Соответствие.Вставить("300 30 35", КонструкторЦвета(87, 6, 121));
    Соответствие.Вставить("300 30 40", КонструкторЦвета(86, 5, 127));
    Соответствие.Вставить("300 40 05", КонструкторЦвета(99, 9, 105));
    Соответствие.Вставить("300 40 10", КонструкторЦвета(101, 9, 112));
    Соответствие.Вставить("300 40 15", КонструкторЦвета(104, 9, 118));
    Соответствие.Вставить("300 40 20", КонструкторЦвета(106, 8, 126));
    Соответствие.Вставить("300 40 25", КонструкторЦвета(109, 8, 132));
    Соответствие.Вставить("300 40 30", КонструкторЦвета(110, 8, 139));
    Соответствие.Вставить("300 40 35", КонструкторЦвета(109, 8, 143));
    Соответствие.Вставить("300 40 40", КонструкторЦвета(110, 7, 150));
    Соответствие.Вставить("300 40 45", КонструкторЦвета(112, 7, 160));
    Соответствие.Вставить("300 50 05", КонструкторЦвета(12, 11, 128));
    Соответствие.Вставить("300 50 10", КонструкторЦвета(12, 11, 136));
    Соответствие.Вставить("300 50 15", КонструкторЦвета(12, 11, 144));
    Соответствие.Вставить("300 50 20", КонструкторЦвета(13, 11, 150));
    Соответствие.Вставить("300 50 25", КонструкторЦвета(13, 10, 157));
    Соответствие.Вставить("300 50 30", КонструкторЦвета(13, 10, 164));
    Соответствие.Вставить("300 50 35", КонструкторЦвета(13, 10, 173));
    Соответствие.Вставить("300 50 40", КонструкторЦвета(13, 10, 179));
    Соответствие.Вставить("300 60 05", КонструкторЦвета(14, 14, 157));
    Соответствие.Вставить("300 60 10", КонструкторЦвета(15, 14, 163));
    Соответствие.Вставить("300 60 15", КонструкторЦвета(15, 13, 171));
    Соответствие.Вставить("300 60 20", КонструкторЦвета(15, 13, 177));
    Соответствие.Вставить("300 60 25", КонструкторЦвета(15, 13, 185));
    Соответствие.Вставить("300 60 30", КонструкторЦвета(16, 13, 192));
    Соответствие.Вставить("300 60 35", КонструкторЦвета(16, 12, 198));
    Соответствие.Вставить("300 70 05", КонструкторЦвета(17, 17, 182));
    Соответствие.Вставить("300 70 10", КонструкторЦвета(18, 16, 189));
    Соответствие.Вставить("300 70 15", КонструкторЦвета(18, 16, 197));
    Соответствие.Вставить("300 70 20", КонструкторЦвета(18, 16, 205));
    Соответствие.Вставить("300 70 25", КонструкторЦвета(18, 15, 212));
    Соответствие.Вставить("300 80 05", КонструкторЦвета(20, 19, 209));
    Соответствие.Вставить("300 80 10", КонструкторЦвета(20, 19, 217));
    Соответствие.Вставить("300 80 15", КонструкторЦвета(20, 19, 225));
    Соответствие.Вставить("300 90 05", КонструкторЦвета(23, 22, 235));
    Соответствие.Вставить("310 20 20", КонструкторЦвета(65, 48, 76));
    Соответствие.Вставить("310 20 25", КонструкторЦвета(71, 45, 82));
    Соответствие.Вставить("310 20 30", КонструкторЦвета(68, 38, 87));
    Соответствие.Вставить("310 30 15", КонструкторЦвета(87, 71, 95));
    Соответствие.Вставить("310 30 20", КонструкторЦвета(89, 6, 102));
    Соответствие.Вставить("310 30 25", КонструкторЦвета(92, 6, 105));
    Соответствие.Вставить("310 30 30", КонструкторЦвета(96, 5, 110));
    Соответствие.Вставить("310 30 35", КонструкторЦвета(96, 5, 113));
    Соответствие.Вставить("310 30 40", КонструкторЦвета(99, 5, 120));
    Соответствие.Вставить("310 40 10", КонструкторЦвета(106, 9, 112));
    Соответствие.Вставить("310 40 15", КонструкторЦвета(110, 9, 119));
    Соответствие.Вставить("310 40 20", КонструкторЦвета(115, 8, 124));
    Соответствие.Вставить("310 40 25", КонструкторЦвета(118, 8, 130));
    Соответствие.Вставить("310 40 30", КонструкторЦвета(118, 8, 134));
    Соответствие.Вставить("310 40 35", КонструкторЦвета(121, 8, 140));
    Соответствие.Вставить("310 40 40", КонструкторЦвета(124, 7, 146));
    Соответствие.Вставить("310 50 10", КонструкторЦвета(13, 11, 137));
    Соответствие.Вставить("310 50 15", КонструкторЦвета(13, 11, 142));
    Соответствие.Вставить("310 50 20", КонструкторЦвета(13, 11, 147));
    Соответствие.Вставить("310 50 25", КонструкторЦвета(14, 10, 155));
    Соответствие.Вставить("310 50 30", КонструкторЦвета(14, 10, 161));
    Соответствие.Вставить("310 50 35", КонструкторЦвета(14, 10, 164));
    Соответствие.Вставить("310 50 40", КонструкторЦвета(14, 10, 172));
    Соответствие.Вставить("310 60 10", КонструкторЦвета(15, 14, 161));
    Соответствие.Вставить("310 60 15", КонструкторЦвета(16, 13, 167));
    Соответствие.Вставить("310 60 20", КонструкторЦвета(16, 13, 175));
    Соответствие.Вставить("310 60 25", КонструкторЦвета(16, 13, 180));
    Соответствие.Вставить("310 60 30", КонструкторЦвета(17, 12, 184));
    Соответствие.Вставить("310 60 35", КонструкторЦвета(17, 12, 194));
    Соответствие.Вставить("310 70 10", КонструкторЦвета(18, 16, 185));
    Соответствие.Вставить("310 70 15", КонструкторЦвета(18, 16, 195));
    Соответствие.Вставить("310 70 20", КонструкторЦвета(19, 16, 199));
    Соответствие.Вставить("310 70 25", КонструкторЦвета(19, 15, 206));
    Соответствие.Вставить("310 80 10", КонструкторЦвета(20, 19, 214));
    Соответствие.Вставить("310 80 15", КонструкторЦвета(21, 19, 219));
    Соответствие.Вставить("310 90 05", КонструкторЦвета(23, 22, 234));
    Соответствие.Вставить("320 20 10", КонструкторЦвета(64, 53, 66));
    Соответствие.Вставить("320 20 15", КонструкторЦвета(68, 50, 71));
    Соответствие.Вставить("320 20 20", КонструкторЦвета(72, 45, 73));
    Соответствие.Вставить("320 20 25", КонструкторЦвета(72, 41, 77));
    Соответствие.Вставить("320 30 05", КонструкторЦвета(78, 72, 81));
    Соответствие.Вставить("320 30 10", КонструкторЦвета(84, 70, 85));
    Соответствие.Вставить("320 30 15", КонструкторЦвета(87, 64, 89));
    Соответствие.Вставить("320 30 20", КонструкторЦвета(94, 62, 94));
    Соответствие.Вставить("320 30 25", КонструкторЦвета(100, 6, 101));
    Соответствие.Вставить("320 30 30", КонструкторЦвета(101, 5, 105));
    Соответствие.Вставить("320 30 35", КонструкторЦвета(104, 5, 110));
    Соответствие.Вставить("320 30 37", КонструкторЦвета(109, 5, 114));
    Соответствие.Вставить("320 40 05", КонструкторЦвета(101, 9, 104));
    Соответствие.Вставить("320 40 10", КонструкторЦвета(108, 9, 110));
    Соответствие.Вставить("320 40 15", КонструкторЦвета(113, 9, 115));
    Соответствие.Вставить("320 40 20", КонструкторЦвета(117, 8, 118));
    Соответствие.Вставить("320 40 25", КонструкторЦвета(120, 8, 124));
    Соответствие.Вставить("320 40 30", КонструкторЦвета(126, 7, 126));
    Соответствие.Вставить("320 40 35", КонструкторЦвета(131, 7, 131));
    Соответствие.Вставить("320 40 40", КонструкторЦвета(133, 6, 139));
    Соответствие.Вставить("320 50 05", КонструкторЦвета(12, 11, 126));
    Соответствие.Вставить("320 50 10", КонструкторЦвета(13, 11, 133));
    Соответствие.Вставить("320 50 15", КонструкторЦвета(13, 11, 138));
    Соответствие.Вставить("320 50 20", КонструкторЦвета(14, 10, 143));
    Соответствие.Вставить("320 50 25", КонструкторЦвета(14, 10, 149));
    Соответствие.Вставить("320 50 30", КонструкторЦвета(15, 10, 154));
    Соответствие.Вставить("320 50 35", КонструкторЦвета(156, 9, 158));
    Соответствие.Вставить("320 50 40", КонструкторЦвета(159, 9, 164));
    Соответствие.Вставить("320 60 05", КонструкторЦвета(15, 14, 154));
    Соответствие.Вставить("320 60 10", КонструкторЦвета(15, 14, 159));
    Соответствие.Вставить("320 60 15", КонструкторЦвета(16, 13, 165));
    Соответствие.Вставить("320 60 20", КонструкторЦвета(17, 13, 169));
    Соответствие.Вставить("320 60 25", КонструкторЦвета(17, 12, 176));
    Соответствие.Вставить("320 60 30", КонструкторЦвета(18, 12, 181));
    Соответствие.Вставить("320 60 35", КонструкторЦвета(18, 12, 185));
    Соответствие.Вставить("320 70 05", КонструкторЦвета(17, 16, 178));
    Соответствие.Вставить("320 70 10", КонструкторЦвета(18, 16, 185));
    Соответствие.Вставить("320 70 15", КонструкторЦвета(18, 16, 192));
    Соответствие.Вставить("320 70 20", КонструкторЦвета(19, 15, 197));
    Соответствие.Вставить("320 70 25", КонструкторЦвета(20, 15, 203));
    Соответствие.Вставить("320 80 05", КонструкторЦвета(20, 19, 205));
    Соответствие.Вставить("320 80 10", КонструкторЦвета(21, 19, 213));
    Соответствие.Вставить("320 80 15", КонструкторЦвета(21, 18, 216));
    Соответствие.Вставить("320 90 05", КонструкторЦвета(23, 22, 234));
    Соответствие.Вставить("330 20 20", КонструкторЦвета(74, 43, 68));
    Соответствие.Вставить("330 20 25", КонструкторЦвета(82, 41, 74));
    Соответствие.Вставить("330 30 15", КонструкторЦвета(92, 67, 87));
    Соответствие.Вставить("330 30 20", КонструкторЦвета(98, 64, 90));
    Соответствие.Вставить("330 30 25", КонструкторЦвета(103, 59, 95));
    Соответствие.Вставить("330 30 30", КонструкторЦвета(109, 54, 97));
    Соответствие.Вставить("330 30 35", КонструкторЦвета(113, 5, 102));
    Соответствие.Вставить("330 30 40", КонструкторЦвета(118, 4, 103));
    Соответствие.Вставить("330 40 10", КонструкторЦвета(111, 9, 107));
    Соответствие.Вставить("330 40 15", КонструкторЦвета(116, 8, 111));
    Соответствие.Вставить("330 40 20", КонструкторЦвета(122, 8, 116));
    Соответствие.Вставить("330 40 25", КонструкторЦвета(128, 8, 118));
    Соответствие.Вставить("330 40 30", КонструкторЦвета(136, 7, 124));
    Соответствие.Вставить("330 40 35", КонструкторЦвета(141, 7, 127));
    Соответствие.Вставить("330 40 40", КонструкторЦвета(144, 6, 129));
    Соответствие.Вставить("330 40 45", КонструкторЦвета(147, 6, 131));
    Соответствие.Вставить("330 50 10", КонструкторЦвета(13, 11, 130));
    Соответствие.Вставить("330 50 15", КонструкторЦвета(14, 11, 136));
    Соответствие.Вставить("330 50 20", КонструкторЦвета(14, 10, 140));
    Соответствие.Вставить("330 50 25", КонструкторЦвета(15, 10, 142));
    Соответствие.Вставить("330 50 30", КонструкторЦвета(16, 10, 149));
    Соответствие.Вставить("330 50 35", КонструкторЦвета(164, 9, 152));
    Соответствие.Вставить("330 50 40", КонструкторЦвета(172, 9, 154));
    Соответствие.Вставить("330 60 10", КонструкторЦвета(16, 14, 156));
    Соответствие.Вставить("330 60 15", КонструкторЦвета(17, 13, 163));
    Соответствие.Вставить("330 60 20", КонструкторЦвета(17, 13, 166));
    Соответствие.Вставить("330 60 25", КонструкторЦвета(18, 12, 168));
    Соответствие.Вставить("330 60 30", КонструкторЦвета(18, 12, 174));
    Соответствие.Вставить("330 60 35", КонструкторЦвета(19, 11, 177));
    Соответствие.Вставить("330 60 40", КонструкторЦвета(19, 11, 182));
    Соответствие.Вставить("330 70 10", КонструкторЦвета(18, 16, 185));
    Соответствие.Вставить("330 70 15", КонструкторЦвета(19, 16, 187));
    Соответствие.Вставить("330 70 20", КонструкторЦвета(20, 15, 191));
    Соответствие.Вставить("330 70 25", КонструкторЦвета(21, 15, 196));
    Соответствие.Вставить("330 70 30", КонструкторЦвета(21, 15, 198));
    Соответствие.Вставить("330 80 10", КонструкторЦвета(21, 19, 209));
    Соответствие.Вставить("330 80 15", КонструкторЦвета(22, 19, 215));
    Соответствие.Вставить("330 80 20", КонструкторЦвета(23, 18, 218));
    Соответствие.Вставить("330 90 05", КонструкторЦвета(23, 22, 232));
    Соответствие.Вставить("340 20 05", КонструкторЦвета(59, 53, 59));
    Соответствие.Вставить("340 20 15", КонструкторЦвета(73, 48, 63));
    Соответствие.Вставить("340 20 20", КонструкторЦвета(79, 46, 67));
    Соответствие.Вставить("340 20 25", КонструкторЦвета(85, 42, 69));
    Соответствие.Вставить("340 30 05", КонструкторЦвета(80, 72, 79));
    Соответствие.Вставить("340 30 10", КонструкторЦвета(88, 68, 80));
    Соответствие.Вставить("340 30 15", КонструкторЦвета(96, 68, 85));
    Соответствие.Вставить("340 30 20", КонструкторЦвета(102, 64, 87));
    Соответствие.Вставить("340 30 25", КонструкторЦвета(108, 59, 90));
    Соответствие.Вставить("340 30 30", КонструкторЦвета(112, 53, 90));
    Соответствие.Вставить("340 30 35", КонструкторЦвета(118, 47, 93));
    Соответствие.Вставить("340 30 38", КонструкторЦвета(120, 43, 94));
    Соответствие.Вставить("340 40 05", КонструкторЦвета(102, 9, 100));
    Соответствие.Вставить("340 40 10", КонструкторЦвета(113, 9, 103));
    Соответствие.Вставить("340 40 15", КонструкторЦвета(119, 8, 106));
    Соответствие.Вставить("340 40 20", КонструкторЦвета(128, 8, 109));
    Соответствие.Вставить("340 40 25", КонструкторЦвета(132, 7, 112));
    Соответствие.Вставить("340 40 30", КонструкторЦвета(140, 7, 115));
    Соответствие.Вставить("340 40 35", КонструкторЦвета(142, 6, 116));
    Соответствие.Вставить("340 40 40", КонструкторЦвета(147, 6, 117));
    Соответствие.Вставить("340 40 45", КонструкторЦвета(157, 5, 121));
    Соответствие.Вставить("340 50 05", КонструкторЦвета(12, 11, 125));
    Соответствие.Вставить("340 50 10", КонструкторЦвета(13, 11, 128));
    Соответствие.Вставить("340 50 15", КонструкторЦвета(14, 11, 131));
    Соответствие.Вставить("340 50 20", КонструкторЦвета(15, 10, 134));
    Соответствие.Вставить("340 50 25", КонструкторЦвета(15, 10, 137));
    Соответствие.Вставить("340 50 30", КонструкторЦвета(166, 9, 138));
    Соответствие.Вставить("340 50 35", КонструкторЦвета(171, 9, 143));
    Соответствие.Вставить("340 50 40", КонструкторЦвета(180, 8, 145));
    Соответствие.Вставить("340 50 45", КонструкторЦвета(186, 7, 146));
    Соответствие.Вставить("340 60 05", КонструкторЦвета(15, 14, 150));
    Соответствие.Вставить("340 60 10", КонструкторЦвета(16, 14, 155));
    Соответствие.Вставить("340 60 15", КонструкторЦвета(17, 13, 158));
    Соответствие.Вставить("340 60 20", КонструкторЦвета(18, 13, 160));
    Соответствие.Вставить("340 60 25", КонструкторЦвета(18, 12, 163));
    Соответствие.Вставить("340 60 30", КонструкторЦвета(19, 12, 167));
    Соответствие.Вставить("340 60 35", КонструкторЦвета(20, 11, 168));
    Соответствие.Вставить("340 60 40", КонструкторЦвета(20, 11, 171));
    Соответствие.Вставить("340 70 05", КонструкторЦвета(18, 16, 177));
    Соответствие.Вставить("340 70 10", КонструкторЦвета(19, 16, 181));
    Соответствие.Вставить("340 70 15", КонструкторЦвета(20, 16, 185));
    Соответствие.Вставить("340 70 20", КонструкторЦвета(20, 15, 185));
    Соответствие.Вставить("340 70 25", КонструкторЦвета(21, 15, 188));
    Соответствие.Вставить("340 70 30", КонструкторЦвета(22, 14, 194));
    Соответствие.Вставить("340 70 35", КонструкторЦвета(23, 14, 195));
    Соответствие.Вставить("340 80 05", КонструкторЦвета(20, 19, 201));
    Соответствие.Вставить("340 80 10", КонструкторЦвета(22, 19, 209));
    Соответствие.Вставить("340 80 15", КонструкторЦвета(22, 18, 209));
    Соответствие.Вставить("340 80 20", КонструкторЦвета(23, 18, 214));
    Соответствие.Вставить("340 90 05", КонструкторЦвета(23, 22, 231));
    Соответствие.Вставить("340 92 05", КонструкторЦвета(24, 23, 237));
    Соответствие.Вставить("350 20 10", КонструкторЦвета(69, 53, 62));
    Соответствие.Вставить("350 20 20", КонструкторЦвета(82, 45, 63));
    Соответствие.Вставить("350 20 25", КонструкторЦвета(86, 41, 62));
    Соответствие.Вставить("350 20 30", КонструкторЦвета(96, 38, 67));
    Соответствие.Вставить("350 30 15", КонструкторЦвета(97, 67, 80));
    Соответствие.Вставить("350 30 20", КонструкторЦвета(106, 64, 84));
    Соответствие.Вставить("350 30 25", КонструкторЦвета(114, 61, 86));
    Соответствие.Вставить("350 30 30", КонструкторЦвета(118, 57, 86));
    Соответствие.Вставить("350 30 35", КонструкторЦвета(123, 50, 86));
    Соответствие.Вставить("350 30 40", КонструкторЦвета(127, 44, 87));
    Соответствие.Вставить("350 40 10", КонструкторЦвета(116, 9, 105));
    Соответствие.Вставить("350 40 15", КонструкторЦвета(121, 8, 102));
    Соответствие.Вставить("350 40 20", КонструкторЦвета(130, 8, 105));
    Соответствие.Вставить("350 40 25", КонструкторЦвета(135, 8, 106));
    Соответствие.Вставить("350 40 30", КонструкторЦвета(143, 7, 106));
    Соответствие.Вставить("350 40 35", КонструкторЦвета(148, 6, 109));
    Соответствие.Вставить("350 40 40", КонструкторЦвета(154, 6, 109));
    Соответствие.Вставить("350 40 45", КонструкторЦвета(159, 5, 110));
    Соответствие.Вставить("350 40 50", КонструкторЦвета(166, 4, 109));
    Соответствие.Вставить("350 50 10", КонструкторЦвета(13, 11, 126));
    Соответствие.Вставить("350 50 15", КонструкторЦвета(14, 11, 126));
    Соответствие.Вставить("350 50 20", КонструкторЦвета(15, 10, 130));
    Соответствие.Вставить("350 50 25", КонструкторЦвета(16, 10, 130));
    Соответствие.Вставить("350 50 30", КонструкторЦвета(170, 9, 132));
    Соответствие.Вставить("350 50 35", КонструкторЦвета(178, 9, 131));
    Соответствие.Вставить("350 50 40", КонструкторЦвета(185, 8, 133));
    Соответствие.Вставить("350 50 45", КонструкторЦвета(192, 8, 135));
    Соответствие.Вставить("350 50 50", КонструкторЦвета(200, 7, 135));
    Соответствие.Вставить("350 60 10", КонструкторЦвета(16, 14, 152));
    Соответствие.Вставить("350 60 15", КонструкторЦвета(17, 13, 154));
    Соответствие.Вставить("350 60 20", КонструкторЦвета(18, 13, 155));
    Соответствие.Вставить("350 60 25", КонструкторЦвета(19, 12, 154));
    Соответствие.Вставить("350 60 30", КонструкторЦвета(20, 12, 158));
    Соответствие.Вставить("350 60 35", КонструкторЦвета(20, 11, 160));
    Соответствие.Вставить("350 60 40", КонструкторЦвета(21, 11, 161));
    Соответствие.Вставить("350 60 45", КонструкторЦвета(22, 11, 163));
    Соответствие.Вставить("350 70 10", КонструкторЦвета(19, 16, 176));
    Соответствие.Вставить("350 70 15", КонструкторЦвета(20, 16, 178));
    Соответствие.Вставить("350 70 20", КонструкторЦвета(21, 15, 181));
    Соответствие.Вставить("350 70 25", КонструкторЦвета(22, 15, 183));
    Соответствие.Вставить("350 70 30", КонструкторЦвета(23, 14, 183));
    Соответствие.Вставить("350 70 35", КонструкторЦвета(23, 14, 185));
    Соответствие.Вставить("350 80 10", КонструкторЦвета(21, 19, 203));
    Соответствие.Вставить("350 80 15", КонструкторЦвета(22, 19, 206));
    Соответствие.Вставить("350 80 20", КонструкторЦвета(23, 18, 207));
    Соответствие.Вставить("350 90 05", КонструкторЦвета(23, 22, 229));
    Соответствие.Вставить("360 20 15", КонструкторЦвета(76, 46, 55));
    Соответствие.Вставить("360 30 05", КонструкторЦвета(81, 72, 76));
    Соответствие.Вставить("360 30 10", КонструкторЦвета(92, 72, 80));
    Соответствие.Вставить("360 30 15", КонструкторЦвета(98, 65, 76));
    Соответствие.Вставить("360 30 20", КонструкторЦвета(105, 62, 77));
    Соответствие.Вставить("360 30 25", КонструкторЦвета(110, 58, 76));
    Соответствие.Вставить("360 30 30", КонструкторЦвета(117, 51, 76));
    Соответствие.Вставить("360 30 35", КонструкторЦвета(125, 47, 76));
    Соответствие.Вставить("360 30 40", КонструкторЦвета(128, 43, 76));
    Соответствие.Вставить("360 40 05", КонструкторЦвета(104, 95, 98));
    Соответствие.Вставить("360 40 10", КонструкторЦвета(113, 9, 101));
    Соответствие.Вставить("360 40 15", КонструкторЦвета(121, 87, 98));
    Соответствие.Вставить("360 40 20", КонструкторЦвета(130, 8, 100));
    Соответствие.Вставить("360 40 25", КонструкторЦвета(137, 79, 99));
    Соответствие.Вставить("360 40 30", КонструкторЦвета(146, 7, 100));
    Соответствие.Вставить("360 40 35", КонструкторЦвета(152, 68, 99));
    Соответствие.Вставить("360 40 40", КонструкторЦвета(160, 6, 101));
    Соответствие.Вставить("360 40 45", КонструкторЦвета(163, 56, 98));
    Соответствие.Вставить("360 40 50", КонструкторЦвета(171, 46, 98));
    Соответствие.Вставить("360 50 05", КонструкторЦвета(13, 11, 124));
    Соответствие.Вставить("360 50 10", КонструкторЦвета(14, 11, 123));
    Соответствие.Вставить("360 50 15", КонструкторЦвета(14, 11, 122));
    Соответствие.Вставить("360 50 20", КонструкторЦвета(15, 10, 123));
    Соответствие.Вставить("360 50 25", КонструкторЦвета(16, 10, 124));
    Соответствие.Вставить("360 50 30", КонструкторЦвета(173, 9, 124));
    Соответствие.Вставить("360 50 35", КонструкторЦвета(181, 9, 124));
    Соответствие.Вставить("360 50 40", КонструкторЦвета(190, 8, 122));
    Соответствие.Вставить("360 50 45", КонструкторЦвета(196, 7, 123));
    Соответствие.Вставить("360 50 50", КонструкторЦвета(201, 7, 121));
    Соответствие.Вставить("360 60 05", КонструкторЦвета(15, 14, 149));
    Соответствие.Вставить("360 60 10", КонструкторЦвета(16, 14, 148));
    Соответствие.Вставить("360 60 15", КонструкторЦвета(17, 13, 149));
    Соответствие.Вставить("360 60 20", КонструкторЦвета(18, 13, 150));
    Соответствие.Вставить("360 60 25", КонструкторЦвета(19, 12, 150));
    Соответствие.Вставить("360 70 05", КонструкторЦвета(18, 17, 176));
    Соответствие.Вставить("360 70 10", КонструкторЦвета(19, 16, 174));
    Соответствие.Вставить("360 70 15", КонструкторЦвета(20, 16, 175));
    Соответствие.Вставить("360 80 05", КонструкторЦвета(21, 20, 202));
    Соответствие.Вставить("360 80 10", КонструкторЦвета(22, 19, 201));
    Соответствие.Вставить("360 90 05", КонструкторЦвета(24, 22, 226));
    Соответствие.Вставить("360 92 05", КонструкторЦвета(24, 23, 236));    
    
    Возврат Соответствие;
		
КонецФункции

// Возвращает таблицу Web-цветов, которые могут использоваться в CSS с абсолютными цветами.
// Таблица цветов взята на сайте http://www.cloford.com/resources/colours/namedcol.htm
//
// Возвращаемое значение:
//	Соответствие - Соответствие с цветами.
//
Функция КаталогCSSЦветов() Экспорт
	
	Соответствие = Новый Соответствие;

	Соответствие.Вставить("aliceblue", 			КонструкторЦвета(240, 248, 255));
	Соответствие.Вставить("antiquewhite", 		КонструкторЦвета(250, 235, 215));
	Соответствие.Вставить("aqua", 				КонструкторЦвета(000, 255, 255));
	Соответствие.Вставить("aquamarine", 		КонструкторЦвета(127, 255, 212));
	Соответствие.Вставить("azure", 				КонструкторЦвета(240, 255, 255));
	Соответствие.Вставить("beige", 				КонструкторЦвета(245, 245, 220));
	Соответствие.Вставить("bisque", 			КонструкторЦвета(255, 228, 196));
	Соответствие.Вставить("black", 				КонструкторЦвета(000, 000, 000));
	Соответствие.Вставить("blanchedalmond", 	КонструкторЦвета(255, 235, 205));
	Соответствие.Вставить("blue", 				КонструкторЦвета(000, 000, 255));
	Соответствие.Вставить("blueviolet", 		КонструкторЦвета(138, 043, 226));
	Соответствие.Вставить("brown", 				КонструкторЦвета(165, 042, 042));
	Соответствие.Вставить("burlywood", 			КонструкторЦвета(222, 184, 135));
	Соответствие.Вставить("cadetblue", 			КонструкторЦвета(095, 158, 160));
	Соответствие.Вставить("chartreuse", 		КонструкторЦвета(127, 255, 000));
	Соответствие.Вставить("chocolate", 			КонструкторЦвета(210, 105, 030));
	Соответствие.Вставить("coral", 				КонструкторЦвета(255, 127, 080));
	Соответствие.Вставить("cornflowerblue", 	КонструкторЦвета(100, 149, 237));
	Соответствие.Вставить("cornsilk", 			КонструкторЦвета(255, 248, 220));
	Соответствие.Вставить("crimson", 			КонструкторЦвета(220, 020, 060));
	Соответствие.Вставить("darkblue", 			КонструкторЦвета(000, 000, 139));
	Соответствие.Вставить("darkcyan", 			КонструкторЦвета(000, 139, 139));
	Соответствие.Вставить("darkgoldenrod", 		КонструкторЦвета(184, 134, 11));
	Соответствие.Вставить("darkgray", 			КонструкторЦвета(169, 169, 169));
	Соответствие.Вставить("darkgreen", 			КонструкторЦвета(000, 100, 000));
	Соответствие.Вставить("darkkhaki", 			КонструкторЦвета(189, 183, 107));
	Соответствие.Вставить("darkmagenta", 		КонструкторЦвета(139, 000, 139));
	Соответствие.Вставить("darkolivegreen", 	КонструкторЦвета(085, 107, 047));
	Соответствие.Вставить("darkorange", 		КонструкторЦвета(255, 140, 000));
	Соответствие.Вставить("darkorchid", 		КонструкторЦвета(153, 050, 204));
	Соответствие.Вставить("darkred", 			КонструкторЦвета(139, 000, 000));
	Соответствие.Вставить("darksalmon", 		КонструкторЦвета(233, 150, 122));
	Соответствие.Вставить("darkseagreen", 		КонструкторЦвета(143, 188, 143));
	Соответствие.Вставить("darkslateblue", 		КонструкторЦвета(072, 061, 139));
	Соответствие.Вставить("darkslategray", 		КонструкторЦвета(047, 079, 79));
	Соответствие.Вставить("darkturquoise", 		КонструкторЦвета(000, 206, 209));
	Соответствие.Вставить("darkviolet", 		КонструкторЦвета(148, 000, 211));
	Соответствие.Вставить("deeppink", 			КонструкторЦвета(255, 020, 147));
	Соответствие.Вставить("deepskyblue", 		КонструкторЦвета(000, 191, 255));
	Соответствие.Вставить("dimgray", 			КонструкторЦвета(105, 105, 105));
	Соответствие.Вставить("dodgerblue", 		КонструкторЦвета(030, 144, 255));
	Соответствие.Вставить("firebrick", 			КонструкторЦвета(178, 034, 034));
	Соответствие.Вставить("floralwhite", 		КонструкторЦвета(255, 250, 240));
	Соответствие.Вставить("forestgreen", 		КонструкторЦвета(034, 139, 034));
	Соответствие.Вставить("fuchsia", 			КонструкторЦвета(255, 000, 255));
	Соответствие.Вставить("gainsboro", 			КонструкторЦвета(220, 220, 220));
	Соответствие.Вставить("ghostwhite", 		КонструкторЦвета(248, 248, 255));
	Соответствие.Вставить("gold", 				КонструкторЦвета(255, 215, 000));
	Соответствие.Вставить("goldenrod", 			КонструкторЦвета(218, 165, 032));
	Соответствие.Вставить("gray", 				КонструкторЦвета(128, 128, 128));
	Соответствие.Вставить("green", 				КонструкторЦвета(000, 128, 000));
	Соответствие.Вставить("greenyellow", 		КонструкторЦвета(173, 255, 047));
	Соответствие.Вставить("honeydew", 			КонструкторЦвета(240, 255, 240));
	Соответствие.Вставить("hotpink", 			КонструкторЦвета(255, 105, 180));
	Соответствие.Вставить("indianred", 			КонструкторЦвета(205, 092, 092));
	Соответствие.Вставить("indigo", 			КонструкторЦвета(075, 000, 130));
	Соответствие.Вставить("ivory", 				КонструкторЦвета(255, 255, 240));
	Соответствие.Вставить("khaki", 				КонструкторЦвета(240, 230, 140));
	Соответствие.Вставить("lavender", 			КонструкторЦвета(230, 230, 250));
	Соответствие.Вставить("lavenderblush", 		КонструкторЦвета(255, 240, 245));
	Соответствие.Вставить("lawngreen", 			КонструкторЦвета(124, 252, 000));
	Соответствие.Вставить("lemonchiffon", 		КонструкторЦвета(255, 250, 205));
	Соответствие.Вставить("lightblue", 			КонструкторЦвета(173, 216, 230));
	Соответствие.Вставить("lightcoral", 		КонструкторЦвета(240, 128, 128));
	Соответствие.Вставить("lightcyan", 			КонструкторЦвета(224, 255, 255));
	Соответствие.Вставить("lightgoldenrodyellow", КонструкторЦвета(250, 250, 210));
	Соответствие.Вставить("lightgreen", 		КонструкторЦвета(144, 238, 144));
	Соответствие.Вставить("lightgrey", 			КонструкторЦвета(211, 211, 211));
	Соответствие.Вставить("lightpink", 			КонструкторЦвета(255, 182, 193));
	Соответствие.Вставить("lightsalmon", 		КонструкторЦвета(255, 160, 122));
	Соответствие.Вставить("lightseagreen", 		КонструкторЦвета(032, 178, 170));
	Соответствие.Вставить("lightskyblue", 		КонструкторЦвета(135, 206, 250));
	Соответствие.Вставить("lightslategray", 	КонструкторЦвета(119, 136, 153));
	Соответствие.Вставить("lightsteelblue", 	КонструкторЦвета(176, 196, 222));
	Соответствие.Вставить("lightyellow", 		КонструкторЦвета(255, 255, 224));
	Соответствие.Вставить("lime", 				КонструкторЦвета(000, 255, 000));
	Соответствие.Вставить("limegreen", 			КонструкторЦвета(050, 205, 050));
	Соответствие.Вставить("linen", 				КонструкторЦвета(250, 240, 230));
	Соответствие.Вставить("maroon", 			КонструкторЦвета(128, 000, 000));
	Соответствие.Вставить("mediumaquamarine", 	КонструкторЦвета(102, 205, 170));
	Соответствие.Вставить("mediumblue", 		КонструкторЦвета(000, 000, 205));
	Соответствие.Вставить("mediumorchid", 		КонструкторЦвета(186, 085, 211));
	Соответствие.Вставить("mediumpurple", 		КонструкторЦвета(147, 112, 219));
	Соответствие.Вставить("mediumseagreen", 	КонструкторЦвета(060, 179, 113));
	Соответствие.Вставить("mediumslateblue", 	КонструкторЦвета(123, 104, 238));
	Соответствие.Вставить("mediumspringgreen", 	КонструкторЦвета(000, 250, 154));
	Соответствие.Вставить("mediumturquoise", 	КонструкторЦвета(072, 209, 204));
	Соответствие.Вставить("mediumvioletred", 	КонструкторЦвета(199, 021, 133));
	Соответствие.Вставить("midnightblue", 		КонструкторЦвета(025, 025, 112));
	Соответствие.Вставить("mintcream", 			КонструкторЦвета(245, 255, 250));
	Соответствие.Вставить("mistyrose", 			КонструкторЦвета(255, 228, 225));
	Соответствие.Вставить("moccasin", 			КонструкторЦвета(255, 228, 181));
	Соответствие.Вставить("navajowhite", 		КонструкторЦвета(255, 222, 173));
	Соответствие.Вставить("navy", 				КонструкторЦвета(000, 000, 128));
	Соответствие.Вставить("oldlace", 			КонструкторЦвета(253, 245, 230));
	Соответствие.Вставить("olive", 				КонструкторЦвета(128, 128, 000));
	Соответствие.Вставить("olivedrab", 			КонструкторЦвета(107, 142, 035));
	Соответствие.Вставить("orange", 			КонструкторЦвета(255, 165, 000));
	Соответствие.Вставить("orangered", 			КонструкторЦвета(255, 069, 000));
	Соответствие.Вставить("orchid", 			КонструкторЦвета(218, 112, 214));
	Соответствие.Вставить("palegoldenrod", 		КонструкторЦвета(238, 232, 170));
	Соответствие.Вставить("palegreen", 			КонструкторЦвета(152, 251, 152));
	Соответствие.Вставить("paleturquoise", 		КонструкторЦвета(175, 238, 238));
	Соответствие.Вставить("palevioletred", 		КонструкторЦвета(219, 112, 147));
	Соответствие.Вставить("papayawhip", 		КонструкторЦвета(255, 239, 213));
	Соответствие.Вставить("peachpuff", 			КонструкторЦвета(255, 218, 185));
	Соответствие.Вставить("peru", 				КонструкторЦвета(205, 133, 63));
	Соответствие.Вставить("pink", 				КонструкторЦвета(255, 192, 203));
	Соответствие.Вставить("plum", 				КонструкторЦвета(221, 160, 221));
	Соответствие.Вставить("powderblue", 		КонструкторЦвета(176, 224, 230));
	Соответствие.Вставить("purple", 			КонструкторЦвета(128, 000, 128));
	Соответствие.Вставить("red", 				КонструкторЦвета(255, 000, 000));
	Соответствие.Вставить("rosybrown", 			КонструкторЦвета(188, 143, 143));
	Соответствие.Вставить("royalblue", 			КонструкторЦвета(065, 105, 225));
	Соответствие.Вставить("saddlebrown", 		КонструкторЦвета(139, 069, 019));
	Соответствие.Вставить("salmon", 			КонструкторЦвета(250, 128, 114));
	Соответствие.Вставить("sandybrown", 		КонструкторЦвета(244, 164, 96));
	Соответствие.Вставить("seagreen", 			КонструкторЦвета(046, 139, 087));
	Соответствие.Вставить("seashell", 			КонструкторЦвета(255, 245, 238));
	Соответствие.Вставить("sienna", 			КонструкторЦвета(160, 082, 045));
	Соответствие.Вставить("silver", 			КонструкторЦвета(192, 192, 192));
	Соответствие.Вставить("skyblue", 			КонструкторЦвета(135, 206, 235));
	Соответствие.Вставить("slateblue", 			КонструкторЦвета(106, 090, 205));
	Соответствие.Вставить("slategray", 			КонструкторЦвета(112, 128, 144));
	Соответствие.Вставить("snow", 				КонструкторЦвета(255, 250, 250));
	Соответствие.Вставить("springgreen", 		КонструкторЦвета(000, 255, 127));
	Соответствие.Вставить("steelblue", 			КонструкторЦвета(070, 130, 180));
	Соответствие.Вставить("tan", 				КонструкторЦвета(210, 180, 140));
	Соответствие.Вставить("teal", 				КонструкторЦвета(000, 128, 128));
	Соответствие.Вставить("thistle", 			КонструкторЦвета(216, 191, 216));
	Соответствие.Вставить("tomato", 			КонструкторЦвета(255, 099, 071));
	Соответствие.Вставить("turquoise", 			КонструкторЦвета(064, 224, 208));
	Соответствие.Вставить("violet", 			КонструкторЦвета(238, 130, 238));
	Соответствие.Вставить("wheat", 				КонструкторЦвета(245, 222, 179));
	Соответствие.Вставить("white", 				КонструкторЦвета(255, 255, 255));
	Соответствие.Вставить("whitesmoke", 		КонструкторЦвета(245, 245, 245));
	Соответствие.Вставить("yellow", 			КонструкторЦвета(255, 255, 000));
	Соответствие.Вставить("yellowgreen", 		КонструкторЦвета(154, 205, 050));	
	
	Возврат Соответствие;
	
КонецФункции

#КонецОбласти

#Область СлучайныеЦвета

// Создает и возвращает случайный цвет.
//
// Возвращаемое значение:
//	Цвет - случайный цвет.
//
Функция СлучайныйЦвет() Экспорт
	
	МаксимумЦвет = 255;
		
	Красный = СлучайноеЧисло(0, МаксимумЦвет);
	Зеленый = СлучайноеЧисло(0, МаксимумЦвет);
	Синий 	= СлучайноеЧисло(0, МаксимумЦвет);

	Возврат КонструкторЦвета(Красный, Зеленый, Синий);
	
КонецФункции

// Создает и возвращает случайный светлый цвет.
//
// Возвращаемое значение:
//	Цвет - случайный светлый цвет.
//
Функция СлучайныйСветлыйЦвет() Экспорт
	
	НижняяГраница	= 200;
	МаксимумЦвет 	= 255;
		
	Красный = СлучайноеЧисло(НижняяГраница, МаксимумЦвет);
	Зеленый = СлучайноеЧисло(НижняяГраница, МаксимумЦвет);
	Синий 	= СлучайноеЧисло(НижняяГраница, МаксимумЦвет);

	Возврат КонструкторЦвета(Красный, Зеленый, Синий);
	
КонецФункции

// Создает и возвращает случайный темный цвет.
//
// Возвращаемое значение:
//	Цвет - случайный темный цвет.
//
Функция СлучайныйТемныйЦвет() Экспорт
	
	ВерхняяГраница = 128;
	
	Красный = СлучайноеЧисло(0, ВерхняяГраница);
	Зеленый = СлучайноеЧисло(0, ВерхняяГраница);
	Синий 	= СлучайноеЧисло(0, ВерхняяГраница);

	Возврат КонструкторЦвета(Красный, Зеленый, Синий);
	
КонецФункции

// Создает и возвращает случайный цвет из каталога RAL Standart.
//
// Возвращаемое значение:
//	Цвет - случайный цвет из каталога RAL Standart.
//
Функция СлучайныйЦветRALStandart() Экспорт
    
    Соответствие = КаталогRALStandart();
    Массив = Новый Массив;
    Для Каждого КЗ Из Соответствие Цикл
        Массив.Добавить(КЗ.Значение);
    КонецЦикла;
    
    Индекс  = СлучайноеЧисло(0, Массив.Количество() - 1);
    
    Возврат Массив[Индекс];
              
КонецФункции

// Создает и возвращает случайный цвет из системной переменной WebЦвета.
//
// Возвращаемое значение:
//	Цвет - случайный цвет из каталога RAL Standart.
//
Функция СлучайныйWebЦвет() Экспорт
    
    Соответствие = КаталогWebЦветов();
    Массив = Новый Массив;
    Для Каждого КЗ Из Соответствие Цикл
        Массив.Добавить(КЗ.Значение);
	КонецЦикла;
    
    Индекс = СлучайноеЧисло(0, Массив.Количество() - 1);
    
    Возврат Массив[Индекс];
              
КонецФункции

#КонецОбласти

#Область Прочее

// Функция возвращает набор пастельных цветов в порядке их взаимной контрастности
//
// Возвращаемое значение:
//  Массив - массив цветов для использования в сериях на диаграммах
Функция ЦветаСерийДиаграмм() Экспорт
	
	МассивЦветов = Новый Массив;
	
	МассивЦветов.Добавить(КонструкторЦвета(245, 152, 150));
	МассивЦветов.Добавить(КонструкторЦвета(142, 201, 249));
	МассивЦветов.Добавить(КонструкторЦвета(255, 202, 125));
	МассивЦветов.Добавить(КонструкторЦвета(178, 154, 218));
	МассивЦветов.Добавить(КонструкторЦвета(163, 214, 166));
	МассивЦветов.Добавить(КонструкторЦвета(244, 140, 175));
	МассивЦветов.Добавить(КонструкторЦвета(125, 221, 233));
	МассивЦветов.Добавить(КонструкторЦвета(255, 242, 128));
	МассивЦветов.Добавить(КонструкторЦвета(205, 145, 215));
	МассивЦветов.Добавить(КонструкторЦвета(125, 202, 194));
	
	Возврат МассивЦветов;
	
КонецФункции

// Функция - Цвет по номеру картинки
//
// Параметры:
//  НомерКартинки - Число - номер картинки цвета из библиотеки картинок
// 
// Возвращаемое значение:
//  Цвет - цвет картинки
//
Функция ЦветПоНомеруКартинки(Знач НомерКартинки) Экспорт
	
	Соответствие = Новый Соответствие;
	
	Соответствие.Вставить(1,  КонструкторЦвета(172,114,94));
	Соответствие.Вставить(2,  КонструкторЦвета(208,107,100));
	Соответствие.Вставить(3,  КонструкторЦвета(248,58,34));
	Соответствие.Вставить(4,  КонструкторЦвета(250,87,60));
	Соответствие.Вставить(5,  КонструкторЦвета(255,117,55));
	Соответствие.Вставить(6,  КонструкторЦвета(255,173,70));
	Соответствие.Вставить(7,  КонструкторЦвета(66,214,146));
	Соответствие.Вставить(8,  КонструкторЦвета(22,167,101));
	Соответствие.Вставить(9,  КонструкторЦвета(123,209,72));
	Соответствие.Вставить(10, КонструкторЦвета(179,220,108));
	Соответствие.Вставить(11, КонструкторЦвета(251,233,131));
	Соответствие.Вставить(12, КонструкторЦвета(250,209,101));
	Соответствие.Вставить(13, КонструкторЦвета(146,225,192));
	Соответствие.Вставить(14, КонструкторЦвета(159,225,231));
	Соответствие.Вставить(15, КонструкторЦвета(159,198,231));
	Соответствие.Вставить(16, КонструкторЦвета(73,134,231));
	Соответствие.Вставить(17, КонструкторЦвета(154,156,255));
	Соответствие.Вставить(18, КонструкторЦвета(185,154,255));
	Соответствие.Вставить(19, КонструкторЦвета(194,194,194));
	Соответствие.Вставить(20, КонструкторЦвета(202,189,191));
	Соответствие.Вставить(21, КонструкторЦвета(204,166,172));
	Соответствие.Вставить(22, КонструкторЦвета(246,145,178));
	Соответствие.Вставить(23, КонструкторЦвета(205,116,230));
	Соответствие.Вставить(24, КонструкторЦвета(164,122,226));
	
	Возврат Соответствие[НомерКартинки];
	
КонецФункции

// Функция - Картинка цвета по номеру картинки
//
// Параметры:
//  НомерКартинки - Число - номер картинки цвета из библиотеки картинок
// 
// Возвращаемое значение:
//  Картинка - картинка цвета из библиотеки картинок
//
Функция КартинкаЦветаПоНомеруКартинки(Знач НомерКартинки) Экспорт
	
	НомерСтрокой = Формат(НомерКартинки, "ЧЦ=2; ЧВН=");
	Возврат БиблиотекаКартинок["Цвет" + НомерСтрокой];
	
КонецФункции

// Конструктор создания цвета, для уменьшения срабатываний проверки правил в конфигурации АПК.
//
// Параметры:
//	Красный - Число - составляющая красного цвета.
//	Зеленый - Число - составляющая зеленого цвета.
//	Синий - Число - составляющая синего цвета.
//
// Возвращаемое значение:
//	Цвет - цвет созданный через конструктор.
//
Функция КонструкторЦвета(Знач Красный = 0, Знач Зеленый = 0, Знач Синий = 0) Экспорт
	
	// АПК:1346-выкл Конструктор необходим при конвертации цветов
	// BSLLS:StyleElementConstructors-off
	Возврат Новый Цвет(Красный, Зеленый, Синий);
	// BSLLS:StyleElementConstructors-on
	// АПК:1346-вкл
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция переводит шестнадцатеричное число в десятичное
//
// Параметры: 
//	Число16 - Строка - HEX-число
//
// Возвращаемое значение:
//	Число - Десятичное число
//
Функция HexToDecЧисло(Знач Число16)
	
	Если Число16 = "0" Тогда 
		Возврат 0;
	КонецЕсли;
	
	Строка	 		= "0123456789ABCDEF";
	Число16 		= СокрЛП(Число16);
	СтаршаяСтепень 	= СтрДлина(Число16) - 1;
	Результат 		= 0;
	Индекс 			= 1;
	Основание		= 16;
	Пока СтаршаяСтепень >= 0 Цикл
		ТекущийСимвол 	= Сред(Число16, Индекс, 1);
		Представление 	= СтрНайти(Строка, ТекущийСимвол) - 1;
		Результат 		= Результат + Представление * Pow(Основание, СтаршаяСтепень);
		СтаршаяСтепень 	= СтаршаяСтепень - 1;
		Индекс	 		= Индекс + 1;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // HexToDec()   

// Конвертация из десятичной в любую систему счисления.
//
// Параметры:
//	Значение - Число - исходное значение.
//	Нотация - Число - основание системы счисления.
//
// Возвращаемое значение:
//	Строка - значение в нужной системе счисления.
//
Функция Из_10_В_Любую(Знач Значение = 0, Знач Нотация = 16)
	
	Если Нотация <= 0 Тогда 
		Возврат "";
	КонецЕсли;
	Значение = Число(Значение);
	Если Значение <= 0 Тогда 
		Возврат "0";
	КонецЕсли;
	
	Значение = Цел(Значение);
	Результат = "";
	Строка = "0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ"; 
	Пока Значение > 0 Цикл
		Результат = Сред(Строка, Значение % Нотация + 1, 1) + Результат;
		Значение = Цел(Значение / Нотация);		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Вспомогательная функция перевода из системы HSL в RGB.
//
// Параметры:
//	ПервыйПараметр - Число - p 
//	ВторойПараметр - Число - q
//	Тон - Число - t тон
//
// Возвращаемое значение:
//	Число - промежуточное значение.
//
Функция ТонВЦвет(Знач ПервыйПараметр, Знач ВторойПараметр, Знач Тон)
	
	МаксимумЧастей	= 6;
	ДвеЧасти		= 2;
	ТриЧасти		= 3;
	
    Если Тон < 0 Тогда 
        Тон = Тон + 1; 
    КонецЕсли;
    Если Тон > 1 Тогда 
        Тон = Тон - 1;
    КонецЕсли;
    Если Тон < 1 / МаксимумЧастей Тогда 
        Возврат ПервыйПараметр + (ВторойПараметр - ПервыйПараметр) * МаксимумЧастей * Тон; 
    КонецЕсли;
    Если Тон < 1 / ДвеЧасти Тогда 
        Возврат ВторойПараметр; 
    КонецЕсли;
    Если Тон < ДвеЧасти / ТриЧасти Тогда 
        Возврат ПервыйПараметр + (ВторойПараметр - ПервыйПараметр) * (ДвеЧасти / ТриЧасти - Тон) * МаксимумЧастей; 
    КонецЕсли;
    
    Возврат ПервыйПараметр;
  
КонецФункции

// Возвращает случайное число. Работает как в веб-клиенте, так и в тонком.
// В веб-клиенте не использует ГенераторСлучайныхЧисел.
//
// Параметры:
//	МинимальноеЗначение - Число - минимальная граница случайного числа.
//	МаксимальноеЗначение - Число - максимальная граница случайного числа.
//
// Возвращаемое значение:
//	Число - случайное число в диапазоне переданных чисел (включая минимум и максимум).
//
Функция СлучайноеЧисло(Знач МинимальноеЗначение = 0, Знач МаксимальноеЗначение = 100)
	
	// Находим длину диапазона
	Альфа = МаксимальноеЗначение - МинимальноеЗначение;
	
	УИД = НРег(Новый УникальныйИдентификатор);
	Пока Истина Цикл
		УИД = СтрЗаменить(УИД,"-","");
		УИД = СтрЗаменить(УИД,"a","");
		УИД = СтрЗаменить(УИД,"b","");
		УИД = СтрЗаменить(УИД,"c","");
		УИД = СтрЗаменить(УИД,"d","");
		УИД = СтрЗаменить(УИД,"e","");
		УИД = СтрЗаменить(УИД,"f","");
		Если НЕ ПустаяСтрока(УИД) Тогда
			Прервать;
		Иначе
			УИД = НРег(Новый УникальныйИдентификатор);
		КонецЕсли;
	КонецЦикла;
	
	#Если ВебКлиент Тогда
		
	// Получаем диапазон от 0 до 1
	ЧислоУИД = Число("0." + УИД);
	// Проецируем диапазон от 0 до 1 на отрезок [МинимальноеЗначение, МаксимальноеЗначение]
	ЧислоУИД = МинимальноеЗначение + Окр(ЧислоУИД * Альфа);
	Если ЧислоУИД < МинимальноеЗначение Тогда
		ЧислоУИД = МинимальноеЗначение;	
	ИначеЕсли ЧислоУИД > МаксимальноеЗначение Тогда
		ЧислоУИД = МаксимальноеЗначение;	
	КонецЕсли;
	
	Возврат ЧислоУИД;
	
	#Иначе
	
	// Инициализируем по переданному числу, чтобы последовательные вызовы возвращали разные значения.
	ГСЧ = Новый ГенераторСлучайныхЧисел(Число(УИД));	
	Возврат ГСЧ.СлучайноеЧисло(МинимальноеЗначение, МаксимальноеЗначение);
	
	#КонецЕсли
	
КонецФункции

// Формирует строку повторяющихся символов заданной длины.
//
// Параметры:
//  Символ      - Строка - символ, из которого будет формироваться строка.
//  ДлинаСтроки - Число  - требуемая длина результирующей строки.
//
// Возвращаемое значение:
//  Строка - строка, состоящая из повторяющихся символов.
//
Функция СформироватьСтрокуСимволов(Знач Символ, Знач ДлинаСтроки) Экспорт
	
	Результат = "";
	Для Счетчик = 1 По ДлинаСтроки Цикл
		Результат = Результат + Символ;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Дополняет строку символами слева или справа до заданной длины и возвращает ее.
// При этом удаляются незначащие символы слева и справа (подробнее про незначащие символы 
// см. синтакс-помощник к методу платформы СокрЛП). 
// По умолчанию функция дополняет строку символами "0" (ноль) слева.
//
// Параметры:
//  Значение    - Строка - исходная строка, которую необходимо дополнить символами;
//  ДлинаСтроки - Число  - требуемая результирующая длина строки;
//  Символ      - Строка - символ, которым необходимо дополнить строку;
//  Режим       - Строка - "Слева" или "Справа" - вариант добавления символов к исходной строке.
// 
// Возвращаемое значение:
//  Строка - строка, дополненная символами.
//
// Пример:
//  1. Результат = ДополнитьСтроку("1234", 10, "0", "Слева");
//  Возвращает: "0000001234".
//
//  2. Результат = ДополнитьСтроку(" 1234  ", 10, "#", "Справа");
//  Строка = " 1234  "; ДлинаСтроки = 10; Символ = "#"; Режим = "Справа"
//  Возвращает: "1234######".
//
Функция ДополнитьСтроку(Знач Значение, Знач ДлинаСтроки, Знач Символ = "0", Знач Режим = "Слева")
	
	// Длина символа не должна превышать единицы.
	Символ = Лев(Символ, 1);
	
	// Удаляем крайние пробелы слева и справа строки.
	Значение = СокрЛП(Значение);
	КоличествоСимволовНадоДобавить = ДлинаСтроки - СтрДлина(Значение);
	
	Если КоличествоСимволовНадоДобавить > 0 Тогда
		
		СтрокаДляДобавления = СформироватьСтрокуСимволов(Символ, КоличествоСимволовНадоДобавить);
		Если ВРег(Режим) = "СЛЕВА" Тогда
			Значение = СтрокаДляДобавления + Значение;
		ИначеЕсли ВРег(Режим) = "СПРАВА" Тогда
			Значение = Значение + СтрокаДляДобавления;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

// Возвращает числовой вес версии для сравнения версий между собой
//
// Параметры:
//  Версия - Строка - Версия в строковом формате
//
// Возвращаемое значение:
//  Число - вес версии
//
Функция ВесВерсии(Знач Версия)
	
	Если Версия = "" Тогда
		Возврат 0;
	КонецЕсли;
	
	Массив = СтрРазделить(Версия, ".");
	ПерваяВерсия = 1000000000;
	ВтораяВерсия = 1000000;
	ТретьяВерсия = 1000;
	
	Возврат	Число(Массив[0]) * ПерваяВерсия
		+ Число(Массив[1]) * ВтораяВерсия
		+ Число(Массив[2]) * ТретьяВерсия
		+ Число(Массив[3]);	
	
	КонецФункции
	
#КонецОбласти