
&НаСервере
Функция ОбработкаОбъект()
	
	Возврат РеквизитФормыВЗначение("Объект");
	
КонецФункции

&НаСервере
Процедура КонвертироватьНаСервере()
	
	ЦветHex = ОбработкаОбъект().ЦветВHex(Цвет);
	
	Структура = ОбработкаОбъект().ЦветВCMYK(Цвет);
	ЦветCMYK = СтрШаблон(НСтр("ru = 'с = %1, m = %2, y = %3, k = %4'"), 
		Структура.c, Структура.m, Структура.y, Структура.k);
		
	Структура = ОбработкаОбъект().ЦветВHSV(Цвет);
	ЦветHSV = СтрШаблон(НСтр("ru = 'h = %1, s = %2, v = %3'"), 
		Структура.h, Структура.s, Структура.v);
		
	Структура = ОбработкаОбъект().ЦветВHSL(Цвет);
	ЦветHSL = СтрШаблон(НСтр("ru = 'h = %1, s = %2, l = %3'"), 
		Структура.h, Структура.s, Структура.l);
		
	ЦветАбс = ОбработкаОбъект().АбсолютныйЦвет(Цвет);
	ЦветRGB = СтрШаблон(НСтр("ru = 'r = %1, g = %2, b = %3'"), 
		ЦветАбс.Красный, ЦветАбс.Зеленый, ЦветАбс.Синий);
	
КонецПроцедуры
	
&НаСервере
Процедура ОбработкаЦветаНаСервере(Знач Метод = 0)
	
	Если Метод = 0 Тогда
		Цвет = ОбработкаОбъект().СлучайныйЦвет();
	ИначеЕсли Метод = 1 Тогда
		Цвет = ОбработкаОбъект().СлучайныйСветлыйЦвет();
	ИначеЕсли Метод = 2 Тогда
		Цвет = ОбработкаОбъект().СлучайныйТемныйЦвет();
	ИначеЕсли Метод = 3 Тогда
		Цвет = ОбработкаОбъект().СлучайныйЦветRALStandart();
	ИначеЕсли Метод = 4 Тогда
		Цвет = ОбработкаОбъект().СлучайныйWebЦвет();
	ИначеЕсли Метод = 5 Тогда
		Цвет = ОбработкаОбъект().ОсветлитьЦвет(Цвет, 10);
	ИначеЕсли Метод = 6 Тогда
		Цвет = ОбработкаОбъект().ЗатемнитьЦвет(Цвет, 10);
	ИначеЕсли Метод = 7 Тогда
		ЦветРезультат = ОбработкаОбъект().СмешатьДваЦвета(Цвет1, Цвет2, Баланс);
	ИначеЕсли Метод = 8 Тогда
		Цвет = ОбработкаОбъект().ГрадацииСерогоAverage(Цвет);
	ИначеЕсли Метод = 9 Тогда
		Массив = ОбработкаОбъект().ПолучитьГрадиент(ЦветНачалоГрадиента, ЦветКонецГрадиента, КоличествоГрадаций);
		ТаблицаГрадиент.Очистить();
		Для Каждого ЦветГрадации Из Массив Цикл
			НоваяСтрока = ТаблицаГрадиент.Добавить();
			НоваяСтрока.Название = ОбработкаОбъект().ЦветВHex(ЦветГрадации);
			НоваяСтрока.Цвет = ЦветГрадации;
		КонецЦикла;
	ИначеЕсли Метод = 10 Тогда
		Цвет = ОбработкаОбъект().АбсолютныйЦвет(ОбработкаОбъект().ЦветВHex(WindowsЦвета.РабочийСтол));
	КонецЕсли;
	КонвертироватьНаСервере();
	ОбновитьПример();
	
КонецПроцедуры

&НаКлиенте
Процедура Конвертировать(Команда)
	
	КонвертироватьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СгенерироватьСлучайныйЦвет(Команда)
	
	ОбработкаЦветаНаСервере(0);
	
КонецПроцедуры

&НаКлиенте
Процедура СгенерироватьСлучайныйСветлыйЦвет(Команда)
	
	ОбработкаЦветаНаСервере(1);
	
КонецПроцедуры

&НаКлиенте
Процедура СгенерироватьСлучайныйТемныйЦвет(Команда)
	
	ОбработкаЦветаНаСервере(2);
	
КонецПроцедуры

&НаКлиенте
Процедура СлучайныйWebЦвет(Команда)
	
	ОбработкаЦветаНаСервере(4);
	
КонецПроцедуры

&НаКлиенте
Процедура СгенерироватьСлучайныйЦветКаталогаRAL(Команда)
	
	ОбработкаЦветаНаСервере(3);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветПриИзменении(Элемент)
	
	КонвертироватьНаСервере();
	ОбновитьПример();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПример()
	
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.Конвертация Тогда
		Элементы.Пример.ЦветФона = Цвет;
		Элементы.Пример.ЦветТекста = ОбработкаОбъект().КонтрастныйЦвет(Цвет);	
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СмешиваниеЦветов Тогда
		Элементы.Пример.ЦветФона = ЦветРезультат;
		Элементы.Пример.ЦветТекста = ОбработкаОбъект().КонтрастныйЦвет(ЦветРезультат);
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.Градиент Тогда
		Элементы.Пример.ЦветФона = ТекущийЦвет;
		Элементы.Пример.ЦветТекста = ОбработкаОбъект().КонтрастныйЦвет(ТекущийЦвет);
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.Каталоги Тогда
		Если Элементы.КаталогиЦветов.ТекущаяСтраница = Элементы.КаталогWebЦветов Тогда
			Элементы.Пример.ЦветФона = ТекущийWebЦвет;
			Элементы.Пример.ЦветТекста = ОбработкаОбъект().КонтрастныйЦвет(ТекущийWebЦвет);
		ИначеЕсли Элементы.КаталогиЦветов.ТекущаяСтраница = Элементы.RALStandart Тогда
			Элементы.Пример.ЦветФона = ТекущийЦветRALStandart;
			Элементы.Пример.ЦветТекста = ОбработкаОбъект().КонтрастныйЦвет(ТекущийЦветRALStandart);
		ИначеЕсли Элементы.КаталогиЦветов.ТекущаяСтраница = Элементы.CSS Тогда
			Элементы.Пример.ЦветФона = ТекущийЦветCSS;
			Элементы.Пример.ЦветТекста = ОбработкаОбъект().КонтрастныйЦвет(ТекущийЦветCSS);
		КонецЕсли;
	КонецЕсли;
	
	Элементы.ПримерИнвертированный.ЦветФона = Элементы.Пример.ЦветТекста;
	Элементы.ПримерИнвертированный.ЦветТекста = Элементы.Пример.ЦветФона;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПримерНаКлиенте()
	
	ОбновитьПример();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбработкаЦветаНаСервере(0);
	
	Баланс = 50;
	Цвет1 = ОбработкаОбъект().СлучайныйТемныйЦвет();
	Цвет2 = ОбработкаОбъект().СлучайныйСветлыйЦвет();
	ОбработкаЦветаНаСервере(7);
	
	КоличествоГрадаций = 5;
	ЦветНачалоГрадиента = ОбработкаОбъект().СлучайныйСветлыйЦвет();
	ЦветКонецГрадиента = ОбработкаОбъект().СлучайныйТемныйЦвет();
	ОбработкаЦветаНаСервере(9);
			
	Соответствие = ОбработкаОбъект().КаталогWebЦветов();
	Для Каждого КЗ Из Соответствие Цикл
		НоваяСтрока = ТаблицаWebЦвета.Добавить();
		НоваяСтрока.Название = КЗ.Ключ;
		НоваяСтрока.Цвет = КЗ.Значение;
	КонецЦикла;
	ТаблицаWebЦвета.Сортировать("Название");
	
	Соответствие = ОбработкаОбъект().КаталогCSSЦветов();
	Для Каждого КЗ Из Соответствие Цикл
		НоваяСтрока = ТаблицаCSS.Добавить();
		НоваяСтрока.Название = КЗ.Ключ;
		НоваяСтрока.Цвет = КЗ.Значение;
	КонецЦикла;
	ТаблицаCSS.Сортировать("Название");
	
	Соответствие = ОбработкаОбъект().КаталогRALStandart();
	Для Каждого КЗ Из Соответствие Цикл
		НоваяСтрока = ТаблицаRALStandart.Добавить();
		НоваяСтрока.Название = КЗ.Ключ;
		НоваяСтрока.Цвет = КЗ.Значение;
	КонецЦикла;
	ТаблицаRALStandart.Сортировать("Название");	
	
КонецПроцедуры

&НаКлиенте
Процедура Осветлить(Команда)
	
	ОбработкаЦветаНаСервере(5);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗатемнитьЦветНа10Процентов(Команда)
	
	ОбработкаЦветаНаСервере(6);
	
КонецПроцедуры

&НаКлиенте
Процедура Смешать(Команда)
	
	ОбработкаЦветаНаСервере(7);
	
КонецПроцедуры

&НаКлиенте
Процедура Цвет1ПриИзменении(Элемент)
	
	ОбработкаЦветаНаСервере(7);
	
КонецПроцедуры


&НаКлиенте
Процедура Цвет2ПриИзменении(Элемент)
	
	ОбработкаЦветаНаСервере(7);
	
КонецПроцедуры


&НаКлиенте
Процедура БалансПриИзменении(Элемент)
	
	ОбработкаЦветаНаСервере(7);
	
КонецПроцедуры


&НаКлиенте
Процедура ГрадацияСерого(Команда)
	
	ОбработкаЦветаНаСервере(8);
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоГрадацийПриИзменении(Элемент)
	
	ОбработкаЦветаНаСервере(9);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветНачалоГрадиентаПриИзменении(Элемент)
	
	ОбработкаЦветаНаСервере(9);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветКонецГрадиентаПриИзменении(Элемент)
	
	ОбработкаЦветаНаСервере(9);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаRALStandartПриАктивизацииСтроки(Элемент)
	
	Если Элементы.ТаблицаRALStandart.ТекущиеДанные <> Неопределено Тогда
		ТекущийЦветRALStandart = Элементы.ТаблицаRALStandart.ТекущиеДанные.Цвет;
	КонецЕсли;	
	ПодключитьОбработчикОжидания("ОбновитьПримерНаКлиенте", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаCSSПриАктивизацииСтроки(Элемент)
	
	Если Элементы.ТаблицаCSS.ТекущиеДанные <> Неопределено Тогда
		ТекущийЦветCSS = Элементы.ТаблицаCSS.ТекущиеДанные.Цвет;
	КонецЕсли;	
	ПодключитьОбработчикОжидания("ОбновитьПримерНаКлиенте", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаWebЦветаПриАктивизацииСтроки(Элемент)
	
	Если Элементы.ТаблицаWebЦвета.ТекущиеДанные <> Неопределено Тогда
		ТекущийWebЦвет = Элементы.ТаблицаWebЦвета.ТекущиеДанные.Цвет;
	КонецЕсли;	
	ПодключитьОбработчикОжидания("ОбновитьПримерНаКлиенте", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.Конвертация
		ИЛИ Элементы.Страницы.ТекущаяСтраница = Элементы.СмешиваниеЦветов Тогда
		ПодключитьОбработчикОжидания("ОбновитьПримерНаКлиенте", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаГрадиентПриАктивизацииСтроки(Элемент)
	
	Если Элементы.ТаблицаГрадиент.ТекущиеДанные <> Неопределено Тогда
		ТекущийЦвет = Элементы.ТаблицаГрадиент.ТекущиеДанные.Цвет;
	КонецЕсли;
	ПодключитьОбработчикОжидания("ОбновитьПримерНаКлиенте", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветСтиля(Команда)
	
	ОбработкаЦветаНаСервере(10);
	
КонецПроцедуры
